{"title":"Brink.Update.7-SKIDROW","uid":6490600,"size":18209906,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:008d0edbd7bf9cba5d01d9be83b195c5bf0c102e&amp;dn=Brink.Update.7-SKIDROW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"soupucia","files":7,"time":1308868545,"description":"S  K  I  D  R  O  W\n.the leading force.\n\nproudly presents\nBrink Update 7\n\n23-06-2011........Release Date &lt;-&gt; Protection...............Steam\nFPS..................Game Type &lt;-&gt; Disk(s)....................DOX\n\nRELEASE NOTES\n\nRead changelog.txt for information on updated content!\n\nINSTALL NOTES\n\n1. Unpack release\n2. Run Brink.Update.7.exe\n3. Install\n4. Copy the cracked content from the SKIDROW folder to the main install\nfolder and overwrite\n5. Play the game\n6. Support the companies, which software you actually enjoy!\n\nADDITIONAL NOTES\n\nFully compatible with the POSTMORTEM version with all languages!\n\nYou don't need to have any of the previous updates installed, as this\nupdate is featuring all previous updated content.\n\nGREETINGS\n\nUnleashed - TiNYiSO - MRN - RADIKAL - POSTMORTEM - GENESIS - SHOCK\nCRUDE - ReUnion - VACE - OUTLAWS - BACKLASH - Titan\n\nascii art by the\ngodlike &amp; terrific duo\nmalodix + irokos\ntitan artdivision\n\n-----\n\nBrink Update 7 info:\n\n\nA brand-new update is now available for the PC version of Brink, containing a huge stack of improvements and fixes. End game chat, a new Stopwatch results screen, VoIP sliders, a fix for invisible players, networking optimizations, and a massive amount of weapon tweaks are all among the things you'll be getting in this one, and we've assembled the complete changelog for your perusal below. All you need to do to get the update is sign into Steam.\n\nFor the dedicated server admins among you, there's a new server available, too, and it's freshly optimized to cut the filesize down to a third. If you haven't already, we recommend updating your server as soon as possible - as before, players with the new update will not be able to connect to servers running the old version of Brink.\n\nWith all that out of the way, here's the full changelog for this update:\n\nGeneral\n\n- Fixed invisible players sometimes (dis)appearing\n- Combat Intuition no longer gets triggered by disguised players\n- Flash Bangs no longer affect spectators\n- Fixed being able to collide with grenades as a spectator\n- Fixed drag-to still applying when enemies respawned\n- Enabling cheats now disables character saving and stats reporting for that session\n- Team switch delays now get reset on map restart\n- Vsync is now enabled by default\n- Fixed 3rd person animation when hacking as an Operative\n- Fixed server/client aim issues\n- Fixed dark shadow-band on narrow FOVs\n- Fixed potential crash during map load on client if heavily lagged right before a map change\n- Fixed potential crash if disguising on a dedicated server\n- Fixed odd line appearing during some cinematics \n\nLevels\n\n- Fixed overtime when repairing the crane on Shipyard\n- Fixed overtime not ending when Hackbox is removed on Reactor\n- Fixed Container City lab door sometimes appearing closed for clients \n\nUser Interface\n\n- Added better chat support for match results and during midtro/outros\n- Added improved Stopwatch mode end-game review screen\n- Added options for VOIP volume in settings menu\n- Fixed navigation issues on menus with password fields\n- Disabled chatting when in solo mode\n- Added support for up to 4 deployable icons\n- Fixed being able to click invisible filter buttons when the filters panel is collapsed \n\nBalance\n\n- Tweaked several weapons (full details here)\n- Added body type health to Netvars for future tweaking\n- Added map spawn timers to Netvars for future tweaking\n\nOptimizations\n\n- Optimized networking to reduce snapshot sizes\n- Optimised light-rendering\n- Minor performance improvement to static AO rendering\n- Added conditional to sun-rendering to speed it up slightly in case of all shadow\n- Fixed sunlight when indoors in Security Tower\n- Added support for dummy files to improve loading times\n\nDedicated Servers\n\n- No longer disconnect server if Steam connection is lost and grace period ends\n- Added listClients server command\n- Disabled missing mesh/sound/image warnings on servers\n- Disabled character compositing on servers to reduce server size \n\n","torrent":{"xt":"urn:btih:008d0edbd7bf9cba5d01d9be83b195c5bf0c102e","amp;dn":"Brink.Update.7-SKIDROW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"008d0edbd7bf9cba5d01d9be83b195c5bf0c102e","infoHashBuffer":{"type":"Buffer","data":[0,141,14,219,215,191,156,186,93,1,217,190,131,177,149,197,191,12,16,46]},"announce":[],"urlList":[]}}