{"title":"Garth Brooks - The Dance","uid":4297194,"size":149030916,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:00a0a257897adbfc78cfcd65009ca0d27f405068&amp;dn=Garth+Brooks+-+The+Dance&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":1,"time":1216129567,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;The Dance&quot; is a 1989 song recorded by country singer Garth Brooks. The song, written by Brooks&amp;#039; friend, Tony Arata, was a key track on his self-titled debut album Garth Brooks and a #1 chart hit.\n\nThe song is written with a double meaning both as a love song about the end of a passionate relationship and the lyrics also work to tell the story of someone dying because of something they believe in, or a moment of glory. Brooks illustrated this in the music video for the song.\n\nThe song&amp;#039;s video shows several American icons and examples of people who died for a dream they had. These include archive footage of the following:\n\nLane Frost - World Champion Bull rider, who was killed by a bull after riding it for a full eight seconds in the arena. \nKeith Whitley - Country singer who died from alcohol poisoning. \nMartin Luther King, Jr. - Baptist minister who is best known for his involvement in the American civil rights movement and was assassinated in 1968. \nThe crew of the Space Shuttle Challenger, shortly before it disintegrated after its launch in 1986. \nJohn Fitzgerald Kennedy - President of the United States who was assassinated in 1963. \nJohn Wayne - Film actor best known for his roles in Westerns. \n\nReleased near the beginning of his career &quot;The Dance&quot; was a big hit single around the world, including the United States, Europe, Ireland, etc. In 1990, it was titled both Song of the Year and Video of the Year by the Academy of Country Music. It was awarded the #14 position in the CMT 100 Greatest Songs of Country Music broadcast and also the #5 position on the network&amp;#039;s The Greatest: 100 Greatest Music Videos special.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:00a0a257897adbfc78cfcd65009ca0d27f405068","amp;dn":"Garth+Brooks+-+The+Dance","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"00a0a257897adbfc78cfcd65009ca0d27f405068","infoHashBuffer":{"type":"Buffer","data":[0,160,162,87,137,122,219,252,120,207,205,101,0,156,160,210,127,64,80,104]},"announce":[],"urlList":[]}}