{"title":"Nanostructure Science and Technology [Updated at 2016.02.25]","uid":13674478,"size":699094250,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0110535819413f892f1bf2fd0b40b4c03df27c0d&amp;dn=Nanostructure+Science+and+Technology+%5BUpdated+at+2016.02.25%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"clouderone","files":52,"time":1456372894,"description":"ISSN 1571-5744\r\nISSN 2197-7976 (electronic)\r\nSeries Editor: David J. Lockwood\r\nPublished by Springer\r\n\r\nThe scope of the series is designed to cover as much of the subject matter as possible – from physics and chemistry to biology and medicine, and from basic science to applications. At present, the most significant subject areas are concentrated in basic science and mainly within physics and chemistry, but as time goes by more importance will inevitably be given to subjects in applied science and will also include biology and medicine. The series will naturally accommodate this flow of developments in the sciences and technology of nanostructures and maintain its topicality by virtue of its broad emphasis. It is important that emerging areas in the biological and medical sciences, for example, not be ignored as, despite their diversity, developments in this field are often interlinked. The series will maintain the required cohesiveness from a judicious mix of edited volumes and monographs that while covering subfields in depth will also contain more general and interdisciplinary texts. Thus the series is planned to cover in a coherent fashion the developments in basic research from the distinct viewpoints of physics, chemistry, biology, and materials science and also the engineering technologies emerging from this research. Each volume will also reflect this flow from science to technology. As time goes by, the earlier series volumes will then serve as reference texts to subsequent volumes","torrent":{"xt":"urn:btih:0110535819413f892f1bf2fd0b40b4c03df27c0d","amp;dn":"Nanostructure+Science+and+Technology+%5BUpdated+at+2016.02.25%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0110535819413f892f1bf2fd0b40b4c03df27c0d","infoHashBuffer":{"type":"Buffer","data":[1,16,83,88,25,65,63,137,47,27,242,253,11,64,180,192,61,242,124,13]},"announce":[],"urlList":[]}}