{"title":"Tales From Under the Concrete","uid":7753959,"size":1037751,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:015589c72d268cde81b8a586f7d26e3c6fd5effa&amp;dn=Tales+From+Under+the+Concrete&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"DST1962","files":1,"time":1351038817,"description":"The &quot;Tales From Under The Concrete&quot; is a novel written by Douglas S. Taylor comprised of adult horror short stories that is currently free to the Internet Community.\n\n&quot;Tales From Under the Concrete&quot; is an eBook in the rich Adobe Acrobat pdf format!\n\nAbout the author;\n\nDouglas S. Taylor always been such a huge fan of creative writing in horror, epic adventure, fantasy, and thrillers of all shapes and sizes. Since a small boy, he began writing short stories in elementary school. These stories were unusually dark and raised questions with his teachers resulting in several interviews with the schoolÎ“Ã‡Ã–s principal. His young writing lead to several edited versions in the local newspaper making him the youngest Î“Ã‡Â£publishedÎ“Ã‡Â¥ author in that school's history.\n \nDouglas is a published writer and novelist that currently have two trade paperback novels sold internationally and made available through online bookstores everywhere.\n \nDouglas says, Î“Ã‡Â£Though I freely admit, I am a rebel at heart and love to buck and challenge the traditional ways of doing things. I guess that I always was since the beginning. As I have said before, there is nothing that will stop me to write, nothing except being on the wrong side of a copper-jacketed hallow point!\n\nDouglas lives with his wife, Laura, and Sophie, their pet cat in Deadwood, South Dakota. Douglas is also the designer and writer of the Douginator Online Magazine.\n","torrent":{"xt":"urn:btih:015589c72d268cde81b8a586f7d26e3c6fd5effa","amp;dn":"Tales+From+Under+the+Concrete","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"015589c72d268cde81b8a586f7d26e3c6fd5effa","infoHashBuffer":{"type":"Buffer","data":[1,85,137,199,45,38,140,222,129,184,165,134,247,210,110,60,111,213,239,250]},"announce":[],"urlList":[]}}