{"title":"Sonochemistry and the Acoustic Bubble - Franz Grieser et al.","uid":15553514,"size":23820715,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:020d9c7e6c819e8bde30d631ced41242ba48e625&amp;dn=Sonochemistry+and+the+Acoustic+Bubble+-+Franz+Grieser+et+al.&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1471044707,"description":"Sonochemistry and the Acoustic Bubble - Franz Grieser et al. (Elsevier, 2015).pdf\r\n\r\nSonochemistry and the Acoustic Bubble provides an introduction to the way ultrasound acts on bubbles in a liquid to cause bubbles to collapse violently, leading to localized 'hot spots' in the liquid with temperatures of 5000° celcius and under pressures of several hundred atmospheres.\r\n\r\nThese extreme conditions produce events such as the emission of light, sonoluminescence, with a lifetime of less than a nanosecond, and free radicals that can initiate a host of varied chemical reactions (sonochemistry) in the liquid, all at room temperature.\r\n\r\nThe physics and chemistry behind the phenomena are simply, but comprehensively presented. In addition, potential industrial and medical applications of acoustic cavitation and its chemical effects are described and reviewed.\r\n\r\nThe book is suitable for graduate students working with ultrasound, and for potential chemists and chemical engineers wanting to understand the basics of how ultrasound acts in a liquid to cause chemical and physical effects.\r\n\r\n\r\n\r\nExperimental methods on acoustic cavitation and sonochemistry\r\nHelps users understand how to readily begin experiments in the field\r\nProvides an understanding of the physics behind the phenomenon\r\nContains examples of (possible) industrial applications in chemical engineering and environmental technologies\r\nPresents the possibilities for adopting the action of acoustic cavitation with respect to industrial applications","torrent":{"xt":"urn:btih:020d9c7e6c819e8bde30d631ced41242ba48e625","amp;dn":"Sonochemistry+and+the+Acoustic+Bubble+-+Franz+Grieser+et+al.","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"020d9c7e6c819e8bde30d631ced41242ba48e625","infoHashBuffer":{"type":"Buffer","data":[2,13,156,126,108,129,158,139,222,48,214,49,206,212,18,66,186,72,230,37]},"announce":[],"urlList":[]}}