{"title":"Practical Analysis and Reconstruction of Shooting Incidents","uid":4861681,"size":7218800,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:02711bda959755fe74062a2b132641994a11b00d&amp;dn=Practical+Analysis+and+Reconstruction+of+Shooting+Incidents&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"x_DontTreadOnMe_x","files":-1,"time":1240300867,"description":"&quot;The ultimate goal of collecting, preserving, and examining physical evidence is individualization - associating each piece with its responsible source. Firearms evidence in particular has the potential to individualize its source. Accessible and comprehensive, Practical Analysis and Reconstruction of Shooting Incidents provides the foundation necessary to develop and sharpen the skills used to investigate shooting incidents. It provides an explanation of what constitutes pertinent evidence and appropriate results pertaining to autopsies, forensic laboratory analysis, and reenactments. The text also reviews basic firearm design, function, ammunition components, and the terminology required for understanding evidence encountered at the scene.\n\nThe book explains the basic mathematics of shooting reconstruction and includes sample problems at the end of each chapter. It presents case studies that feature those involving the John F. Kennedy and Robert F. Kennedy assassinations. It also details proper photographic documentation and effective courtroom techniques used to present the results of shooting reconstructions to juries, with examples of acceptable demonstrative evidence.\n\nArming the investigator with the means to successfully examine and evaluate what transpired at the scene, Practical Analysis and Reconstruction of Shooting Incidents is an important resource to have accessible at all times.\n\nPublisher: CRC\nNumber Of Pages: 352\nPublication Date: 2005-11-29\nISBN-10 / ASIN: 0849323304\nISBN-13 / EAN: 9780849323300\nBinding: Hardcover&quot;\n\n~~~\n\nI am always adding new things, so check this account often.\n\nVisit roguesci (dot) org (slash) theforum, and register, for the world's longest running largest explosives and weapons forum on the web!","torrent":{"xt":"urn:btih:02711bda959755fe74062a2b132641994a11b00d","amp;dn":"Practical+Analysis+and+Reconstruction+of+Shooting+Incidents","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"02711bda959755fe74062a2b132641994a11b00d","infoHashBuffer":{"type":"Buffer","data":[2,113,27,218,149,151,85,254,116,6,42,43,19,38,65,153,74,17,176,13]},"announce":[],"urlList":[]}}