{"title":"Bellydance Fitness for Weight Loss featuring Rania: Daily Quicki","uid":8419816,"size":524271876,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:030b76bf07923ee445182a4c6ba59c4f9c8b347a&amp;dn=Bellydance+Fitness+for+Weight+Loss+featuring+Rania%3A+Daily+Quicki&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sara_melika","files":7,"time":1367157225,"description":"Bellydance Fitness for Weight Loss featuring Rania: Daily Quickies... 5 Ten Minute Workouts \n\nFor just 10 minutes per day, five days per week, you can stretch, strengthen, tone and burn every muscle in your body. Join Rania Bossonis, AFAA Certified Fitness Instructor and world famous Dancer/Teacher, for these effective and innovative 10 min. workouts that can be done in 10 min. per day, or all at once in under one hour. You will notice improved grace and posture. These workouts combine traditional strengthening exercises with Yoga, Ballet/Modern Dance and Bellydance exercises for an interesting, fun and highly effective workout series.\n\nAbs Only:Combines isolation exercises from Bellydance with Ab exercises for every muscle in the Abdominal Region. This workout will strengthen and tone the Abdominals while also teaching control of the muscles, in just 10 minutes. Features Crunches, Oblique exercises, Lower Abdominal work, standing Abdominal Bellydance Isolations, Belly Rolls, and an Abdominal Stretch.\n\nArms, Back and Chest:This workout effectively works opposing muscle groups in the arms, back and chest for strengthening, toning, and fat burning in the upper body in just 10 minutes. Hand weights can be added to this routine to maximize the training benefit. Includes exercises such as Lateral Pull Downs, Upright Rows, Shoulder Presses, Biceps Flexion, Push-ups, and Prone Hyperextensions, combined with Bellydance Isometric exercises such as Chest Raises and Drops, Snake Arms, Shoulder Rolls, and Shoulder Shimmies.\n\nDancer's Legs and Butt:Combines leg exercises used in Modern/Ballet Dance, Traditional Fitness and Bellydance for a great workout that strengthens, burns fat, and sculpts the entire leg and buttock area in just 10 minutes. Includes Plies, Bellydance Pelvic Camels, One-Legged Lunges with leg extensions, inner and outer thigh exercises, and floor exercises for Hamstrings and Gluteus region.\n\nWaist Sculpting: Traditional Abdominal workouts just don't do enough for the waist. This innovative workout combines a series of Bellydance Figure-8 moves, Rib Slides, and Twists, designed to refine, strengthen, sculpt, and burn fat around the troublesome waist area. These isolation exercises are also great for improving coordination and posture, and releasing tension that may be stored in the midsection.\n\nFlexibility Training:This workout features a combination of Bellydance, Yoga, Ballet/Modern Dance moves, exercises and stretches to increase flexibility, release tension, improve posture, coordination and balance in just 10 minutes.\n\nSpecial Features:\n\n- Dolby Digital 5.1 Surround Sound\n- Interactive Full Motion Menus\n- Chapter Selections\n\n","torrent":{"xt":"urn:btih:030b76bf07923ee445182a4c6ba59c4f9c8b347a","amp;dn":"Bellydance+Fitness+for+Weight+Loss+featuring+Rania%3A+Daily+Quicki","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"030b76bf07923ee445182a4c6ba59c4f9c8b347a","infoHashBuffer":{"type":"Buffer","data":[3,11,118,191,7,146,62,228,69,24,42,76,107,165,156,79,156,139,52,122]},"announce":[],"urlList":[]}}