{"title":"Homeroom Diaries by James Patterson &amp; Lisa Papademetriou (re","uid":11005161,"size":89586275,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:03f489d6722b02491c78179685b2ca814b53bbf6&amp;dn=Homeroom+Diaries+by+James+Patterson+%26amp%3B+Lisa+Papademetriou+%28re&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"gratefuldawg77","files":6,"time":1410213963,"description":"James Patterson introduces the best selling &quot;illustrated fiction&quot; format to teens! It's &quot;Middle School&quot; for high schoolers!\n\nIn James Patterson's first highly illustrated &quot;diary fiction&quot; story for teens, the mega-bestselling author's most endearing and original teen heroine ever proves that everyone can use a helping hand once in a while.\n\nMargaret &quot;Cuckoo&quot; Clarke recently had a brief stay in a mental institution following an emotional breakdown, but she's turning over a new leaf with her &quot;Operation Happiness&quot;. She's determined to beat down the bad vibes of the Haters, the Terror Teachers, and all of the trials and tribulations of high school by writing and drawing in her diary. And when life gets really tough, she works through her own moments of uncertainty through imaginary conversations with her favorite literary characters.\n\nCuckoo's also got a nearly impossible mission: she, along with her misfit band of self-deprecating friends (who call themselves &quot;the Freakshow&quot;) decide to bridge the gap between warring cliques and &quot;bring the Nations together&quot;. Not everyone is so willing to join hands and get along, but Cuckoo never stops smiling... until one of her closest friends, pushed to desperation by a Hater prank, decides that enough is enough.","torrent":{"xt":"urn:btih:03f489d6722b02491c78179685b2ca814b53bbf6","amp;dn":"Homeroom+Diaries+by+James+Patterson+%26amp%3B+Lisa+Papademetriou+%28re","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"03f489d6722b02491c78179685b2ca814b53bbf6","infoHashBuffer":{"type":"Buffer","data":[3,244,137,214,114,43,2,73,28,120,23,150,133,178,202,129,75,83,187,246]},"announce":[],"urlList":[]}}