{"title":"Red Menace","uid":4774379,"size":98465215,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:04c5197d20773e6e24d283cd44c5b24a51d6557a&amp;dn=Red+Menace&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"gilgamesh07","files":14,"time":1237156679,"description":"Ladies and Gentlemen, by request from the forums, this torrent contains Wildstorm Comic's Red Menace limited series in it's entirety.\n\nRed Menace is a six issue American comic book limited series published in 2007 by Wildstorm Productions. It is written by Danny Bilson and Paul DeMeo (who were responsible for the Flash television series in the early 1990s)w/ Adam Brody with art by Jerry Ordway.\n\nThe setting of this story is Los Angeles in 1953 at the time of Joseph McCarthy and the House Un-American Activities Committee trials.\n\nAt one of House Un-American Activities Committee trials a hero named The Eagle unmasks himself as Steve Tremaine. Later, at the trials the Committee use his war time friend named Ivan Petrovich &quot;The Bear&quot;, a hero to the Soviet Union, to whom he sent a Christmas card and had drinks with in May of 1951 behind the Iron Curtain. With all that the House Un-American Activities Committee bans him from being the Eagle. By the next day every newspaper calls him the Red Menace. Even his daughter thinks it is true, after seeing old Nazis working for the FBI. Later, a young man named Tommy Woods, a big fan of the Eagle, becomes a superhero with telekinetic powers called the &quot;Grey Falcon&quot;.\n\n\nThanks to the scanners and the original sources who shall remain nameless.\n\nPlease seed. Please enjoy. ","torrent":{"xt":"urn:btih:04c5197d20773e6e24d283cd44c5b24a51d6557a","amp;dn":"Red+Menace","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"04c5197d20773e6e24d283cd44c5b24a51d6557a","infoHashBuffer":{"type":"Buffer","data":[4,197,25,125,32,119,62,110,36,210,131,205,68,197,178,74,81,214,85,122]},"announce":[],"urlList":[]}}