{"title":"Freddie King - Burglar (1974)","uid":9146347,"size":220241850,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:04d6d8d35df11cd4d7dfc956b1cac59c51e8fe7e&amp;dn=Freddie+King+-+Burglar+%281974%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"garypipok","files":-1,"time":1383603119,"description":"Review by Joe Viglione &lt;a href=&quot;\nhttp://www.allmusic.com/album/burglar-mw0000651697&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.allmusic.com/album/burglar-mw0000651697&lt;/a&gt;\n\nProduced in part by Mike Vernon, who worked on The Legendary Christine Perfect Album, this is an entertaining and concise package of ten songs performed by the late Freddie King and a slew of guests. Opening with Gonzalez Chandler's &quot;Pack It Up,&quot; featuring the Gonzalez Horn Section, the youthful legend was only 40 years of age when he cut this career LP two years before his death. Though no songs went up the charts like his Top Five hit in 1961, &quot;Hide Away,&quot; Burglar is one of those gems that journeymen can put together in their sleep. Tom Dowd produced &quot;Sugar Sweet&quot; at Criteria Studios in Miami, FL, featuring Jamie Oldaker on drums, Carl Radle on bass, and guitarists Eric Clapton and George Terry, which, of course, makes this album highly collectable in the Clapton circles. The sound doesn't deviate much from the rest of the disc's Mike Vernon production work; it is pure Freddy King, like on the final track, E. King's &quot;Come On (Let the Good Times Roll),&quot; where his guitar bursts through the horns and party atmosphere, creating a fusion of the pure blues found on &quot;Sugar Sweet&quot; and the rock that fans of Grand Funk grooved to when he opened for that group and was immortalized in their 1973 number one hit &quot;We're an American Band&quot; a year after this record's release. Sylistically, Freddie King is from the same school as Buddy Guy, two men instrumental in bringing this art form to a mass audience. King stretches those sounds with great fervor on the Hayes/Porter number &quot;I Had a Dream,&quot; containing the strength Mark Farner said the blues artist displayed in concert, which could snap a guitar neck. The voice of Freddie King is what drives J.J. Cale's &quot;I Got the Same Old Blues,&quot; the horns and the guitar battling between verses and uniting to ooze under the guitarist's vocal expression. Rhythm guitarist Bob Tench, producer Mike Vernon, bassist DeLisle Harper, drummer Steve Ferrone, and pianist Roy Davies all co-write &quot;Texas Flyer&quot; with Freddie King, a prime example of the modern blues this artist was developing. With Brian Auger and Pete Wingfield contributing to the title track, Jerry Ragovoy's &quot;She's a Burglar,&quot; this project stands as a solid representation of an important musician which is as enjoyable as it is historic.\n\nTracks :\n1. Pack It Up (4:10)\n2. My Credit Didn't Go Through (4:08)\n3. I Got the Same Old Blues (3:22)\n4. Only Getting Second Best (3:48\n5. Texas Flyer (3:45)\n6. Pulp Wood (3:11)\n7. She's a Burglar (3:49)\n8. Sugar Sweet (2:51)\n9. I Had a Dream (5:01)\n10. Let the Good Times Roll (3:33)\n\nRipped from CD.","torrent":{"xt":"urn:btih:04d6d8d35df11cd4d7dfc956b1cac59c51e8fe7e","amp;dn":"Freddie+King+-+Burglar+%281974%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"04d6d8d35df11cd4d7dfc956b1cac59c51e8fe7e","infoHashBuffer":{"type":"Buffer","data":[4,214,216,211,93,241,28,212,215,223,201,86,177,202,197,156,81,232,254,126]},"announce":[],"urlList":[]}}