{"title":"Dan Graham - Rock My Religion (1984)","uid":3890922,"size":470392832,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:055768b489805d27b264786a2dc4b195baae26a3&amp;dn=Dan+Graham+-+Rock+My+Religion+%281984%29+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"arttorrents","files":1,"time":1195037155,"description":"Dan Graham&amp;#039;s thinking and work have strongly influenced video artists since the mid-1960s. Inspired by the various social, philosophical and aesthetic topics of the time, he has never stopped questioning the structure and system of art, creation and its supposed autonomy, representation and perception. Through his activities as a gallery manager, his work on texts and on the environment, his performances, his video works, his critical articles and his analysis of rock music, he constantly examines language and the perceptive system brought into play.\n\nIn Rock my Religion, he creates a parallel language between the religious family and the &quot;non-oedipal&quot; family of rock, between society and the star system, thus highlighting our modern structures of alienation. He shows the ideology of the star as a &quot;messianic savior&quot;, as an almost religious concept. With his image taken over by the media, the rock star serves to obscure the truth regarding his origin and function as a pure consumer product. Attentive to Pop Art, Dan Graham is interested in the dualities between popular expression and artistic creation and in everything which enables spectators to call into question their position regarding the formal and political foundations of this relationship. Combining sociology, anthropology, psychoanalysis, philosophy and politics (between Marx and Foucault), he observes the fundamental changes in beliefs and superstitions since the end of the 18th century, starting with the basic tenets of the Shaker religion, created in England by a working-class woman called Anne Lee, which believed in strict equality of the sexes before God.\nThe world of work, the condition of women, the emergence of rock music, violence and sexuality are the raw material for this critical examination. Using the faces of Jim Morrison, Bob Dylan, Patti Smith, etc., between the church and Woodstock, a portrait in memory of America is built up from fragments. Images of architecture, omnipresent in Dan Graham&amp;#039;s work, help to set up this landscape, in a sort of mirror effect, and structure this complex discussion of the links between audience, spectacle, belief and politics.","torrent":{"xt":"urn:btih:055768b489805d27b264786a2dc4b195baae26a3","amp;dn":"Dan+Graham+-+Rock+My+Religion+%281984%29+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"055768b489805d27b264786a2dc4b195baae26a3","infoHashBuffer":{"type":"Buffer","data":[5,87,104,180,137,128,93,39,178,100,120,106,45,196,177,149,186,174,38,163]},"announce":[],"urlList":[]}}