{"title":"Drug-like Properties - Concepts, Structure Design and Methods","uid":14971627,"size":6865462,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:05d5e6dbfb2bd314db7166f8124e6373138860ec&amp;dn=Drug-like+Properties+-+Concepts%2C+Structure+Design+and+Methods&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1466207592,"description":"Drug-like Properties - Concepts, Structure Design and Methods - Edward H. Kerns and Li Di (AP, 2008).pdf\r\n\r\nISBN 978-0-12-369520-8\r\n\r\nOf the thousands of novel compounds that a drug discovery project team invents and that bind to the therapeutic target, typically only a fraction of these have sufficient ADME/Tox properties to become a drug product. Understanding ADME/Tox is critical for all drug researchers, owing to its increasing importance in advancing high quality candidates to clinical studies and the processes of drug discovery. If the properties are weak, the candidate will have a high risk of failure or be less desirable as a drug product. This book is a tool and resource for scientists engaged in, or preparing for, the selection and optimization process. The authors describe how properties affect in vivo pharmacological activity and impact in vitro assays. Individual drug-like properties are discussed from a practical point of view, such as solubility, permeability and metabolic stability, with regard to fundamental understanding, applications of property data in drug discovery and examples of structural modifications that have achieved improved property performance. The authors also review various methods for the screening (high throughput), diagnosis (medium throughput) and in-depth (low throughput) analysis of drug properties. * Serves as an essential working handbook aimed at scientists and students in medicinal chemistry * Provides practical, step-by-step guidance on property fundamentals, effects, structure-property relationships, and structure modification strategies * Discusses improvements in pharmacokinetics from a practical chemist's standpoint","torrent":{"xt":"urn:btih:05d5e6dbfb2bd314db7166f8124e6373138860ec","amp;dn":"Drug-like+Properties+-+Concepts%2C+Structure+Design+and+Methods","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"05d5e6dbfb2bd314db7166f8124e6373138860ec","infoHashBuffer":{"type":"Buffer","data":[5,213,230,219,251,43,211,20,219,113,102,248,18,78,99,115,19,136,96,236]},"announce":[],"urlList":[]}}