{"title":"The Anthony Cumia Show 2015-03-04 MP4 MP3 combo","uid":11736297,"size":334549730,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:062a4d21a7fd5204bbd0179771bad4ee80ddfdb6&amp;dn=The+Anthony+Cumia+Show+2015-03-04+MP4+MP3+combo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mothergoose58","files":2,"time":1425580678,"description":"*** CAUTION: 100% UNCENSORED CONTENT!!! ***\n\n-NOT FOR VIEWING BY CHILDREN OR THE FAINT OF HEART-\n\nFresh off his &quot;separation&quot; from SiriusXM, Anthony Cumia, formerly of The Opie and Anthony Show launches his live, uncensored HD video webcast at AnthonyCumia.com Monday-Thursday 4pm-6pm EST. Current events, politics, news and anything can and will be discussed with celebrity guests and comedians stopping by as well. This show is not for those who are inclined to be &quot;politically correct&quot; and will contain boundary-pushing language and topics. Proceed with caution...\n\nGuest(s): Alex Jones\n\nEpisode 121: Wildlife loving Anthony starts today's show telling us what Attorney General Holder said regarding the police in Ferguson, goes through a few offensive emails sent by their police department, and Ant gives his views on the subject. We listen to hypocritical (and hater of cancer kids) Keith Olbermann's &quot;apology&quot;, see a clip of Gov. Huckabee' band, talk about Elisabeth Hasselbeck hating on SNL's &quot;ISIS commercial, and look at a news story on &quot;wedding crashers&quot;. Alex Jones (@RealAlexJones) joins TACS via Skype to discuss net neutrality, the FCC and their excessive use of lube before raping, technology spying on us, people giving up their right to privacy too easy, the system counting on us screwing each other over, narcissism trumping common sense, Jesse Ventura, Chris Kyle, and Hilary Clinton's e-mails. Ant then talks about conspiracies becoming reality, plays the trailer for Adam Sandler's new movie, we get sensual with a video for a camera equipped vibrator, get completely grossed out by a shitty video, find out that Daniel von Bargen has died and listen to a 911 call he made in 2012, check out Victoria Secret models without makeup, and wrap up by watching a bit of a mockumentary on amusement park rides.\n\nIncludes an MP4 video file and an MP3 audio file; download both or only what you need and please seed!\n\n\n\nNew ups at: http://thepiratebay.se/user/mothergoose58/\n\nSubscribe at AnthonyCumia.com!!!","torrent":{"xt":"urn:btih:062a4d21a7fd5204bbd0179771bad4ee80ddfdb6","amp;dn":"The+Anthony+Cumia+Show+2015-03-04+MP4+MP3+combo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"062a4d21a7fd5204bbd0179771bad4ee80ddfdb6","infoHashBuffer":{"type":"Buffer","data":[6,42,77,33,167,253,82,4,187,208,23,151,113,186,212,238,128,221,253,182]},"announce":[],"urlList":[]}}