{"title":"Knowing Me, Knowing You  - S01 - Audio Comedy - MP3 - Slimoo","uid":5722093,"size":198172634,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:07580526fe1a18b12aab50ec98d2b939561b1612&amp;dn=Knowing+Me%2C+Knowing+You++-+S01+-+Audio+Comedy+-+MP3+-+Slimoo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"_Slimoo_","files":7,"time":1280276094,"description":"Knowing Me, Knowing You - Series 01 - Audio Comedy - BBC 7  \n7 x 30 minute episodes - 128Kbps - Mp3 - Slimoo\n\n\nKnowing Me, Knowing You... with Alan Partridge is a British comedy show first broadcast on BBC Radio 4 as a six-episode series, which subsequently transferred to BBC Television with a series of six episodes It is named after the song Knowing Me, Knowing You by ABBA (Alan Partridge's favourite band), which was used as the show's title music.\n\nThe show was a parody of a chat show, and were so embarrassingly accurate that listeners and viewers often thought they were the real thing. Many wrote in to complain, for example, at Partridge slapping a child prodigy in an episode of the radio series. The series did feature an audience who clearly knew the show was a parody, but apparently this wasn't enough to persuade some listeners that it wasn't real.\n\nSteve Coogan played the incompetent and annoying but self-satisfied Norwich-based host, Alan Partridge. Alan was a spin-off character from the spoof radio show On The Hour (which later transferred to TV as The Day Today).\n\nKnowing Me, Knowing You was written by Coogan, Armando Iannucci (who produced the radio version) and Patrick Marber (who also starred), with contributions from the regular supporting cast of Doon Mackichan, Rebecca Front and David Schneider, who made up Alan's weekly onslaught of annoying and inane guests. Steve Brown also appeared as the man in charge of the house band, Glen Ponder.\n\nSome of the more notable guests parodied real life appearances by guests on chat shows. For example, the medical fashion parade by Mrs Whippy Head is clearly a reference to Vivienne Westwood's infamous appearance on Wogan, and the child prodigy Simon Fisher's appearance in the radio series was seemingly inspired by James (now Lauren) Harries's appearance on the same show\n\n\n\nKnowing Me, Knowing You - S01 - E01\nKnowing Me, Knowing You - S01 - E02\nKnowing Me, Knowing You - S01 - E03\nKnowing Me, Knowing You - S01 - E04\nKnowing Me, Knowing You - S01 - E05\nKnowing Me, Knowing You - S01 - E06\nKnowing Knowing Me, Knowing You (Special Documentry)\n\n\n\n\nAudio Format    : MP3\nDuration Approx : 28mn 54s\nBit rate mode   : Constant\nBit rate        : 128 Kbps\nChannel(s)      : 2 channels\nSampling rate   : 44.1 KHz\nResolution      : 16 bits\n\n\n[","torrent":{"xt":"urn:btih:07580526fe1a18b12aab50ec98d2b939561b1612","amp;dn":"Knowing+Me%2C+Knowing+You++-+S01+-+Audio+Comedy+-+MP3+-+Slimoo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"07580526fe1a18b12aab50ec98d2b939561b1612","infoHashBuffer":{"type":"Buffer","data":[7,88,5,38,254,26,24,177,42,171,80,236,152,210,185,57,86,27,22,18]},"announce":[],"urlList":[]}}