{"title":"Herman Cain 7-Jul not CF","uid":4990961,"size":72163607,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:076c5d223916cf9fd0ffd2b20e265751ce4bff29&amp;dn=Herman+Cain+7-Jul+not+CF&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"nuktriggerpuller","files":2,"time":1247039045,"description":"Herman Cain (born December 13, 1945) is an American conservative newspaper columnist, businessman, politician and radio talk-show host from Georgia. He is best known as the former chairman and CEO of Godfather's Pizza. Cain's newspaper column is distributed by North Star Writers Group. He currently lives in the Eagle's Landing Country Club community located in the Atlanta suburbs.\n\nCain was raised in Georgia and earned a bachelor's degree in Mathematics at Morehouse College in 1967 and a master's degree in computer science from Purdue University. Cain worked as a mathematician for the Department of the Navy, a business analyst for the Coca-Cola Company, and for the Pillsbury Company, where he became Vice-President of Corporate Systems and Services within three years. Cain hoped to reach a corporate presidency, and to pursue this goal he decided to resign his senior position and move into the restaurant industry. Cain entered Pillsbury's Burger King division, where he worked his way up from making hamburgers to managing 400 restaurants in the Philadelphia region. Under Cain's leadership, the region went from being the chain's worst-performing in the country to its best. In 1986, Cain was appointed head of Pillsbury's struggling Godfather's Pizza chain, which he restored to profitability in 14 months, and organized a buyout of the the company from Pillsbury in 1988. Cain went on to serve on the board of the National Restaurant Association, chairing the board from 1994 to 1995 and becoming President and CEO in 1996. In 1999 Cain became President of RetailDNA.[1]\n\nIn 2004, Cain ran for the U.S. Senate in Georgia, pursuing the seat which came open with the retirement of conservative Democrat Zell Miller. Because of Georgia's Republican tilt, Republicans were heavily favored to take the seat. Cain sought the Republican nomination, facing Congressmen Johnny Isakson and Mac Collins in the primary. Isakson, the most moderate of the three candidates, was perceived as the frontrunner in the race due to an early start in the race and his prolific fundraising. Cain and Collins both hoped to deny Isakson a majority on primary day in order to force him into a runoff. Collins tried to paint Cain as a moderate, citing Cain's support for affirmative action programs, while Cain, argued that he was a true conservative, noting that he opposed the legality of abortion even in cases of rape and incest.[2]. Cain finished second in the primary with 26.2% of the vote, ahead of Collins who won 20.6%, but because Isaksonwas able to win 53.2% of the vote, Isakson was able to avoid a runoff against Cain.[3] Had Cain been elected to the Senate in 2004, he would have joined Barack Obama as the only African-American members of the Senate at the time, and would have been the first African-American Republican to serve in the Senate since Massachussetts Senator Edward Brooke.\n\nAs of May 2009, Cain hosts &quot;The Herman Cain Show&quot; on Atlanta talk radio station News Talk 750 WSB from 7-10PM EST Monday through Friday and serves as a commentator for Fox News Business and a syndicated columnist distributed by the North Star Writers Group. In 2009, Cain founded &quot;Hermantor's Intelligent Thinkers Movement&quot; (HITM), a non-partisan movement aimed at organizing 100,000 activists in every congressional district in the United States in support of a strong national defense, the FairTax, tax cuts, energy independence, capping and cutting government spending, restructuring Social Security, and defending the U.S. Constitution.[4]","torrent":{"xt":"urn:btih:076c5d223916cf9fd0ffd2b20e265751ce4bff29","amp;dn":"Herman+Cain+7-Jul+not+CF","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"076c5d223916cf9fd0ffd2b20e265751ce4bff29","infoHashBuffer":{"type":"Buffer","data":[7,108,93,34,57,22,207,159,208,255,210,178,14,38,87,81,206,75,255,41]},"announce":[],"urlList":[]}}