{"title":"N.T. Wright - John for Everyone (pdf)","uid":8213743,"size":4221945,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0798cae5282c7d36849a282e4acff0c03abae868&amp;dn=N.T.+Wright+-+John+for+Everyone+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pharmakate","files":-1,"time":1362297038,"description":"N. T. Wright - John for Everyone, Part One: Chapters 1-10 (Westminster John Knox Press, 2002). 180 pages.\n\nN. T. Wright - John for Everyone, Part Two: Chapters 11-21 (Westminster John Knox Press, 2002). 188 pages.\n\n(Both volumes included in this torrent.)\n\nNew scans. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\nShort description:\n\nBrief commentary on John's Gospel by the brilliant New Testament scholar.\n\n**See my other torrents for other volumes in the series; all volumes will be posted here in the near future**\n\nDescription:\n\nMaking use of his scholar's understanding, yet writing in an approachable and anecdotal style, Tom Wright manages to unravel the great complexity of the extraordinary Gospel of John. He describes it as &quot;one of the great books in the literature of the world; and part of its greatness is the way it reveals its secrets not just to a high-flown leaning but to those who come to it with humility and hope.&quot; Wright's stimulating comments are combined with his own fresh and inviting translation of the Bible text.Tom Wright has undertaken a tremendous task: to provide guides to all the books of the New Testament, and to include in them his own translation of the entire text. Each short passage is followed by a highly readable discussion with background information, useful explanations and suggestions, and thoughts as to how the text can be relevant to our lives today. A glossary is included at the back of the book. The series is suitable for group study, personal study, or daily devotions.\n\nReview\n\nIn this series [Wright] excels as a communicator, making this the most exciting study guide since Barclay's Daily Study Bible.-- Expository Times\nIf you wish to meet the Jesus who broke into people's lives while on earth, I heartily recommend these guides. -- The Christian Herald\n--Expository Times\n\nReview\n\n&quot;[The For Everyone series] is probably the most exciting thing to have happened in Christian education in Britain for many years.&quot; Expository Times\n","torrent":{"xt":"urn:btih:0798cae5282c7d36849a282e4acff0c03abae868","amp;dn":"N.T.+Wright+-+John+for+Everyone+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0798cae5282c7d36849a282e4acff0c03abae868","infoHashBuffer":{"type":"Buffer","data":[7,152,202,229,40,44,125,54,132,154,40,46,74,207,240,192,58,186,232,104]},"announce":[],"urlList":[]}}