{"title":"Alan Bennett - Talking Heads 1 &amp; 2 (BBC Production)","uid":5079530,"size":557218979,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:08889085b97a2bcce4dc35f59b03750811d09bca&amp;dn=Alan+Bennett+-+Talking+Heads+1+%26+2+%28BBC+Production%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sheila6","files":1,"time":1252166357,"description":"Alan Bennett's award-winning series of six television monologues, Talking Heads, may have been first aired in 1988, but over two decades later it is still impossible to hear these deeply moving and affectionate scripts without hearing the voices of the actors who played them. \n\nMaggie Smith as the alcoholic vicar's wife finding a semblance of happiness in an affair with an Indian shop owner, Patricia Routledge as the poisonous neighbour, Julie Walters as the over-the-hill dolly bird auditioning for a porn film and of course Thora Hird as Doris, the old lady alone in her home having fallen and broken her hip. \n\nAll great performances and all made possible by Bennett's wonderfully observant and poignant scripts. Bennett rightly notes in his introduction to the pieces that, maybe apart from Doris, his narrators are artless in that they &quot;don't quite know what they are saying and are telling a story to the meaning of which they are not entirely privy&quot;. But through their artlessnes they reveal more about Britain today and the stresses and strains placed upon ordinary people, than any number of docu-soaps that now claim to show us real life. \n\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:08889085b97a2bcce4dc35f59b03750811d09bca","amp;dn":"Alan+Bennett+-+Talking+Heads+1+%26+2+%28BBC+Production%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"08889085b97a2bcce4dc35f59b03750811d09bca","infoHashBuffer":{"type":"Buffer","data":[8,136,144,133,185,122,43,204,228,220,53,245,155,3,117,8,17,208,155,202]},"announce":[],"urlList":[]}}