{"title":"Francesco d'Assisi -Michele Soavi - Raoul Bova- Subtitles ESP","uid":6359528,"size":1468737627,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:089c112128cc95fce1e99d65f07c44d67b632694&amp;dn=Francesco+d%5C%27Assisi+-Michele+Soavi+-+Raoul+Bova-+Subtitles+ESP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mauro14","files":-1,"time":1304281099,"description":"Francesco (miniserie televisiva) - 2002\n\nBiography of Saint Francis Of Assis, Italy - in a great movie of the director Michele Soavi.\n\n\nSpoken Language: Italian\nSubtitled: Spanish\n\nSaint Francis of Assisi (born Giovanni Francesco di Bernardone) 1181/1182 October 3, 1226)was an Italian Catholic friar and preacher. He founded the Franciscan Order, assisted in founding the woman's Order of St. Clare, and the lay Third Order of Saint Francis.\n\nSt. Francis is one of the most venerated religious figures in history.\n\n\nFrancesco (miniserie televisiva)\n\n\nRaoul Bova nel ruolo di Francesco d'Assisi\nPaese:\tItalia\nAnno:\t2002\nFormato:\tminiserie TV\nGenere:\tbiografico\nPuntate:\t2\nDurata:\t182 min (versione integrale)\n\n\nLingua originale:\titaliano\nCaratteristiche tecniche\nAspect ratio:\t4:3 - 1:78.1\nColore:\tcolore\nAudio: Crediti\nRegia:\tMichele Soavi\nSoggetto:\tLeonardo Fasoli, Pietro Valsecchi\nSceneggiatura:\tLeonardo Fasoli, Salvatore De Mola, Giacomo Scarpelli, Michele Soavi\nInterpreti e personaggi\nRaoul Bova: Francesco\nGianmarco Tognazzi: Bernardo\nAmÃƒÂ©lie Daure: Chiara\nClaudio GioÃƒÂ¨: Pietro\nPaolo Briguglia: Silvestro\nMariano Rigillo: Pietro di Bernardone\nErika Blanc: Monna Pica\nSergio Romano:\nGabriele Bocciarelli:\nLorenzo De Angelis: Valdo\nFausto Paravidino:\nNino D\\'Agata:\nTony Bertorelli: Papa Innocenzo III\nDavid Brandon:\nSergio Graziani:\nFrancesco Musca: Francesco da bambino\nVirginia Valsecchi: Chiara da bambina\nFilippo Valsecchi: Bernardo da bambino\nFederico Mattia Papi: Pietro da bambino\nMirko Casaburo: Silvestro da bambino\nGiovanni Anzelotti: contadino\nGiovanni Battaglia: Antonio\nVeronica Bruni: ragazza madre\nRino Cassano: eretico\nValentina Croce: prima dama\nNino Fuscagni: sacerdote\nViola Graziosi: Pacifica\nMaurizio Gueli: nobiluomo\nDiego Guerra: Simone\nLuca Lionello: giovane tessitore\nPaolo Lombardi: Teobaldo Del Drappo\nIvan Lucarelli: Ulrico\nMauro Marino: Vescovo\nAdriano Modica: Frate Domenico\nAngelo Maggi Mariotti: Cardinale\nAnna Teresa Rossini: Madre superiora\nPaolo Zuccari: inquisitore\nFotografia:\tGianni Mammolotti\nMontaggio:\tAnna Napoli\nMusiche:\tCarlo Siliotto\nScenografia:\tMarco Dentici\nCostumi:\tSergio Ballo\nEffetti speciali:\tDanilo Bollettini\nProduttore:\tPietro Valsecchi\nProduttore esecutivo:\tNovafilm\nCasa di produzione:\tTaodue Film, MediaTrade\nPrima visione\nPrima TV Italia\nDal:\t6 ottobre 2002\nAl:\t7 ottobre 2002\nRete televisiva:\tCanale 5\n\n\nDescrizione\n\nProdotta nel 2002 dalla Taodue Film di Pietro Valsecchi per MediaTrade, la miniserie ÃƒÂ¨ composta originariamente da 2 puntate, per una durata complessiva di 182 minuti. Nel 2004 ÃƒÂ¨ stata proposta una versione DVD che presenta la carenza di alcune scene, per una durata totale di 126 minuti circa. Il 5 ottobre 2002, giorno precedente alla messa in onda in prima visione TV su Canale 5 in prima serata, la fiction venne proiettata in anteprima alla sala dell\\'Auditorium di Roma: furono presenti anche Carlo Azeglio Ciampi, allora presidente della Repubblica, sua moglie Franca Pilla, Pier Ferdinando Casini, allora presidente della Camera, Piersilvio Berlusconi, allora vice-presidente di Mediaset.\n\nGirata tra CinecittÃƒÂ  e l\\'Umbria, la fiction ebbe un costo di produzione di circa 6 milioni di euro. La regia ÃƒÂ¨ di Michele Soavi. L\\'attore protagonista ÃƒÂ¨ Raoul Bova, che per essere piÃƒÂ¹ credibile nel ruolo di Francesco d\\'Assisi dimagrÃƒÂ¬ di ben 17 chilogrammi. Tra gli interpreti principali anche Gian Marco Tognazzi nel ruolo di Bernardo e Amelie Daure nel ruolo di Chiara[3]. Vi ÃƒÂ¨ anche la partecipazione di Nino Fuscagni che, accreditato come Serafino Fuscagni, interpreta un sacerdote cattolico.\nIl regista dichiarÃƒÂ² che la figura moderna di San Francesco puÃƒÂ² essere paragonata ai punkabbestia. L\\'opera venne giudicata positivamente dai frati di Assisi, che la definirono \\&quot;uno strumento di grande catechesi\\&quot; e \\&quot;il piÃƒÂ¹ riuscito film su San Francesco\\&quot;.\n\nTrama\n\nFrancesco nasce ad Assisi nel 1182 da Bernardone, ricco mercante devoto piÃƒÂ¹ al denaro che a Dio, e da Pica, una donna invece molto religiosa. Il piccolo frequenta la scuola elementare ma non ÃƒÂ¨ molto portato per gli studi, e cosÃƒÂ¬ il padre lo prende a lavorare con sÃƒÂ©. Crescendo, Francesco si diverte stando in compagnia degli amici, in assoluta spensieratezza.\nNel 1201 scoppia la guerra tra Perugia e Assisi: Francesco combatte con grande valore per la sua cittÃƒÂ , ma viene fatto prigioniero dai nemici. Nel 1203 viene liberato e torna nella sua casa, ma viene colpito dalla tubercolosi: durante la guarigione inizia la sua conversione. Il giovane inizia a seguire alla lettera il Vangelo, vivendo in povertÃƒÂ  e aiutando i poveri. Un giorno ruba tutti i danari e i tappeti di suo padre e li regala ai barboni e ai lebbrosi: l\\'ira di Bernardone ÃƒÂ¨ implacabile. Francesco viene arrestato e condotto dinnanzi al Vescovo di Assisi; la folla si raduna per assistere al processo. Francesco restituisce i vestiti a suo padre e rimane completamente nudo: dichiara a tutti i presenti che il suo unico scopo nella vita sarÃƒÂ  quello di servire Dio. Il giovane inizia quindi a vivere da eremita, senza piÃƒÂ¹ contare sui beni materiali, ma solo sulla fede. I suoi amici d\\'infanzia lo seguono e decidono di adottare il suo stesso stile di vita; tra loro c\\'ÃƒÂ¨ anche Chiara. I seguaci di Francesco diventano sempre piÃƒÂ¹ numerosi, e per allontanare il rischio di essere giudicato un eretico, nel 1212 il giovane e i suoi discepoli si recano a Roma per ottenere l\\'approvazione di Papa Innocenzo III per la sua Regola. Il pontefice, dopo qualche esitazione, gli permette di fondare l\\'Ordine dei Fratelli Minori. Una volta concluso il suo lavoro affidatogli dal Signore e segnato da numerosissime malattie e dal dolore per le stimmate ricevute, Francesco muore il 4 ottobre del 1226. I fratelli, quindi, porteranno la salma davanti al Convento dov\\'ÃƒÂ¨ chiusa Chiara per permetterle di vedere per l\\'ultima volta Francesco.\t","torrent":{"xt":"urn:btih:089c112128cc95fce1e99d65f07c44d67b632694","amp;dn":"Francesco+d%5C%27Assisi+-Michele+Soavi+-+Raoul+Bova-+Subtitles+ESP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"089c112128cc95fce1e99d65f07c44d67b632694","infoHashBuffer":{"type":"Buffer","data":[8,156,17,33,40,204,149,252,225,233,157,101,240,124,68,214,123,99,38,148]},"announce":[],"urlList":[]}}