{"title":"The Palace of Illusions by Chitra Banerjee Divakaruni (retail EP","uid":10806763,"size":8070033,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0a5e80decc8b0b4077b67c3a9d7ab120c70e57c8&amp;dn=The+Palace+of+Illusions+by+Chitra+Banerjee+Divakaruni+%28retail+EP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"gratefuldawg77","files":6,"time":1408388739,"description":"Although Chitra Divakaruni's poetry has won praise and awards for many years, it is her &quot;luminous, exquisitely crafted prose&quot; (Ms.) that is quickly making her one of the brightest rising stars in the changing face of American literature. Arranged Marriage, her first collection of stories, spent five weeks on the San Francisco Chronicle bestseller list and garnered critical acclaim that would have been extraordinary for even a more established author.For the young girls and women brought to life in these stories, the possibility of change, of starting anew, is both as terrifying and filled with promise as the ocean that separates them from their homes in India. From the story of a young bride whose fairy-tale vision of California is shattered when her husband is murdered and she must face the future on her own, to a proud middle-aged divorced woman determined to succeed in San Francisco, Divakaruni's award-winning poetry fuses here with prose for the first time to create eleven devastating portraits of women on the verge of an unforgettable transformation.","torrent":{"xt":"urn:btih:0a5e80decc8b0b4077b67c3a9d7ab120c70e57c8","amp;dn":"The+Palace+of+Illusions+by+Chitra+Banerjee+Divakaruni+%28retail+EP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0a5e80decc8b0b4077b67c3a9d7ab120c70e57c8","infoHashBuffer":{"type":"Buffer","data":[10,94,128,222,204,139,11,64,119,182,124,58,157,122,177,32,199,14,87,200]},"announce":[],"urlList":[]}}