{"title":"Good Times, Wonderful Times (1966) 720p.BluRay. x264-HD4U","uid":7537903,"size":3519382206,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:0bc64bf6b1da9ffcb812b4ea081d003a272cdb4d&amp;dn=Good+Times%2C+Wonderful+Times+%281966%29+720p.BluRay.+x264-HD4U&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"mrspatula","files":2,"time":1345140966,"description":"Good Times, Wonderful Times is a 1965 anti-war film, the third feature-length film written, produced, and directed by independent American filmmaker Lionel Rogosin. It was produced in London, and made with the support of James &quot;Jimmy&quot; Vaughan and Tadeusz Makarczynski, who assisted in an extensive multi-year search for archival footage detailing the atrocities of war.\n\nInspired by a deep sense of the danger of nuclear annihilation and the horrors of war, Rogosin traveled the world to gather rare undiscovered footage in the early 1960s. Brilliantly contrasting these images in all their brute horror with a posh dinner party in London, it is a powerful orchestration of moral issues that leaves each viewer face to face with his own responsibilities. Inspired by Hiroshima Mon Amour, it pushes the use of historical images to the extreme, creating a chain reaction resulting in an emotional explosion of horror, awareness and hope.\n\nFinishing the film in 1964 just as the Vietnam War was in full swing, Rogosin distributed it through his company Impact Films to an estimated one million students on U.S. campuses, making him proud to claim that he helped convince thousands of young men to resist the war.","torrent":{"xt":"urn:btih:0bc64bf6b1da9ffcb812b4ea081d003a272cdb4d","amp;dn":"Good+Times%2C+Wonderful+Times+%281966%29+720p.BluRay.+x264-HD4U","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0bc64bf6b1da9ffcb812b4ea081d003a272cdb4d","infoHashBuffer":{"type":"Buffer","data":[11,198,75,246,177,218,159,252,184,18,180,234,8,29,0,58,39,44,219,77]},"announce":[],"urlList":[]}}