{"title":"Continued Fractions ","uid":8311274,"size":4395937,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0beacd510d362a5c602b1ce73a2de681078c6db6&amp;dn=Continued+Fractions+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"mdusanjay","files":-1,"time":1364486813,"description":"\nCarl D. Olds, A. Rockett , P. Szusze, &quot;Continued Fractions (New Mathmatical Library, Number 9) &quot;\n1992 | ISBN-10: 0883856093 | 196 pages | PDF | 4 MB\n\nContinued fractions are an area of mathematics that I have paid little attention to over my career. I have encountered and solved an occasional journal problem using continued fractions and worked with them a little bit in a number theory class that I took. However, I have yet to use them in any way in any of the classes that I have taught.\nWhen I saw this book in the library, I was intrigued, because this is an area within the bounds of undergraduate capability. After reading it, I am very glad that I picked it off the shelf. In less than two hundred pages, I made up for years of neglect. Starting at the beginning, where rational numbers are expanded out as a continued fraction, Olds sets the table for the real points of interest, which are solving Diophantine equations and expressing an irrational number as a continued fraction. The construction of continued fractions is so simple and easy to understand that I can see many ways in which they can be used to illustrate continued operations. For example, recursion is regularly taught in Discrete Mathematics courses aimed at computer science majors. Using the operation of an infinite continued fraction is yet another way to illustrate the basic principles of a recursive definition.","torrent":{"xt":"urn:btih:0beacd510d362a5c602b1ce73a2de681078c6db6","amp;dn":"Continued+Fractions+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0beacd510d362a5c602b1ce73a2de681078c6db6","infoHashBuffer":{"type":"Buffer","data":[11,234,205,81,13,54,42,92,96,43,28,231,58,45,230,129,7,140,109,182]},"announce":[],"urlList":[]}}