{"title":"GTR 2 - FIA GT Racing Game","uid":4262381,"size":1605797836,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:0cb0df54c7dea7c4be70a6a297787d6b2d61e115&amp;dn=GTR+2+-+FIA+GT+Racing+Game&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"poharchen","files":3,"time":1214528894,"description":"The first and most obvious way the GTR developers have done this is through the driving school, an expansive tutorial that has seemingly been designed to take you from the ground up--from your first moments in the car to competing tightly with the game&amp;#039;s demanding artificially intelligent drivers (or with up to 27 other players via the game&amp;#039;s excellent online multiplayer racing). Categories covered in driving school include the basics, such as acceleration and braking, up through cornering and overtaking, and finally, into section-by-section breakdowns of many of the tracks featured in the game. Each category includes a text breakdown that covers the theory behind each racing concept, as well as the specific goal you need to accomplish in order to pass that particular challenge. You can also practice the challenge before an &quot;official&quot; attempt against the ghost car or watch the ghost car&amp;#039;s lap to view proper braking or turn-in points, which is essential for some of the trickier challenges. By beating challenges, you unlock a host of restricted-class championships that are graded in difficulty levels; some of the first championships you open are quite easy and serve as an excellent introduction to the kind of intense on-track action that forms the heart of the game. Those new to the series are well served by simply going through the basic tutorials in driving school, unlocking a few championships and competing in a few of these early series. In all, if you go so far as to compete in all 142 challenges found in GTR 2, you&amp;#039;ll be well on your way to mastering the fundamentals of driving quickly and have a good idea of how the many tracks found in the game operate.\n\nOnce you&amp;#039;re done with the tutorials and have built up a heap of early-game confidence, you&amp;#039;ll find a number of game modes and options in GTR 2 just waiting to beat you down and bring you back to earth. Open practice and time trial are two good ways to improve your lap time. The inclusion of a color-coded racing line feature similar to that found in Forza Motorsport is a nice touch--though the one found in GTR 2 isn&amp;#039;t as dynamic as the feature in Forza. As a result, you&amp;#039;ll often find points where you can &quot;fudge&quot; the race line in order to gain a few extra tenths. The same can be said for the turn indicator signs that pop up when turning laps, which also suggest the gear you should be in to attack a particular corner. Many times you can safely ignore the recommended gear in favor of what you know works better in a particular car.\n\n\nWith multiple car classes available, you&amp;#039;ll easily find a ride to suit your speed.\n\nGTR 2&amp;#039;s three main racing modes are race weekend, championships, and 24-hour race. A race weekend is a single event, complete with multiple practice and qualifying rounds, as well as the actual race itself. Championship mode includes both the 2003 and 2004 official FIA GT seasons, as well as the custom championships you open up by completing challenges in the driving school. New for GTR 2 are the 24-hour races on tracks such as Spa-Franchorchamps, Monza, and China&amp;#039;s Zuhai circuit. You can scale down these grueling endurance races to a more manageable size (say one or three hours) and still experience the same gradual day-to-night transition you would in a 24-hour race.\n\nThere are three difficulty levels to choose from--novice, semi-pro, and simulation. And, as you may expect, the difference in handling between novice and simulation is dramatic. At the novice level, every option from antilock braking to various aids, such as stability and braking assists, are available to be toggled on and off at your discretion. The semi-pro level turns off most of these aids but leaves traction control and your ABS system intact. The simulation level of difficulty grays out all options and leaves you on the asphalt with only your skill behind the wheel (and whatever deity you pray to) to count on.","torrent":{"xt":"urn:btih:0cb0df54c7dea7c4be70a6a297787d6b2d61e115","amp;dn":"GTR+2+-+FIA+GT+Racing+Game","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0cb0df54c7dea7c4be70a6a297787d6b2d61e115","infoHashBuffer":{"type":"Buffer","data":[12,176,223,84,199,222,167,196,190,112,166,162,151,120,125,107,45,97,225,21]},"announce":[],"urlList":[]}}