{"title":"Maduro&amp;Schauerhammer-Holes in Ozone Scare(1992)","uid":4533230,"size":3962934,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0dbd818aeda631bab62a27dee2abb2446958bbfc&amp;dn=Maduro%26Schauerhammer-Holes+in+Ozone+Scare%281992%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"red_gonzo","files":1,"time":1227637740,"description":"This is Rogelio A. Maduro&amp;#039;s and Ralf Schauerhammer&amp;#039;s explosive book The Holes in the Ozone Scare - The Scientific Evidence That the Sky Isn&amp;#039;t Falling (1992) which reveals in well-documented and stark detail how science is being misused to achieve political ends using the ozone scare hoax. Concerned about the thinning of the ozone layer? According to this book, even the worst-case scenario of an 8 percent decrease in ozone is equivalent to the increase in ultraviolet radiation and skin cancer risk you would get from moving 100 miles south from where you are now. This fascinating book compiles well hidden facts, that if were published in media before 1990 would have nipped the environmental hoax of ozone depletion in the bud. There are literally dozens of natural sources for chlorine, such as vaporizing sea water and bacterial action that create atmospheric ozone. In addition, volcanoes belch thousands of tons of ostensibly ozone depleting chlorine atoms in to the atmosphere every year. One of these, Mt Erebus, is in the Antarctic where scientists took chlorine measurements in the 80s and early 90s which scared the whole world - just a coincidence? In addition to this freon molecules are 50 times heavier than air. The Enviro-Socialists would have us believe that these heavy freon molecules somehow floated high into the troposphere and began munching on tasty ozone molecules. This blockbuster by two tireless researchers is an invaluable tool for those of us who always knew there was something wrong with the so-called science of the ozone hole crisis. Everyone interested in global environmental issues should read this powerful book and then consider whether press releases and computer simulations that are unaccompanied by solid scientific evidence should drive our science policy. With Maduro&amp;#039;s timely, unemotional review of the record of scientific research on stratospheric ozone, the false claims of depletion and catastrophe are revealed for the empty scare tactics that they really are. The Holes in the Ozone Scare is a provocative look at the CFC ozone depletion scare, arguing that the scientific evidence does not support it but that the profit-eager corporations will do anything to fool us into it. Being a masterful analysis, which demolishes the corporate environmentalist and media-perpetrated frauds that the Earth&amp;#039;s protective ozone layer is being destroyed and that CFCs are the culprit. The Montreal Protocol outlawing freon ensured monopoly of refrigerant production by the major chemical companies of the world, British Chemical Co. of England and DuPont (under the Jewish Bronfmans) in America. It&amp;#039;s very easy to see that the only thing green about the environmental movement is money itself. The Du Pont Corporation, under Canadian Bronfman-Seagrams Ltd. corporate management, stands to make billions of dollars of speculative profits by promoting what it knows to be a scientific fraud, at the expense of millions of lives. As it stands now you probably won&amp;#039;t die from ozone depletion but you&amp;#039;ll probably be robbed clean by various environmental taxes instead. 360 pages, many pictures. A must read for everyone.\n","torrent":{"xt":"urn:btih:0dbd818aeda631bab62a27dee2abb2446958bbfc","amp;dn":"Maduro%26Schauerhammer-Holes+in+Ozone+Scare%281992%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0dbd818aeda631bab62a27dee2abb2446958bbfc","infoHashBuffer":{"type":"Buffer","data":[13,189,129,138,237,166,49,186,182,42,39,222,226,171,178,68,105,88,187,252]},"announce":[],"urlList":[]}}