{"title":"SNATCH.DVDrip[vice]","uid":5176039,"size":500169617,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0e516d23b61665b5d47b8f27d1fba304591d6f28&amp;dn=SNATCH.DVDrip%5Bvice%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"vicerock","files":-1,"time":1258983232,"description":"SNATCH DVDrip\n\nVIDEO CODEC Xvid\nformat Avi\nsize/res 480x234[wide screen]\nrun-time 01:42:43\nvideo bitrate 512\nvideo framerate 25\nXvid profile asp5\n\nAUDIO CODEC mp3\naudio bitrate 128\nsample rate 44100\na/v sync basic\n\nCAST\n\nJason Statham\nStephen Graham\nDennis Farina\nVinnie Jones\nBrad Pitt\nAlan Ford\nLennie James\nAde\nRobbie Gee\nRade Ã…Â erbedÃ…Â¾ija\nBenicio del Toro\nMike Reid\n\nPLOT\n\nThe film starts with boxing promoter, Turkish (Jason Statham) and his associate and friend, Tommy (Stephen Graham) sitting in a room with an unknown man while Turkish narrates what happened the week before. We cut to Antwerp, where a group of robbers dressed as Hasidic Jews rob a bank and steal an 86 carat diamond the size of a fist. One of the robbers is compulsive gambler, Franky &quot;Four-Fingers&quot; (Benicio del Toro) who is about to head to London. Another one of the robbers tells him that when he get's to London, he can get a gun from Boris &quot;The Blade&quot; Yurinov (Rade Serbedzija).\n\nWe cut back to Turkish and Tommy who are training their boxer, Gorgeous George (Adam Fogerty). Turkish is unhappy with the caravan he uses to run his business, so he tells Tommy to buy him a new one from a campsite full of &quot;pikeys&quot; (Irish Gypsies). Turkish then finds Tommy carrying a gun that he got from Boris, which Tommy says is for protection. Turkish explains that Tommy's newfound interest in firearms comes from the fact that Gorgeous has caught the eye of underground mob boss, &quot;Brick Top&quot; Polford (Alan Ford). Brick Top wants Gorgeous to take a dive so that he can get all the money from the bets on him. It's said Brick Top's favorite way to do people in is to kill them and feed their remains to pigs, so Turkish and Tommy have to try hard not to let him down.\n\nWe cut back to Antwerp, where the robber who told Franky to go see Boris turns out to be Boris' brother. He's on the phone with Boris and tells him to get somebody else to steal the stone so that the Americans won't know Russia was involved. Boris says he knows some guys for the job, and his brother also mentions that Franky loves to gamble. We cut to New York where Abraham &quot;Cousin Avi&quot; Denovitz (Dennis Farina) is on the phone with Franky. Avi tells Frankie to go see his cousin Douglas &quot;Doug The Head&quot; Denovitz (Mike Reid) to get a price on the diamond. Avi also mentions to Frankie to stay away from gambling. Avi then calls Doug and tells him that Frankie's on his way and Doug says if the stone's real, he'll buy it. We then see Franky buying a gun from Boris and in return for it, he wants Franky to place a bet at a bookies for an unliscenced boxing match under Boris' name.\n\nWe then see Tommy and Gorgeous driving to the pikey campsite to buy Turkish a new caravan. We learn here that pikeys are deceitful and hard to understand because of their accents. They meet Mickey O'Neil (Brad Pitt) and buy a caravan from him. Everything seems to be alright, but as soon as Tommy and Gorgeous drive off, the wheels break off the caravan. Tommy and Gorgeous want their money back, but Mickey refuses. Gorgeous then starts throwing his weight around, which causes Mickey to challenge him to a fight for the money. At first, Gorgeous brutalizes Mickey, punching him even before he's ready. Mickey then knocks Gorgeous out with one punch and we learn that he's a bare-knuckle boxer. Gorgeous' neck and jaw are broken and if he doesn't wake up, then the pikeys will kill Tommy too, so that they're no witnesses.\n\nWe then cut to pawn shop owners and brothers, Sol (Lennie James) and Vinnie (Robbie Gee). Vinnie has just bought a dog from the pikey campsite, much to Sol's distress. Boris then pays them a visit and says that he wants them to hold up the bookies that Frankie is going to to place the bet. The deal is that they wait for a man with four fingers carrying a briefcase to enter the bookies. They then hold up the bookies, take the case from the four fingered man and take the money from the bookies. Boris gets the case and they get $50,000. We then see Doug examining the smaller stones stolen from the robbery. Frankie mentions to Doug he'll be back after the boxing match to negotiate the price. We cut back to Sol and Vinnie as they prepare to rob the bookies. They hire obese getaway driver, Tyrone (Ade) for the job. We then see Franky parked outside the bookies and getting into the back of his van to change. When parking outside the bookies, however, Tyrone accidentally backs up into Frankie's van and knocks him out. This causes Vinnie's dog to get excited, so they give it a chew toy to calm it down, which it swallows. &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0208092/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0208092/&lt;/a&gt;\n\nPLEASE SEED AND ENJOY THANKS","torrent":{"xt":"urn:btih:0e516d23b61665b5d47b8f27d1fba304591d6f28","amp;dn":"SNATCH.DVDrip%5Bvice%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0e516d23b61665b5d47b8f27d1fba304591d6f28","infoHashBuffer":{"type":"Buffer","data":[14,81,109,35,182,22,101,181,212,123,143,39,209,251,163,4,89,29,111,40]},"announce":[],"urlList":[]}}