{"title":"Seed Libraries (2015).epub Gooner","uid":12704496,"size":9367801,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0e8605086d667c571843fe3d7591d874df5b4902&amp;dn=Seed+Libraries+%282015%29.epub+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1446812879,"description":"Publisher: New Society Publishers (March 3, 2015)\r\nLanguage: English\r\nISBN-10: 0865717826\r\nISBN-13: 978-0865717824\r\n\r\nHistorically, seed companies were generally small, often family-run businesses. Because they were regionally based, they could focus on varieties well-suited to the local environment. A Pacific Northwest company, for example, would specialize in different cultivars than a company based in the Southeast. However the absorption of these small, independent seed businesses into large multinationals, combined with the advancement of biotechnology resulting in hybrids and GMO seeds, has led to a serious loss of genetic diversity. The public is now at the mercy of the corporations that control the seeds.\r\n\r\nIn the past few years, gardeners have realized the inherent danger in this situation. A growing movement is striving to preserve and expand our stock of heritage and heirloom varieties through seed saving and sharing opportunities. Seed Libraries is a practical guide to saving seeds through community programs, including:\r\n\r\nStep-by-step instructions for setting up a seed library\r\nA wealth of ideas to help attract patrons and keep the momentum going\r\nProfiles of existing libraries and other types of seed saving partnerships\r\nWhoever controls the seeds controls the food supply. By empowering communities to preserve and protect the genetic diversity of their harvest, Seed Libraries is the first step towards reclaiming our self-reliance while enhancing food security and ensuring that the future of food is healthy, vibrant, tasty, and nutritious.\r\n\r\nCindy Conner is a permaculture educator, founder of Homeplace Earth and producer of two popular instructional gardening DVDs. She is also the author of Grow a Sustainable Diet","torrent":{"xt":"urn:btih:0e8605086d667c571843fe3d7591d874df5b4902","amp;dn":"Seed+Libraries+%282015%29.epub+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0e8605086d667c571843fe3d7591d874df5b4902","infoHashBuffer":{"type":"Buffer","data":[14,134,5,8,109,102,124,87,24,67,254,61,117,145,216,116,223,91,73,2]},"announce":[],"urlList":[]}}