{"title":"Grange - Twenty-First Century Warplanes And Helicopters(amitks93","uid":5925868,"size":37229787,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0f0cf624f6bc0a9f10f056160dbb5a26ddbc4c4f&amp;dn=Grange+-+Twenty-First+Century+Warplanes+And+Helicopters%28amitks93&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"amitks93","files":4,"time":1288599759,"description":"Peter Darman - Twenty First Century Warplanes and Helicopters\nGrange Books | 2004 | ISBN: 1840136790 | 192 pages | PDF | 34.16 MB\nMilitary Handbooks\n\nTwenty-First Century Warplanes and Helicopters features the most important military fixed-wing and rotary-wing aircraft currently in service around the world. These include the warplanes currently in US service, such as the B-1 and B-2 bombers, the F-16 Fighting Falcon, F-15 Eagle and F-14 Tomcat. Also featured are the warplanes and helicopters that area a crucial part of NATO's air defence network, such as the Tornado, Harrier, Eurofighter Typhoon and PAH-2 Tiger. In addition, the book contains the most important airborne warning and air control system (AWACS) aircraft in service, such as the Sentry, E-767 and Mainstay.\nThough multirole combat aircraft form the cutting edge of modern air forces, transporters provide essential logistical support for both ground and air units. Twenty-First Century Warplanes and Helicopters therefore features transport aircraft and helicopters currently in service around the world, including the C-141 Starlifter, II-76 Candid, C-130 Hercules, C-17 Globemaster, CH-47 Chinook and CH-53 Sea Stallion. Each aircraft featured is illustrated by a full-color photograph and accompanied by text that describes its design, development and deployment history.\n\n\nplease seed and comment.\n\n\namitks93","torrent":{"xt":"urn:btih:0f0cf624f6bc0a9f10f056160dbb5a26ddbc4c4f","amp;dn":"Grange+-+Twenty-First+Century+Warplanes+And+Helicopters%28amitks93","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0f0cf624f6bc0a9f10f056160dbb5a26ddbc4c4f","infoHashBuffer":{"type":"Buffer","data":[15,12,246,36,246,188,10,159,16,240,86,22,13,187,90,38,221,188,76,79]},"announce":[],"urlList":[]}}