{"title":"Mark Z Danielewsky - Recordings Recovered from the House of Leav","uid":6782703,"size":54092786,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:0f16c6954435f3a797bf76c6725438876a451ebf&amp;dn=Mark+Z+Danielewsky+-+Recordings+Recovered+from+the+House+of+Leav&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"fakeplastictrousers2","files":2,"time":1319972903,"description":"Recordings Recovered from the House of Leaves\n\nFrom BBC Radio 4. Written by Mark Z. Danielewsky; Full-cast dramatisation; Adapted by Mike Walker.\n\n&quot;The Navidson Record now stands as part of this country's cultural experience and yet, in spite of the fact that hundreds of thousands of people have seen it, the film continues to remain an enigma. Some insist it must be true, others believe it is a trick on a par with the Orson Welles radio romp The War of the Worlds. Many more have never even heard of it.&quot;\n\nWith these words Zampano preludes the excerpts from an extraordinary film, cut together by Will Navidson from cameras located within his house and those he took with him into the labyrinth that had sprung up there over the course of a few days.\n\nAccording to the Navidson record, it was when the family returned to the house from a trip to Seattle that they first discovered the additional door and the space behind it. Will Navidson, celebrated adventure photographer, was intrigued, his partner Karen insisted that the door be permanently locked. But one night after a row, Navidson opened the door and went in. He found rooms beyond rooms, all windowless, all unlit, and only narrowly escaped becoming lost forever in the labyrinth. Not long afterwards the spiral staircase appeared, corkscrewing downwards to a dark infinity. So Navidson equipped his brother Tom and others for an expedition, as if they were embarking on a quest into some architectural jungle. The cameras rolled and they descended, and here's the audio.\n\n\nCast:\nZampano ..... Jim Norton\nNavidson .....William Hope\nKaren ..... Debora Weston\nTom Navidson ..... Martin McDougall\nJed Leeder ..... Jeff Mash\nHolloway ..... Richard Ridings\nReston ..... Vinta Morgan\nDaisy ..... Eleanor Blaney\n\nProducer/Director: John Taylor\nA Fiction Factory production for BBC Radio 4","torrent":{"xt":"urn:btih:0f16c6954435f3a797bf76c6725438876a451ebf","amp;dn":"Mark+Z+Danielewsky+-+Recordings+Recovered+from+the+House+of+Leav","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0f16c6954435f3a797bf76c6725438876a451ebf","infoHashBuffer":{"type":"Buffer","data":[15,22,198,149,68,53,243,167,151,191,118,198,114,84,56,135,106,69,30,191]},"announce":[],"urlList":[]}}