{"title":"Brooke Valentine feat. Big Boi &amp; Lil' Jon - Girlfight","uid":4990957,"size":138596356,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:0fa768c2385d90158c5bbf6da34cb3e7842565fb&amp;dn=Brooke+Valentine+feat.+Big+Boi+%26+Lil%5C%27+Jon+-+Girlfight&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1247038662,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Girlfight&quot; is the first single recorded by R&amp;B singer Brooke Valentine. It was her first single from her debut album Chain Letter. The song features Lil Jon and Big Boi from OutKast. The song is about a tension between two girls who end up in a catfight and was a minor Top 30 hit, peaking at #23. A remix was made which features Valentine, Lil Jon, Jazzie, Da Brat, Ms. B and Remy Ma. This remains as Valentine's only hit.\n\nChain Letter is the debut album by Brooke Valentine, released on March 15, 2005. The album contains the lead single &quot;Girlfight&quot;, that features Big Boi from the band Outkast, and Lil Jon. &quot;Girlfight&quot; peaked at #23 in the Billboard Hot 100 and is a song about tension between two girls which ends up in a catfight. The second released off the album was &quot;Long As You Come Home&quot;, peaking at #71 in the Hot R&amp;B/Hip-Hop Singles &amp; Tracks proving that it could have been successful had a video been released. The third single was &quot;Cover Girl&quot;.\n\nThe album peaked at #16 in the Billboard 200 on April 2, 2005 and #3 in the Billboard Top R&amp;B/Hip-Hop Albums Chart. Although the album was critically acclaimed, the album sold only 340,000 copies in the US. This album is no longer in print, however is available digitally on itunes.\n\nBrooke Valentine is an American R&amp;B singer-songwriter. She started her musical career as a member of the female group Best Kept Secret. To pursue a solo career, she moved to Los Angeles, California and signed to Subliminal Entertainment/Virgin Records.\n\nShe released her debut album Chain Letter in March 2005. It sold 340,000 copies in the United States. The album features her hit debut single, &quot;Girlfight&quot; released late 2004, in a collaboration with rappers Big Boi and Lil Jon, a song about tension between two girls which ends up in a catfight.\n\nThe first single from her second album Physical Education was &quot;D-Girl&quot; (&quot;Dope Girl&quot;), which did not chart, along with a second single, &quot;Pimped Out&quot;, in November 2006. The release of the album was canceled during the Capitol &amp; Virgin Records merge in 2007, the future of the project is currently unknown, but this seems to be scrapped and unreleased due to work on her third studio album. Valentine has been in the studio working on her next album, due out in 2009.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:0fa768c2385d90158c5bbf6da34cb3e7842565fb","amp;dn":"Brooke+Valentine+feat.+Big+Boi+%26+Lil%5C%27+Jon+-+Girlfight","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0fa768c2385d90158c5bbf6da34cb3e7842565fb","infoHashBuffer":{"type":"Buffer","data":[15,167,104,194,56,93,144,21,140,91,191,109,163,76,179,231,132,37,101,251]},"announce":[],"urlList":[]}}