{"title":"GAY - MARCOS ANTONIO [Porn Gay Brasil XXX] - Floresta","uid":6125808,"size":871530123,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:0fbfa54a96618ab4b606234066995be4006f073b&amp;dn=GAY+-+MARCOS+ANTONIO+%5BPorn+Gay+Brasil+XXX%5D+-+Floresta&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Floresta","files":3,"time":1295937059,"description":" Marcos Antonio [Marc Anthony]\n\n\n [Mansize And Private Man]\n\n\n\n DescriÃƒÂ§ao/Sinopse:\n\nBem vindo ao mundo da Roma Antiga e no Egito. Sua 58BC ea bela rainha egipcia Cleopatra esta em tumulto. O imperio egipcio esta caindo distante nas emendas e ela nao sabe como salvar seu amado reino. Ela pede que os deuses e eles dizem que ela deve se casar com belo general romano Marco Antonio. Ela envia para ele e eles sao casados, mas os verdadeiros problemas comeÃƒÂ§am, pois Marc Anthony e gay! Como Marc Anthony fode sua maneira em torno do palacio do Egito, Cleopatra, comeÃƒÂ§a a suspeitar que o Marc nao pode ser capaz de proporcionar-lhe um herdeiro para o trono. Ela tenta de tudo para transforma-lo em linha reta, incluindo pocoes magicas e feiticos, mas quando voce e gay voce e gay! aproveite.\n\n\n Lucas Foz e conhecido no mundo como o &quot;machao impossivel&quot; ou o &quot;Deus brasileiro do sexo&quot;. Basta assistir uma de suas cenas para apaixonar com o astro.\n\n\n\n Description:\n\nWelcome to the world of Ancient Rome and Egypt. Its 58BC and the beautiful Egyptian Queen Cleopatra is in turmoil. The Egyptian empire is falling apart at the seams and she doesn't know how to save her beloved kingdom. She asks the Gods and they tell her she must marry handsome Roman General Marc Anthony. She sends for him and they are married, but then the real problems start, because Marc Anthony is gay! As Marc Anthony fucks his way around the Egyptian palace, Cleopatra begins to suspect that Marc may not be able to provide her with an heir to the throne. She tries everything to turn him straight including magic potions and spells, but when you're gay you're gay! ..enjoy\n\n\nLucas Foz is known worldwide as the &quot;macho impossible&quot; or &quot;God Brazilian sex. &quot; Just watch one of his scenes to fall in love with the star.\n\n\n\n Descripcion:\n\n Bienvenido al mundo de la Antigua Roma y Egipto. Su 58BC y la hermosa reina egipcia Cleopatra esta en crisis. El imperio egipcio esta cayendo a pedazos en las costuras y no sabe cÃƒÂ³mo salvar a su amado reino. Ella le pide a los dioses y le dicen que debe casarse apuesto general romano Marc Anthony. Se envia por el y se casaron son, pero los verdaderos problemas de inicio, ya que Marc Anthony es gay! Como Marc Anthony folla su camino alrededor del palacio de Egipto, Cleopatra empieza a sospechar que Marc no puede ser capaz de proporcionarle un heredero al trono. Ella intenta todo para ÃƒÂ©l a su vez directamente como pociones mÃƒÂ¡gicas y hechizos, pero cuando eres gay eres gay! disfrutan\n\n\n Lucas Foz es conocido mundialmente como el &quot;macho imposible&quot; o &quot;dios del sexo brasileno&quot;. Solo ver una de sus escenas para enamorarse de la estrella.\n\n\n\n ATORES: [Actors/Performer]:\n\n Mario Perez \t\t\n Janos Volt \t \t\t\n LUCAS FOZ [ATOR BRASILEIRO] [BRAZILIAN PORN ACTOR] \t\t\t\n Dany\t\t\t\n Black Jack \t\t\t\n Nico Blade \t\t\t\n Luis Casas \t \t\t\n Rics Volt Lesz \t\t\t\n Kevin Kline\t\t\t\n Lucky \t\n\n\n\n  INFORMACOES: [information]:\n\n\n  Titulo [name] - MARCOS ANTONIO [Marc Anthony]  \n  Referencias [reference] - Robert Hill,Falcon,Gang Bang,Bareback,Porno,Gay,Porn,Brasil,Brazilian,XXX,Movienet,TREASURE ISLAND,Potugues.\n  Audio - Ingles [English Audio] AC-3ACM   \t\n  Compactacao [Compaction] - DVIX AVI\n  Locacao - Naples [ItÃƒÂ¡lia] - [Location] - Naples Italy\n  Generos - [genre] Gay, Sexo Forte [Hot Sex] General Hardcore \n  Estudio - [PRODUCER] [Mansize And Private Man]\n  Diretor [director] - Sebastian Borgi\n  Rating: XXX  \n  Duracao 90 minutos - [Time 90 minutes]\n\n\n\n  OBRIGADO POR SEU DOWNLOAD, SEJA UM SEEED.\n THANK YOU FOR ITS DOWNLOAD, IS A SEEED. STAFFING\n GRACIAS POR LA DESCARGA, ES UN SEEED.\n\n\n PARA DOWNLOAD DE MAIS FILMES DIGITE FLORESTA E APROVEITE.\n MORE MOVIES TO DOWNLOAD WRITE FORESTA  AND ENJOY.\n MAS PELICULAS PARA DESCARGAR escribir FORESTA Y APROVECHAR.\n  \n\n  FLORESTA 2011 \n\n\n ","torrent":{"xt":"urn:btih:0fbfa54a96618ab4b606234066995be4006f073b","amp;dn":"GAY+-+MARCOS+ANTONIO+%5BPorn+Gay+Brasil+XXX%5D+-+Floresta","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0fbfa54a96618ab4b606234066995be4006f073b","infoHashBuffer":{"type":"Buffer","data":[15,191,165,74,150,97,138,180,182,6,35,64,102,153,91,228,0,111,7,59]},"announce":[],"urlList":[]}}