{"title":"Hanzodoses 2012 - Binaural Beats by Hand Hanzo","uid":7955432,"size":225627370,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:108295c9f4fb107a98ac5752288e29fb5ccae5e2&amp;dn=Hanzodoses+2012+-+Binaural+Beats+by+Hand+Hanzo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"handhanzo2013","files":10,"time":1356407079,"description":"GFORCE: REALITY BLASTER\nRecreational (Incredible)\n25 Minutes\nDreaming while awake, and then being awakened with your mind attuned to the power of infinity.  Seeing color far more vividly.  Knowing an incredible feeling that could only be hypothetical -- flying above the world and wandering the universe freely at your own discretion.  Realizing the true beauty of everything around you.  That's GForce.  This is the first binaural beat made by Hand Hanzo.  Subconsciously this was supposed to simulate Space Monkey, a brand of synthetic cannabinoid (&quot;spice&quot;).  That subconscious mission succeeded and now you have the world's first binaural spice trip at your fingertips.  Late in the mix, isochronic pulses are present for added effect.\n\nHOH-SYS\nExperimental (Incredible)\n25 Minutes\nI made this while I was still new to making these, and thought: what if I made something that kinda combined I-Doser's &quot;Hand of God&quot; and &quot;A-BOMB&quot; into one badass sequence? Well, I did, and added the signature 6.3hz theta segment that is present in most of my binaural beats.  This is a bit of an all-purpose.  Put this on while you're awake, get blown back.  Put this on repeat while you sleep, have really trippy dreams.  The name &quot;Hoh-Sys&quot; is a double entendre.  It stands for &quot;Hand of Hanzo System&quot; and is also a reference to a since-removed (and fan-reuploaded) YouTube Poop originally made by cs188 called &quot;No one needs foundation repair&quot;.  WARNING: Refrain from driving or operating heavy machinery after &quot;dosing&quot; this!\n\nLAX MOMENT\nSleep (Very Strong)\n20 Minutes\nOpiate-style brainwaves combine with my signature hertz drop to create something made specifically for relaxation, which is said to be the primary point of binaural beats anyway.  This one in particular is so relaxing it'll help you sleep, no problem.\n\nQUICK TRIP\nRecreational (Very Strong)\n15 Minutes\nI was tinkering with the formula for I-Doser's &quot;LSD&quot; dose one day when I realized what it was missing.  Inspired by the video game &quot;LSD: Dream Emulator&quot;, I made a modified build of the formula with half the length and double the effect, thanks to my signature 6.3hz segment (which is supposed to supplement ASTRAL FREAKING PROJECTION, among other assorted effects of awesomeness) and the addition of a 1hz beat, which promotes a state of well-being.\n\nACTION\nStimulant (Very Strong)\n20 Minutes\nI went into this trying to make a stimulant-style binaural beat.  I did pretty well, I think.  Maybe needs more pink noise, but for what it is, this track is a meditative experience that takes you through adrenaline and into a sharp focus.  For anything that requires you to be tactical or just ready.  This will get you to where you need to go.\n\nSTRONGER\nExperimental (Incredible)\n35 Minutes\nThis is the final result of a mission to strengthen the mind through binaural beat therapy.  This promotes balance, fast learning, improved reflexes and increased intelligence.  Proof that binaural beats are for a whole lot more than trying to mimic recreational &quot;altered states&quot;.  In fact, the first ten minutes contain a pattern said to help with mild autism.\n\nDR. HANZO'S CURE-ALL\nMedical (Strong)\n20 Minutes\nThis is an experiment with attempting to treat pain and illness with binaural beats.  There's a certain frequency as which the sinuses clear up, and that frequency is present here along with pain-numbing patterns.  It was November, and Hanzo had already been sick all fall long: tonsilitis, sinus infection, the flu, you name it.  Supplementing plenty of penicillin, Dayquil pills and as much rest as the House of 9 would allow was this.  Try it -- see if it works for you!\n\nHIGH RESONANCE\nExperimental (Very Strong)\n20 Minutes\nSubstituting energy drinks for sleep, I decided to use my all-nighter to finally test some of my new shit out.  The first six minutes are made to ramp up your alertness, and the rest is a time-released injection of euphoric aural stimuli -- until you get to that one part where it's like the entire universe is blasted into your brain at once.  I'm sorry I can't write a better description than this, I'm still feeling the effects of this.  It feels like I'm a bit blunted emotionally, so it's like a shield or a coat of armor surrounding my mind.\n\nASTRAL\nSpiritual (Very Strong)\n30 Minutes\nThis is my formula, based on researched frequencies, for a meditative binaural to help induce astral projection.  Compare and contrast with I-Doser's Astral formula, which uses lower-level theta frequencies to induce the meditative state, and my Rebirth formula (see the description for that).  This goes up to a 10.5 alpha level, a frequency that induces unity of body and mind, before dropping into the 7 theta level, the frequency for astral.\n\nREBIRTH\nExperimental (Very Strong)\n25 Minutes\nThis is a binaural that was built to work on multiple levels of relaxation and tuning with one's inner self.  You will feel refreshed after using this, and this can also be used for astral projection.","torrent":{"xt":"urn:btih:108295c9f4fb107a98ac5752288e29fb5ccae5e2","amp;dn":"Hanzodoses+2012+-+Binaural+Beats+by+Hand+Hanzo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"108295c9f4fb107a98ac5752288e29fb5ccae5e2","infoHashBuffer":{"type":"Buffer","data":[16,130,149,201,244,251,16,122,152,172,87,82,40,142,41,251,92,202,229,226]},"announce":[],"urlList":[]}}