{"title":"True Ghost Stories: Jim Harold's Campfire 2 (2013)Jim Harold(mul","uid":9506029,"size":738401,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:121d7872ca2c6a4c3b14d6ffd1dd6b423b2d7a9b&amp;dn=True+Ghost+Stories%3A+Jim+Harold%27s+Campfire+2+%282013%29Jim+Harold%28mul&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"7","files":-1,"time":1390319108,"description":"True Ghost Stories: Jim Harold's Campfire 2 by Jim Harold\n\n\nFormat: mobi/epub/azw3\nLength: 254 pages\nGenre: Non-Fiction/Paranormal\nDate: 16 September 2013\n\nNothing is better than a roaring campfire and an enticing ghost story, so be sure to get your hands on this book by America's top paranormal podcast host, Jim Harold! Listeners from all around the world have shared their spooky stories on his programs. Join Jim around his ghostly campfire as he recounts true tales such as these:\n\n* A Walking Ouija Board.\n* A Ghost Nanny Who Helps Out With The Baby.\n* An Answering Machine Message From The Dearly Departed.\n* A Man Who Experienced The Plot Of A Horror Movie, 20 Years Before It Was Made!\n* A Haunted Recliner That Terrorizes Those Who Are Unfortunate To Possess It.\n* PLUS 65 More TRUE, Gut Wrenching Stories of Real Paranormal Activity From The Popular Campfire Podcast.\n\nWARNING: Don't buy this book if you are easily frightened! Jim's book editor said, &quot;I'm glad I am finished editing your book. Your stories freaked me out! I couldn't sleep at night!&quot;\n\nFREE Audio Download With Purchase. On this special audio Campfire, exclusively created for readers of TRUE GHOST STORIES: Jim Harold's Campfire 2, Jim replays the audio of his 5 favorite stories from this compilation. You will hear the original retelling of these stories by actual Campfire callers. It is a paranormal countdown in the spirit of the old Top 40 radio shows. It is Jim's special thank you gift!\n\nAuthor:\n\nIn 2005, Jim Harold started podcasting on the paranormal. His life-long interest in the supernatural, combined with his love of broadcasting and technology, resulted in the most successful Web-based program in the world. The Paranormal Podcast, Jim Harold's Campfire, and The Paranormal Report are regularly among the top podcasts in their categories on iTunes, often outranking programs from the biggest mainstream media publishers. Jim lives in northeastern Ohio with his fantastic wife and two daughters.","torrent":{"xt":"urn:btih:121d7872ca2c6a4c3b14d6ffd1dd6b423b2d7a9b","amp;dn":"True+Ghost+Stories%3A+Jim+Harold%27s+Campfire+2+%282013%29Jim+Harold%28mul","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"121d7872ca2c6a4c3b14d6ffd1dd6b423b2d7a9b","infoHashBuffer":{"type":"Buffer","data":[18,29,120,114,202,44,106,76,59,20,214,255,209,221,107,66,59,45,122,155]},"announce":[],"urlList":[]}}