{"title":"Halloweentown 1-4","uid":8814825,"size":2917557211,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:122076861c5f83fc9714781c0efcdd455abeb081&amp;dn=Halloweentown+1-4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"cj48089","files":4,"time":1376554383,"description":"Halloweentown (1998)\n\nMarnie, Dylan, and Sophie Piper have their first out of many adventures! On Halloween, while Marnie is arguing with her mother Gwen, the kids' grandmother Aggie comes to visit. Aggie wants to start Marnie's witch training before her 13th birthday or Marnie will lose her powers forever. But there is another reason for Aggie's visit. Something dark &amp; evil is growing in Halloweentown &amp; Aggie wants help to defeat it. While Aggie &amp; Gwen are arguing, Aggie uses magic which Marnie observes. After Aggie leaves to return to Halloweentown, Marnie, Dylan and, unknown to Marnie and Dylan, Sophie follow her onto the return bus. Soon afterwards, Gwen follows the children to Halloweentown. While there, Aggie &amp; Gwen are attacked by the dark force in a movie theater. Marnie, Dylan &amp; Sophie race to get the ingredients to activate Merlin's Wand to stop the evil.\n----------------------------------------------------------------------------------\n\nHalloweentown II: Kalabar's Revenge (2001)\n\nThe Cromwell clan split their time between the real world and &quot;Halloweentown&quot;, but the son of an old rival threatens to make the latter &quot;real&quot; and the real world a place of monsters.\n----------------------------------------------------------------------------------\n\nHalloweentown High (2004)\n\nBack to school's never been so cool or supernatural for Marnie (Kimberly J. Brown), her grandmother Aggie (Debbie Reynolds), and her family of witches in this latest chapter in the ever-popular series of HALLOWEENTOWN movies. When Marnie convinces the Halloweentown Council to send several teenagers to her high school in the mortal world, she even promises to give up her magic if any harm comes to them. But soon, Marnie and her new friends are in trouble and out of luck when the evil Knight Of The Iron Dagger appears. He's determined to destroy all things magical, and it's up to Marnie to save her high school, the human world, and her magic.\n----------------------------------------------------------------------------------\n\nReturn to Halloweentown (2006)\n\nBy now, everyone knows Marnie Piper (Sara Paxton, AQUAMARINE) is a witch, so it comes as no surprise when she wins a full scholarship to prestigious Witch University in Halloweentown. Excited about learning alchemy and amulets, potions and portents, Marnie travels through the portal to become Witch U's most famous coed. But everything is not what it seems. There's a new school rule: No magic allowed! Marnie also learns about an ancient prophecy -- and it turns out she holds the key to revealing the ultimate secret. With the help of old friends Ethan (Lucas Grabeel, HIGH SCHOOL MUSICAL and HIGH SCHOOL MUSICAL 2) and Benny the Skeleton, and new friends Professor Periwinkle and Aneesa the Genie, will Marnie make the right choices in time for Halloweentown's 1,000 Year Anniversary Celebration?","torrent":{"xt":"urn:btih:122076861c5f83fc9714781c0efcdd455abeb081","amp;dn":"Halloweentown+1-4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"122076861c5f83fc9714781c0efcdd455abeb081","infoHashBuffer":{"type":"Buffer","data":[18,32,118,134,28,95,131,252,151,20,120,28,14,252,221,69,90,190,176,129]},"announce":[],"urlList":[]}}