{"title":"Modernism and the Art of Muslim South Asia (Art Ebook).pdf","uid":10074607,"size":29191114,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:126073902f0fb38ab79394a0d850b71d5edd174f&amp;dn=Modernism+and+the+Art+of+Muslim+South+Asia+%28Art+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"STBGD","files":-1,"time":1398902852,"description":"Modernism and the Art of Muslim South Asia (Islamic Civilization and Muslim Networks)\n\nIftikhar Dadi / The University of North Carolina / 2010 / 360p / pdf / 27,8 MB\n\nArt historian Iftikhar Dadi here explores the art and writings of major artists, men and women, ranging from the late colonial period to the era of independence and beyond. He looks at the stunningly diverse artistic production of key artists associated with Pakistan, including Abdur Rahman Chughtai, Zainul Abedin, Shakir Ali, Zubeida Agha, Sadequain, Rasheed Araeen, and Naiza Khan. Dadi shows how, beginning in the 1920s, these artists addressed the challenges of modernity by translating historical and contemporary intellectual conceptions into their work, reworking traditional approaches to the classical Islamic arts, and engaging the modernist approach towards subjective individuality in artistic expression. In the process, they dramatically reconfigured the visual arts of the region. By the 1930s, these artists had embarked on a sustained engagement with international modernism in a context of dizzying social and political change that included decolonization, the rise of mass media, and developments following the national independence of India and Pakistan in 1947.\nBringing new insights to such concepts as nationalism, modernism, cosmopolitanism, and tradition, Dadi underscores the powerful impact of transnationalism during this period and highlights the artists' growing embrace of modernist and contemporary artistic practice in order to address the challenges of the present era.\nThis pioneering work traces the emergence of the modern and contemporary art of Muslim South Asia in relation to transnational modernism and in light of the region's intellectual, cultural, and political developments.\nBringing new insights to such concepts as nationalism, modernism, cosmopolitanism, and tradition, Dadi underscores the powerful impact of transnationalism during this period and highlights the artists' growing embrace of modernist and contemporary artistic practice in order to address the challenges of the present era. ","torrent":{"xt":"urn:btih:126073902f0fb38ab79394a0d850b71d5edd174f","amp;dn":"Modernism+and+the+Art+of+Muslim+South+Asia+%28Art+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"126073902f0fb38ab79394a0d850b71d5edd174f","infoHashBuffer":{"type":"Buffer","data":[18,96,115,144,47,15,179,138,183,147,148,160,216,80,183,29,94,221,23,79]},"announce":[],"urlList":[]}}