{"title":"Slingshot Racing v1.3.3.4(AnDrOid).apk","uid":9959655,"size":33912982,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:14435e9391c95d7345ea75cd94c46dba5f0781e3&amp;dn=Slingshot+Racing+v1.3.3.4%28AnDrOid%29.apk&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Evil_Amdis","files":1,"time":1397504101,"description":"Slingshot Racing\n\n\nBehold a beautiful steampunk environment with ice tracks, grappling hooks, snowmen and more!\n\nPro Tip: To deploy the hook try picking a corner of the screen and just keep pressing there. You do not need to press on the towers to slingshot.\n\nUse your grappling hook to slingshot around corners in this fast paced arcade style racer. Hone your skills by learning on the tutorial tracks, then blast out of the snow onto more complex tracks against other racers. Race around a selection of tracks in stunning day and night settings.\n\nCareer mode features 80 races with different objectives and settings. Take part in a simple straight race to the top spot on the podium. The pickups race pits you against the clock to collect all the cogs on the track as quickly as possible. The time trials offer you the chance to shave those all important seconds to achieve the perfect race. Alternatively prove your mettle by taking on the fearsome chomper as it hunts you around the track.\n\nWith 4 way multiplayer you can race family or friends on a single device. With just a few clicks you can create mini tournaments the way you like or just mix it up with a quick random selection.\n\nFeatures\n- Super addictive gameplay \n- Revolutionary controls, easy to pickup and difficult to master \n- Stunning graphics with gorgeous 3D effects, shadows, and particle systems \n- 4 player simultaneous play on one device! Play against your whole family! \n- Tweet or Post your high scores on Facebook\n\n\nWhat's New\n- Fixed crash on VideoCore IV devices.\n- Disabled review prompt.\n","torrent":{"xt":"urn:btih:14435e9391c95d7345ea75cd94c46dba5f0781e3","amp;dn":"Slingshot+Racing+v1.3.3.4%28AnDrOid%29.apk","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"14435e9391c95d7345ea75cd94c46dba5f0781e3","infoHashBuffer":{"type":"Buffer","data":[20,67,94,147,145,201,93,115,69,234,117,205,148,196,109,186,95,7,129,227]},"announce":[],"urlList":[]}}