{"title":"THE aMAZEing Labyrinth v1.0.2 full","uid":13481192,"size":167174401,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:154ec033dbaf78b77adeee157fff54140c8d27c5&amp;dn=THE+aMAZEing+Labyrinth+v1.0.2+full&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"tiropitaki","files":2,"time":1455059867,"description":"Labyrinth is the award winning board game that’s sold over 13 million units since its creation 25 years ago. Now, the fun had by millions is available on Android, with new games and puzzles for fans old and new!\r\n\r\nDo you think you can handle any maze? Test your skill level on Ravensburger’s newest Android game, THE aMAZEing Labyrinth, as they celebrate its 25th anniversary.\r\n\r\nCompete against your friends, your enemies or even yourself to find the winning treasure pieces and escape the dreaded labyrinth. And this ain’t no ordinary maze! Hallways and junctions change with every turn, so keep your strategies open as you try to find your way around!\r\n\r\n\r\nFEATURES:\r\n\r\n✔Three single player modes:\r\n► Classic: The original labyrinth version with friends or alone against different-strength computer players\r\n► Puzzle: collect prizes in the shortest amount of moves possible to earn all diamonds and advance to the next level!\r\n► Time Duel: slide the puzzle pieces up and down to get your character across the board to the treasure. With every piece you get, you add just a little more time on the clock. Beat your personal best by seeing how many you can get to before the timer runs out!\r\n✔ Local and online multiplayer through Google Play Games. Play either the new Duel mode with friends and family, or the original Labyrinth mode for a more classic game.\r\n✔ Great HD graphics and animation\r\n✔ In-game manual to help aid novices and veterans alike\r\n✔ No set up, no clean up!\r\n✔ Great fun with family and friends!\r\n\r\n\r\nBecome a fan of Ravensburger Digital onand find out more about our new apps, exclusive competitions and behind the scenes information about the development of our apps:\r\n\r\n\r\nWhat's new:\r\nFixed a rare crash when computer/ai had to find the same treasure as the user and if the user already picked up the treasure.\r\n\r\nRequires Android OS: 4.0+","torrent":{"xt":"urn:btih:154ec033dbaf78b77adeee157fff54140c8d27c5","amp;dn":"THE+aMAZEing+Labyrinth+v1.0.2+full","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"154ec033dbaf78b77adeee157fff54140c8d27c5","infoHashBuffer":{"type":"Buffer","data":[21,78,192,51,219,175,120,183,122,222,238,21,127,255,84,20,12,141,39,197]},"announce":[],"urlList":[]}}