{"title":"Communism: A Very Short Introduction","uid":8888040,"size":2000485,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:158be7c78c6aebb3d41db3fb754c0bd9f0b80a45&amp;dn=Communism%3A+A+Very+Short+Introduction&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"tmPhoneix","files":1,"time":1378512479,"description":"Description:\n\nIf now in decline since the tumultuous events of 1989, communism was without doubt the great political movement of the twentieth century--at its peak, more than a third of the world's population lived under communist rule--and it is still a powerful force in many areas of the world, most notably in the People's Republic of China. What is communism? Where did the idea come from and what attracted people to it? Is there a future for communism? This Very Short Introduction considers these questions and more in the search to explore and understand this controversial political force. Explaining the theory behind its ideology, and examining the history and mindset behind its political, economic and social structures, Leslie Holmes considers the evolution of communism from Marx's time, to its practice in the Bolshevik Revolution, to its collapse in 1989-91. Holmes highlights the inner dynamics, crises, and demise of communism as a global system, and introduces the major players in the communist world, including Marx, Lenin, Stalin, and Mao.","torrent":{"xt":"urn:btih:158be7c78c6aebb3d41db3fb754c0bd9f0b80a45","amp;dn":"Communism%3A+A+Very+Short+Introduction","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"158be7c78c6aebb3d41db3fb754c0bd9f0b80a45","infoHashBuffer":{"type":"Buffer","data":[21,139,231,199,140,106,235,179,212,29,179,251,117,76,11,217,240,184,10,69]},"announce":[],"urlList":[]}}