{"title":"Gor - 02 - Outlaw of Gor","uid":9808364,"size":248443932,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:15f2b3d638a4c088e6eed583c8f830357872ea16&amp;dn=Gor+-+02+-+Outlaw+of+Gor&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"austech","files":30,"time":1395488841,"description":"\n\nJohn Norman - Outlaw of Gor  Book 2  \nNarrated by Ralph Lister    \nUnabridged \n64/44 m \n20% pars\nno repost\nLength: Approx. 8 hrs. 37 mins.\nFormat: Mp3 \n\n\nDescription:\n\n\nIn this second volume of the Gorean Series, Tarl Cabot finds himself transported back to Counter-Earth from the sedate life he has known as a history professor on Earth. He is glad to be back in his role as a dominant warrior and back in the arms of his true love. Yet, Tarl finds that his name on Gor has been tainted, his city defiled, and all those he loves have been made into outcasts. He is no longer in the position of a proud warrior, but an outlaw for whom the simplest answers must come at a high price. He wonders why the Priest Kings have called him back to Gor, and whether it is only to render him powerless.\n\nThe first novel in John Norman's Counter-Earth Series, &quot;Tarnsman of Gor,&quot; owed a debt to &quot;A Princess of Mars,&quot; the first John Carter novel by Edgar Rice Burroughs. Both of the second novels in these series begin the same way, with the hero finally able to return to the distant planet where they can begin to search for the great love of their life. But after the beginning of &quot;Outlaw of Gor&quot; Norman abandons the parallels to Burroughs and starts to build on the elements introduced in the first novel to create his own unique world.\n\n\n\n&quot;Outlaw of Gor&quot; offers a radical reintroduction to the world of Gor. Tarl Cabot is returned to the Counter-Earth seven long years after he left, only to discover that his City-State of Ko-ro-ba has been ordered destroyed by the mysterious Priest-Kings. Just as no two stones of the city are allowed to stand together neither can two citizens of the city. An Initiate, one of those who serves the Priest-Kings, orders Cabot to submit to their will, but he refuses, and heads off across Gor for the Sardar Mountains, the legendary home of the Priest-Kings. Along the way he walks into Tharna, a town ruled by women. The head woman is called the Tatrix and the ruling class of women wear silver masks. The society is sterile and unproductive and although they try to break Cabot to their will, they are not going to have any more success than the Priest-Kings.\n\nFor me &quot;Outlaw of Gor&quot; is the weakest of the early Counter-Earth novels, mainly because Cabot's adventures in Tharna are a detour on his war to the Sardar Mountains. My best advice is to have the third novel, &quot;The Priest-Kings of Gor&quot; on hand so that as soon as you finish this one you can start the next book, especially since this is one of the rare times in the Gor series that the next novel pretty much picks up right where the previous one leaves off. For me these second and third novels are essentially one giant story.\n\nHowever, from the perspective of the Gorean philosophy (i.e., way of life) developed by Norman (the pseudonym of philosophy professor John Lange), &quot;Outlaw of Gor&quot; is clearly the most important of the early novels. The novel was written in 1967, a time when the feminist movement was beginning to take shape, and it is easy to read &quot;Outlaw of Gor&quot; as something of a response to the times that were a-changin'. A city run by women is seen as being unnatural, and Norman begins to expand on some of the key elements of the Gorean philosophy: the concept of honor and the importance of the Home Stone, the dangers of technology versus respect for the environment, and the independence of men and the &quot;truth&quot; of female slavery. At this point in the series Norman is clearly courting controversy.\n\nOf course, for many potential readers of this series, this is a make-or-break proposition. I preferred the adventure aspects of the Gor novels and abandoned the series in the early 1980s when I found myself flipping through the long discussions on &quot;slavery&quot; that were becoming omni-present in the books. I was also dismayed that other characters besides Tarl Cabot were becoming the focus of the book and the giant story arc regarding the Priest-Kings was becoming increasingly prolonged (and often ignored). But in terms of sword and sorcery novels, Norman's first half-dozen Gor novels create a unique barbaric world and his characterization of supporting characters improves with every outing If you start the series, at least make it through &quot;Assassins of Gor,&quot; which I consider the apex of the series.\n\n","torrent":{"xt":"urn:btih:15f2b3d638a4c088e6eed583c8f830357872ea16","amp;dn":"Gor+-+02+-+Outlaw+of+Gor","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"15f2b3d638a4c088e6eed583c8f830357872ea16","infoHashBuffer":{"type":"Buffer","data":[21,242,179,214,56,164,192,136,230,238,213,131,200,248,48,53,120,114,234,22]},"announce":[],"urlList":[]}}