{"title":"Hamlyn Pictoral History 20th Century [v. 2]","uid":8784362,"size":268399656,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:169e90dd102134056b1c361518db55bb8497f834&amp;dn=Hamlyn+Pictoral+History+20th+Century+%5Bv.+2%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"magneez","files":1,"time":1375750163,"description":"This is an improved version of the DJVU for this wonderful (though somewhat angocentric) book. It was created using the layer separation methods outlined here &lt;a href=&quot;\nhttp://www.djvu-soft.narod.ru/scan/djvu_imager_en.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.djvu-soft.narod.ru/scan/djvu_imager_en.htm&lt;/a&gt;\n\nThat is, with Scan Tailor + DJVU imager. Everything was scanned at 600 dpi color, and the images were downscaled by BSF=3 (i.e. to 200 dpi). Text layer is monochrome 600 dpi. DJVU imager was used to combine the two. \n\n\nForeword  by \u001f\u001dAsa Briggs \n\u001f\u001dIt is now possible for the first time to have some idea of the \nshape of the twentieth century. As it draws to its close, decades \nfall into place. There may still be surprises in store, but we can \nbegin to produce balance sheets of gains and losses and we can \ndiscern long-term trends that lead us into the future. \nMore of the history of this century has been recorded in pictures \nthan the history of any other century before it. The invention of \nthe motion picture in the late nineteenth century and of \ntelevision in our own century has revolutionised communication. \nThis volume presents a panorama of our century, focusing both \non events and on themes. Every picture tells a story. \nAs a result of the communications revolution - a continuing \nrevolution that is still barely through its first phases - many of \nthe pictures recording events in distant parts of the world were \ntransmitted instantaneously. They have become the staple of \nnews, news from all round the world. From our present vantage \npoint, however, we can convert news into history. We can know \nwhat happened next. This fascinating volume enables events to \nbe seen as sequences. It also relates one cluster of events to \nanother. In other words, it provides perspectives. \nThe main themes are clear. This has been a century of \nunprecedented change, much of it unanticipated, and not all the \nchanges have been easily acceptable. Some of them have met \nwith resistance. The map of the world has changed as old \nempires have broken up and new nations have been created. \nMuch of the change has been the result of war, world war and \nlocal war. Y et there has been a powerful technological thrust \nbased on science. Ours is the century of the computer. It is \nalready difficult to conceive of life without it. \nA greater global sense has at last come to be associated with a \nconcern for what is happening to the planet, and we know far \nmore about how our planet is related to other planets than our \nancestors did. The concern, ecological and environmental, \ndistinguishes us from our recent ancestors, but it is still not \nstrong enough to save us from disaster and destruction. \nMany questions will be provoked by the material set out in the \npages that follow. Why do we have so many problems? What has \nbeen the role of leadership in the twentieth century? What \nhappened to ethics and to religion? What are the limits to \npolitical- and to economic - progress? Will science, which has \nsaved life and raised expectations, continue to threaten \ndestruction? \nFor every question there will be different answers. History does \nnot provide single answers: it is an invitation to intelligent and \ninformed argument. This book is valuable not only because it \nprovides indispensable information, but because it opens up \ndebate. \n\n","torrent":{"xt":"urn:btih:169e90dd102134056b1c361518db55bb8497f834","amp;dn":"Hamlyn+Pictoral+History+20th+Century+%5Bv.+2%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"169e90dd102134056b1c361518db55bb8497f834","infoHashBuffer":{"type":"Buffer","data":[22,158,144,221,16,33,52,5,107,28,54,21,24,219,85,187,132,151,248,52]},"announce":[],"urlList":[]}}