{"title":"Irene Huss (NLsubs)(DVD 1 v 3  ) TBS B-SAM","uid":6948585,"size":4636200553,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:16f2ac54cf2047c0b1dfeafa4f3366e21fadbe89&amp;dn=Irene+Huss+%28NLsubs%29%28DVD+1+v+3++%29+TBS+B-SAM&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Mad_Parrot","files":-1,"time":1326319124,"description":"\nIrene Huss dvd 1 (1 van 3)  \n\nIrene Huss - Tatuerad torso  en  Irene Huss - Den krossade tanghÃƒÂ¤sten\n\n\n\n\n\nNederlands:\n\nNieuwe uiterst spannende Zweedse crimeserie, gebaseerd op de boeken van Helene Tursten. \nIrene Huss wordt de vrouwelijke tegenhanger van Kurt Wallander genoemd, de hoofdpersoon in de misdaadromans van Henning Mankell. \nHuss is een veertigjarige inspecteur, ze is gelukkig getrouwd, heeft een zwarte band in jiu-jitsu en werkt al heel wat jaren bij de politie. \nToch komt ze nog altijd collega\\'s tegen die niet zo blij zijn met vrouwen bij het corps. \n\n\nIrene Huss - Tatuerad torso:\n\nEen ochtend in mei: In Goteborg wordt in plastic verpakt een aangespoeld lijk gevonden; een gruwelijk verminkt lichaam. \nWie is dit slachtoffer van een ziek misdrijf. \nHet enige spoor is een bijzondere en exotische tatoeage op de schouder. \nDit aanknopingspunt leidt inspecteur Irene Huss naar Kopenhagen waar twee jaar geleden een prostitue onder gelijke omstandigheden om het leven werd gebracht.\nWanneer er nog meer moorden plaatsvinden volgt de ene gebeurtenis op de andere en de jonge Huss staat voor raadsels. Het bloederige spoor van de seriemoordenaar brengt Huss in een wereld van leugens en valse beloftes. \nVastgelopen in het onderzoek gelooft ze dat de moordenaar, als een schaduw, zijn hielen heeft gelicht en voor altijd buiten schot blijft. \n\n\nIrene Huss - Den krossade tanghÃƒÂ¤sten:\n\nOp een regenachtige novemberdag maakt Richard Von Knecht, de rijkste man van GÃƒÂ¶teborg, een dodelijke smak van zijn balkon. \nIs er sprake van zelfmoord of heeft iemand hem van het balkon geduwd?\nZijn dood wordt gevolgd door andere incidenten. \nZijn schoonmaakster blijkt spoorloos te zijn verdwenen. \nEr ontploft een bom in zijn kantoor. \nBij Von Knecht wordt ook een hoofdwond ontdekt die niet door de val veroorzaakt kan zijn. \nDe politie twijfelt niet meer: de moordzaak is een feit.\n\nDe weduwe plengt nauwelijks een traan, de overlijdensverzekering zal immers veel geld uitkeren. \nZoon Henrik en zijn knappe vrouw Charlotte zijn evenmin erg aangedaan. \nMaar dan blijkt dat Von Knecht nÃƒÂ³g een zoon had...\nHet onderzoek voert het team van Irene Huss van de rijke zakenwereld naar de onderwereld van drugs en Hells Angels.\n\n\n\n\nEngels:\n\nIrene Huss - Tatuerad torso:\n\nOne morning in May: In Goteborg is wrapped in plastic found a corpse washed up, a horribly maimed body.\nWho is the victim of a sick crime.\nThe only trace is a special and exotic tattoo on the shoulder.\nThis clue leads Inspector Irene Huss to Copenhagen two years ago under similar circumstances a prostitute was brought to life.\nIf there are more murders occur following one event to another and the young Huss stands for riddles. The bloody trail of the serial killer Huss brings a world of lies and false promises.\nStuck in the research she believes the killer, like a shadow, has lifted his heels and remain forever out of reach.\n\n\nIrene Huss - Den krossade tanghÃƒÂ¤sten:\n\nA man jumps from a balcony and dies. His terrified wife witnesses the event in a nearby taxi cab. \nOnce Irene Huss arrives on the scene, it soon turns out that what appeared to be a tragic suicide is actually a brutal murder, \nand the victim is one of Gothenburg\\'s wealthiest men. \nWhen it becomes clear that a biker gang is involved, the investigation gets even more complicated and Irene finds herself tracking down a \nshrewd and dangerous murderer among ex-millionaires, motorcycle gangs, drug-dealers and blackmailers. \nAt the same time, she has to deal with everyday life and a teenage daughter who has decided to join a gang of skinheads with Neo-Nazi tendencies.\n\n\n   \n\n\nSpotinformatie \n\nCategorie     : Beeld \nFormaat       : DVD5 \nBron          : Retail\nMenu          : Ja\nAudio         : Zweeds\nExtra\\'s       : Ja , trailers\nOndertitels   : Nederlands (instelbaar)\nCover &amp; label : Beperkt\nGenre         : Action Crime\n\n &lt;a href=&quot;\nhttp://www.bol.com/nl/p/dvd/irene-huss/1002004006495489/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.bol.com/nl/p/dvd/irene-huss/1002004006495489/index.html&lt;/a&gt;\n\n &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/53536&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/53536&lt;/a&gt;\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0940780/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0940780/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0907303/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0907303/&lt;/a&gt;\n\n\n\n\nVerrast???? \n\n\nKom eens kijken bij \n\n\n\nhttp:black-sam.org","torrent":{"xt":"urn:btih:16f2ac54cf2047c0b1dfeafa4f3366e21fadbe89","amp;dn":"Irene+Huss+%28NLsubs%29%28DVD+1+v+3++%29+TBS+B-SAM","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"16f2ac54cf2047c0b1dfeafa4f3366e21fadbe89","infoHashBuffer":{"type":"Buffer","data":[22,242,172,84,207,32,71,192,177,223,234,250,79,51,102,226,31,173,190,137]},"announce":[],"urlList":[]}}