{"title":"Interconnecting Cisco Network Devices, ICND1 (640-802) [PDF]","uid":8285419,"size":4445792,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:17b9d569bc821d77f30a3395e219a58bc7814be7&amp;dn=Interconnecting+Cisco+Network+Devices%2C+ICND1+%28640-802%29+%5BPDF%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"theBooks","files":-1,"time":1363932064,"description":"Interconnecting Cisco Network Devices, Part 1 (ICND1): CCNA Exam 640-802 and ICND1 Exam 640-822 (2nd Edition)\n\nAuthor(s): Stephen McQuerry\nPublisher: Cisco Press\nDate: 2008\nPages: 518\nFormat: PDF\nLanguage: English\nISBN-10: 1587054620\nISBN-13: 978-1587054624\nSize: 4.34 MB\n\n----------------------------------------------------------------------------------\n----------------------------------------------------------------------------------\n\nDescription:\n\n----------------------------------------------------------------------------------\n----------------------------------------------------------------------------------\n\nInterconnecting Cisco Network Devices, Part 1 (ICND1), Second Edition, is a CiscoÂ®-authorized, self-paced learning tool for CCENTâ„¢ and CCNAÂ® foundation learning. This book provides you with the knowledge needed to configure Cisco switches and routers to operate in corporate internetworks. By reading this book, you will gain a thorough understanding of concepts and configuration procedures required to build a multiswitch, multirouter, and multigroup internetwork that uses LAN and WAN interfaces for the most commonly used routing and routed protocols.\n\nIn Interconnecting Cisco Network Devices, Part 1 (ICND1), you will study installation and configuration information that network administrators need to install and configure Cisco products. Specific topics include building a simple network, Ethernet LANs, wireless LANs (WLANs), LAN and WAN connections, and network management. Chapter-ending review questions illustrate and help solidify the concepts presented in the book.\n\nWhether you are preparing for CCENT or CCNA certification or simply want to gain a better understanding of how to build small Cisco networks, you will benefit from the foundation information presented in this book.\n\nInterconnecting Cisco Network Devices, Part 1 (ICND1), is part of a recommended learning path from Cisco that includes simulation and hands-on training from authorized Cisco Learning Partners and self-study products from Cisco Press.\n\nSteve McQuerry, CCIEÂ® No. 6108, is a consulting systems engineer with Cisco. He focuses on data center architecture. Steve works with enterprise customers in the Midwestern United States to help them plan their data center architectures. Steve has been an active member of the internetworking community since 1991 and has held multiple certifications from Novell, Microsoft, and Cisco. Prior to joining Cisco, Steve worked as an independent contractor with Global Knowledge where he taught and developed coursework around Cisco technologies and certifications.\n\n* Understand the principles on which basic networks operate\n* Explore the operation and configuration of LANs\n* Extend the boundaries of the network by implementing and securing wireless connectivity\n* Configure routers to provide connectivity between different networks\n* Learn about IP addressing number conversion\n* Establish WAN interconnectivity using point-to-point links, DSL, and cable services\n* Configure Network Address Translation (NAT)\n* Use Cisco IOSÂ® commands to determine the layout of a Cisco network topology\n* Manage the router startup and work with IOS configuration files and Cisco IOS images\n\nThis volume is in the Certification Self-Study Series offered by Cisco PressÂ®. Books in this series provide officially developed self-study solutions to help networking professionals understand technology implementations and prepare for the Cisco Career Certifications examinations.\n\nCovers: ICND1 Exam 640-822.\n\n----------------------------------------------------------------------------------\n----------------------------------------------------------------------------------\n\nAbout the Author:\n\n----------------------------------------------------------------------------------\n----------------------------------------------------------------------------------\n\nSteve McQuerry, CCIE No. 6108, is a consulting systems engineer with Cisco focused on data center architecture. Steve works with enterprise customers in the midwestern United States to help them plan their data center architectures. Steve has been an active member of the internetworking community since 1991 and has held multiple certifications from Novell, Microsoft, and Cisco. Prior to joining Cisco, Steve worked as an independent contractor with Global Knowledge, where he taught and developed coursework around Cisco technologies and certifications.\n\n----------------------------------------------------------------------------------\n----------------------------------------------------------------------------------\n\nNo Password or Surveys. Guaranteed!!!\n\nPlease seed the torrent if you want to Help :)\n\n----------------------------------------------------------------------------------\n----------------------------------------------------------------------------------","torrent":{"xt":"urn:btih:17b9d569bc821d77f30a3395e219a58bc7814be7","amp;dn":"Interconnecting+Cisco+Network+Devices%2C+ICND1+%28640-802%29+%5BPDF%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"17b9d569bc821d77f30a3395e219a58bc7814be7","infoHashBuffer":{"type":"Buffer","data":[23,185,213,105,188,130,29,119,243,10,51,149,226,25,165,139,199,129,75,231]},"announce":[],"urlList":[]}}