{"title":"19 CD Jazz FLAC Collection [EAC Secure Rip] Inc. RVG Remasters","uid":4872686,"size":5288147537,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:1814d3b2d95a62c84f461ebf356cace06ff440a4&amp;dn=19+CD+Jazz+FLAC+Collection+%5BEAC+Secure+Rip%5D+Inc.+RVG+Remasters&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"laterthannever","files":308,"time":1240928918,"description":"You want more? You got it!\n\nPresenting to you is the Ultimate Jazz FLAC Collection Pt 2. This is by no means any sort of &quot;ultimate collection&quot;, but it's definately an extention of the original torrent which can be found here:\n\n\n\nThis time around, I've gone ahead and ripped everything using Secure Mode in EAC (due to demand). Logs of the rip have been included. And just like last time there are full, complete high quality scans of the linear notes presented in 200 dpi.\n\nI'm sorry, but there are no cue files included. This is my first time using EAC and had a hard enough time trying to configure it. I looked all over google, but I can't figure out a way to create a cue list without having it aim at the .wav files that have been converted over to flac. If anyone wants to school me one time into having the program configured correctly so I can do a proper release, feel free to let me know.\n\n\nOtherwise, for now - enjoy this small tidbit of jazz. For my next upload, I'm going to be shooting for some more of the avant-garde free-jazz sounds. Who knows though, I may suprise ya.\n\nLike always, do me a favor and seed to at least 1.0, please! I'm a bit disappointed that I only have 10 seeders for the 20+ gig jazz torrent I originally uploaded while there are 50+ leechers trying to retrieve it.\n\nUntil next time, cats and kitties!\n\n\n\nArt Blakey &amp; The Jazz Messengers - Caravan\n\nArt Blakey &amp; The Jazz Messengers - Moanin' (Rudy Van Gelder Edition)\n\nBud Powell - The Amazing Bud Powell: Volume One (Rudy Van Gelder Edition)\n\nCharles Mingus - The Black Saint and the Sinner Lady\n\nColeman Hawkins - Body &amp; Soul\n\nColeman Hawkins - The Hawk Relaxes (Rudy Van Gelder Remaster)\n\nGrant Green - Green Street (Rudy Van Gelder Edition)\n\nGrover Washington Jr - Feels So Good\n\nGrover Washington Jr - Mister Magic\n\nHerbie Hancock - Empyrean Isles (Rudy Van Gelder Edition)\n\nIke Quebec - Bossa Nova Soul Samba (Rudy Van Gelder Edition)\n\nJohn Coltrane &amp; Johnny Hartman\n\nJohnny Griffin - Introducing (Rudy Van Gelder Edition)\n\nLee Morgan - Delightfulee (Rudy Van Gelder Edition)\n\nLee Morgan - Volume 2: Sextet (Rudy Van Gelder Edition)\n\nLee Morgan - Volume 3 (Rudy Van Gelder Edition)\n\nMedeski, Martin &amp; Wood - Bubblehouse\n\nMiles Davis - Bag's Groove (Rudy Van Gelder Remaster)\n\nWes Montgomery - Boss Guitar\n","torrent":{"xt":"urn:btih:1814d3b2d95a62c84f461ebf356cace06ff440a4","amp;dn":"19+CD+Jazz+FLAC+Collection+%5BEAC+Secure+Rip%5D+Inc.+RVG+Remasters","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1814d3b2d95a62c84f461ebf356cace06ff440a4","infoHashBuffer":{"type":"Buffer","data":[24,20,211,178,217,90,98,200,79,70,30,191,53,108,172,224,111,244,64,164]},"announce":[],"urlList":[]}}