{"title":"Yoga Journal USA - October 2012 (gnv64)","uid":7690985,"size":47100997,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1940fe27196fff490efd379d05e200bd128d5a13&amp;dn=Yoga+Journal+USA+-+October+2012+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gnv65","files":-1,"time":1349092196,"description":"Yoga Journal USA - October 2012\nEnglish | PDF | 128 pages | 44.9MB\n\nYoga Journal is an American based media company that publishes a magazine, a website, DVDs, and puts on conferences all devoted to yoga, food and nutrition, fitness, wellness, and fashion and beauty.\n\nCONTENTS\non the cover (Cover Model: Djuria Mascall)\n71 | Boost your energy with a power flow practice\n82 | Tension-free neck and shoulders! 23 simple moves to relieve aches &amp; pains\n64 | 1 pose to inspire joy in your heart\n59 How to feel better when things don't go your way\n51 | 3 twists to open your chest and release your spine\n28 Best breakfasts for all-day stamina\n\nfeatures\n74. | PLEASURES OF THE TABLE\nInnovative, sustainable, vegetarian cuisine is all the rage in the yoga world. These five restaurants serve great food you can feel good about eating, bv Dayna Macv\n82 | UPWARDLY MOBILE\nTransform tight, tense, or achy neck &amp; shoulders with this dynamic hands-free vinyasa sequence, by Leslie Kaminoff\n88 | ON YOUR MAT, GET SET GO!\nIn a schoot that's loaded with pressure, a yoga program Is helping kids manage their stress and cultivate tenacity, ultimately setting the stage for a happy successful future, by Andrea Ferrettr\n\npractice\n51 | ALIGN + REFINE\nA new twist on twists Head to the wall for deeper twists that can lengthen and open up your front body, by Jason Crandel!\n59 | LIVING YOGA\nLife happens Sometimes things donrt go your way. But understanding the causes of suffering can help you meet life's challenges with equanimity, by Kate Holcombe\n64 | CHALLENGE POSE\nFly high Let yourself be an expression of joy and beauty as you open your heart in Vasisthasana. by Kathryn Budig\n71 | HOME PRACTICE WITH BARON 8APTISTE\nReady for liftoff Stoke your inner fire to infuse your whole being with strength and vitality.\n\nyoga lifestyle\n21 | OM\nBringing your practice to life with meal blessings; nnat-to-tabfe dinners; in-school yoga; healing breathing practices power foods; asana for trail runners.\n36 | STYLE\nWarm &amp; dry Embrace fall weather with boots, sweaters, and cozy tunics.\n41 | EATING WISELY Hands on Easier on the host than a dinner party and more fun than a potluc cooking parties invite everyone into the kitchen, by Linda Lau Anusasananan\n95 | REVIEWS\nNew books, CDs, and DVDs, including a Q&amp;A with Kelly McGonigal; pregnancy preps; asana and meditation pairing.\n124 | YOGA SCENE\nSeason of change A reader taps into nature's energy shifts and is reminded of the changes in her own practice.\n\nin every issue\n12 | EDITOR'S LETTER\n119 | YOGA PAGES\n14 | CONTRFBUTORS\n122 | LIVING WELL\n16 | LETTERS\n122 | CLASSIFIEDS","torrent":{"xt":"urn:btih:1940fe27196fff490efd379d05e200bd128d5a13","amp;dn":"Yoga+Journal+USA+-+October+2012+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1940fe27196fff490efd379d05e200bd128d5a13","infoHashBuffer":{"type":"Buffer","data":[25,64,254,39,25,111,255,73,14,253,55,157,5,226,0,189,18,141,90,19]},"announce":[],"urlList":[]}}