{"title":"MechWarrior Quadrology (Eng/Rus) [RePack] RG Catalyst","uid":8776173,"size":3851167299,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:1a139318faa15f4ab5bf4b48735d43a531fbbe6d&amp;dn=MechWarrior+Quadrology+%28Eng%2FRus%29+%5BRePack%5D+RG+Catalyst&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"DMeTaLx","files":46,"time":1375560637,"description":"Once upon a time in the distant future, mankind is tired killed by tanks, planes and sapper shovels. In addition to the primitive tools of high-tech engineering idea gave birth to combat robots - Mech. Multi-ton Titans running brave MechWarrior brought death and joy throughout the galaxy. Hearing the heavy tread of the fur, the enemy threw their heels (and if the pilot is a fool, and threw his heels). When the cars came together to battle the elements humbly died down, giving way to the terrifying power of the steel monsters. Fierce flashes of laser batteries, the thunder of explosions and bursts of automatic extravaganza repeatedly shook the earth and the sky. And after, was quiet and timid raindrops hopelessly frustrated by the steaming armor defeated the Giants. What a pity that such a nifiga you will not see. Well, as you see, no time will be. The briefing MechWarrior no point of admiring the rain. Battle, battle, battle.\n\nINFO:\nâ–ª Released: 1989/1993/1996 \nâ–ª Genre: Simulation, Sci-Fi, Mech \nâ–ª Developer: Dynamix / Beam Software / Tiburon Entertainment \nâ–ª Publisher: Activision\nâ–ª Language: English \nâ–ª Publication Type: RePack \nâ–ª Repack Version: 1.3.15 \nâ–ª No-CD: not required\n\nSYSTEM REQUIREMENTS (DOSBox / ZSNES): \nâˆš Operating system: Windows XP / Vista / 7 \nâˆš Processor: 500MHz \nâˆš Memory: 64 MB \nâˆš Video: With support for DirectX \nâˆš Sound Card: DirectX compatible \nâˆš Free hard drive space: really small\n\nDESCRIPTION:\nAs it became known to our agents from reliable sources (and reliable sources from Wikipedia) , the first game of the series MechWarrior (DOS / SNES) tells the story of a certain MechWarrior brutally avenging gibed someone out there for his family. Vendetta in the Battletech universe that still disassembly ... Provided purchase, modernization and utilization of stylish fur, mind-boggling 16-color graphics and a view from the dashboard with buttons. In the SNES version of the graphics pomodnee, by the way.\nMechWarrior 3050 (SNES), does not continue the story of noble revenge. This time the hero (and not the one and the other) riding on Robot Chicken on the side of the clans and disassemble the parts inventory of the Inner Sphere. A-ha-ha, here it is impossible to change the robot. But you can put different guns and look at voynushku in perspective. This game added to the assembly as a bonus, and directly related to the Quadrilogy is not.\n\nFeatures Repack:\nâ–ª MechWarrior Version: DOS / SNES / 3050 SNES\nâ–ª Do not cut / no precoded\nâ–ª Installation or use of established DOSBox / ZSNES emulation\nâ–ª Time: A couple of minutes\n\nINFO:\nâ–ª Year: 1995-1998 \nâ–ª Genre: Simulation, Sci-Fi, Mech \nâ–ª Developer: Activision \nâ–ª Publisher: Activision\nâ–ª Language: English \nâ–ª Language Voice: English \nâ–ª Publication Type: RePack \nâ–ª Repack Version: 1.4.24 \nâ–ª No- CD: CD-ROM drive emulation\n\nSYSTEM REQUIREMENTS:\nâˆš Operating system: Windows XP / Vista / 7 \nâˆš Processor: 100MHz \nâˆš Memory: 32 MB \nâˆš Video: With support for DirectX \nâˆš Sound Card: DirectX compatible \nâˆš Free space on hard disk: 0.5 GB for games + 1.2 GB for audio images CD (if necessary)\n\nDESCRIPTION:\nSenses, the earth trembles and lemmings gleefully preparing to group suicide? .. On the horizon, there were huge fighting robots! Proud heavy tread of the second part of MechWarrior is in our home ... Blows ... bearing walls, floors, and crushes out from the back side ... \nYou still remember the 16-colored beauty of the first part? Do not cry tears of blood, it was not so bad. So, now it's much better. Even under DOS new technologies give heat. And under vindosom and that's Tale - textures, dynamic lighting, 3D acceleration, mouse, after all. And then there are the sounds of music and movies ... Really, gentlemen, a complete delight! \nToday we happen to make war on the side of the warring clans Wolf and Falcon commit massacres in the name of the Ghost Bear and even feel like a mercenary, fighting for the voiceless loans. New battles, new feeling - a good old BattleTech!\nYou are not enthusiastic? Lemmings are collected from the nearest cliff - go ahead after!\n\nFeatures Repack:\nâ–ª It is based on Titanium Trilogy: 31st Century Combat, Ghosy Bear's Legacy, Mercenaries\nâ–ª Includes workers NetMech &amp; MercNet\nâ–ª Do not cut / no precoded\nâ–ª Includes WIN and DOS versions\nâ–ª In the WIN version used fixes to work with WinXP\nâ–ª Installation or use of installed DOSBox / Daemon Tools Lite to emulate\nâ–ª Optional use of the original audio CD tracks (through images)\nâ–ª May not download files: dat3.catalyst - images of audio CD\nâ–ª Time: 5 minutes\nâ–ª Free RAM required for installation: 128 MB\n\nINFO:\nâ–ª Released: 1999 (Gold Edition 2002) \nâ–ª Genre: Simulation, Sci-Fi, Mech \nâ–ª Developer: Zipper Interactive \nâ–ª Publisher: Microprose\nâ–ª Game Version: 1.2 MW3 / PM 1.0\nâ–ª Language: English / Russian \nâ–ª Language Voice &amp; Video : English / Russian \nâ–ª Publication Type: RePack \nâ–ª repack Version: 1.3.25 \nâ–ª No-CD: No-CD Fix / CD drive emulation\n\nSYSTEM REQUIREMENTS:\nâˆš Operating system: Windows XP / Vista / 7 \nâˆš Processor: 166MHz \nâˆš Memory: 32 MB \nâˆš Video: 2MB with support DirectX6 \nâˆš Sound Card: DirectX compatible \nâˆš Free hard drive space: 900 MB to 120 MB + games on images of an audio CD (if necessary)\n\nDESCRIPTION:\nSo, we meet the third part of the series. The plot is voenoperatsiya Inner Sphere against Clan Smoke Jaguar. Cat's eager for a refreshing cuffs, whom the soldiers are ready to free pour Areas. The guns loaded, the pilots helmets - formidable troops ready zhahnut on the surface of the planet ... As suddenly takes an unexpected turn and the scenario of a powerful strike force is zilch and a column of smoke. Zilch but also no fool, and that you will clearly prove. \ncomplement to the scene Pirate's Moon even more fun. Here you can feel yourself as a pirate on the fur with a wooden leg and a side matershinnika. And you can, and vice versa - nakostylyat filibuster on prostheses. At the expense of wooden parts, of course, lied, but cheerfulness zavarushek it does not detract. \nVisual supply compared to previous installments, too happy. Even today, the picture on the screen and dvizhuha happy (and tomorrow it will not be worse - tomorrow only gamer zazhretsya more) different weather conditions, atmospheric lighting, shadows, detailed animations and other goodies. How cool in the first mission zhahnut laser on the perekatipolyu, turning it into a glowing ball of ... Or &quot;accidentally&quot; step on Drapano HomoSapiens ... Raskhrenyachit in chips fishing village ... And flop hot metal from the firing backwards into the lake, floating circles ... Romance!\nJust one problem - on modern piece of iron is a miracle no matter what tricks can work out very badly ...\n\nFeatures Repack:\nâ–ª It is based on Gold Edition: MechWarrior 3 Pirate's Moon\nâ–ª Translations of text: English., 7 Wolf, WebColl (only campaign MW3), ZoG * when choosing a translation 7Volk/WebColl installed version 1.0 MW3\nâ–ª Voice &amp; Video: Eng, 7 Wolf, WebColl (only campaign MW3)\nâ–ª Cut out the sounds of medium &amp; low quality / no recoded\nâ–ª Installation or use of installed Daemon Tools to emulate\nâ–ª Optional use of the original audio CD tracks (through images)\nâ–ª May not download files: dat3.catalyst - Images Audio CD â–ª rus1.catalyst - Russian text, rus2.catalyst - Russian voice\nâ–ª Installation time: 5 minutes\nINFO:\nâ–ª Released: 2000/2001/2002 \nâ–ª Genre: Simulation, Sci-Fi, Mech \nâ–ª Developer: Fasa Interactive \nâ–ª Publisher: Microsoft\nâ–ª Game Version: Veng - P3 / BK - P1 / Mercs - PR1\nâ–ª Language: English / Russian \nâ–ª Language Voice &amp; Video: English \nâ–ª Publication Type: RePack \nâ–ª repack Version: 1.2.10 \nâ–ª No-CD: No-CD Fix\n\nSYSTEM REQUIREMENTS:\nâˆš Operating system: Windows XP / Vista / 7 \nâˆš Processor: 300MHz \nâˆš Memory: 64 MB \nâˆš Video: 8MB to support DirectX6 \nâˆš Sound Card: DirectX compatible \nâˆš Free hard drive space: up to 2.75 GB for the game plus about 630 MB for temporary files\n\nDESCRIPTION:\nWar! The war on Kentarese IV! The Civil War, citizens! \nDuke Eric Drezari was treacherously overturned the throne of his niece with an army of accomplices. Rightful heir to Ian Drezari angry! Resistance forces it seeks to overthrow the adversary and desperately pratizanit. But pratizany on furs are not placed in the dugouts, so the war is going to be spectacular. Viva la resistance! Give us a Vengeance! \nafter civil warfare story does not end there - add Black Knight offers perementutsya on the side of the Legion of mercenaries, and ears have to kick myself to Ian. Will there be that simple? .. And fuck you!\nAnd lastly, again mercenaries - Mercenaries. Enjoy free bread to the full: many planets and contracts, many furs and weapons - all that is necessary for a living! No need to pay taxes. Schasste!\nNeedless to say, that once again the picture got better? Probably. And that was the arcade gameplay? Valid. So what? It's nothing. We play.\n\nFeatures Repack:\nâ–ª In repack games include: Vengeance, Black Knight, Mercenaries\nâ–ª Optional installation MekPak'ov &amp; Hi-Res textures of fur MechStorm (Only for 32-bit systems)\nâ–ª Do not cut / no precoded\nâ–ª Translations of text: Vengeance/Black Knight : Eng., ZoG, unknown. + Triad â–ª Mercenaries: Eng., ZoG, Fargus, 8bit\nâ–ª Pirate translations modified to compatibility with the latest versions of games\nâ–ª To Russian translation replaced fonts for correct display of the Cyrillic\nâ–ª May not download files: dat4. Catalyst - Hi-Res textures, rus.catalyst - Russian translations\nâ–ª Time: 5 minutes\n","torrent":{"xt":"urn:btih:1a139318faa15f4ab5bf4b48735d43a531fbbe6d","amp;dn":"MechWarrior+Quadrology+%28Eng%2FRus%29+%5BRePack%5D+RG+Catalyst","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1a139318faa15f4ab5bf4b48735d43a531fbbe6d","infoHashBuffer":{"type":"Buffer","data":[26,19,147,24,250,161,95,74,181,191,75,72,115,93,67,165,49,251,190,109]},"announce":[],"urlList":[]}}