{"title":"The Gentle Waves - Swansong For You [2000][EAC,log,cue. FLAC]","uid":8246512,"size":222230080,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:1a38104f13190085f402fb44565d43e834a00bdc&amp;dn=The+Gentle+Waves+-+Swansong+For+You+%5B2000%5D%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":14,"time":1363072584,"description":"Artist: The Gentle Waves\nRelease: Swansong For You\nDiscogs: 390698\nReleased: 2000 / 2000-11-06\nLabel: Never Records / Jeepster Recordings\nCatalog#: NR 4051 / JPRCD 011\nFormat: FLAC / Lossless / Log (100%) / Cue / CD\nCountry: UK\nStyle: Rock, Soft Rock, Indie Rock\n\nTracklisting:\n\n01. Let The Good Times Begin (4:02)\n02. Partner In Crime (3:45)\n03. Falling From Grace (3:45)\n04. Loretta Young (3:03)\n05. Sisterwoman (3:00)\n06. Solace For Pain (2:49)\n07. Flood (3:35)\n08. Pretty Things (4:35)\n09. There's No Greater Gold (4:04)\n10. There Was Magic, Then... (3:31)\n\n\nSwansong for You picks up right where the debut The Green Fields of Foreverland left off, which is to say with more gentle waves of pure orchestral pop loveliness. All the same characterizations hold true. Isobel Campbell's compositions are hauntingly wistful and dreamy, with many of the same echoes from her work in Belle &amp; Sebastian and a plethora of nods to the softer strains of 1960s pop, while retaining a diffuse and ethereal haze, like the dew-dappled light of morning, or perhaps like Scottish winters. The music often sounds like a delicate web being torn apart, but even in its most hushed moments it teems with intensity. &quot;Falling From Grace&quot; and &quot;There Is No Greater Gold&quot; could have been pickpocketed directly off Margo Guryan's cult 1968 soft pop album, Take a Picture; Campbell's voice, in fact, is a dead ringer for Guryan's gossamer whisper -- singing that can hypnotize you. The same goes for the elegant and guileless bossa nova of &quot;Pretty Things,&quot; which covers in sweetness what it lacks in lyrical sophistication, as does the updated girl group ballad &quot;Flood.&quot; Campbell just as often recalls a female version of Nick Drake. It is a nearly empty comparison now, having been thrown in Belle &amp; Sebastian's direction literally dozens of times, not to mention attaching itself to every dour singer/songwriter and slowcore band of the '90s, but on the gorgeous &quot;Loretta Young,&quot; the influence of Five Leaves Left is unmistakable. A pair of musical anomalies, however, offers the album's most intriguing moments. &quot;Partner in Crime&quot; borrows a few melodramatic effects from &quot;The Little Drummer,&quot; especially the martial snare taps and the drawn-out narrative. It is really more of a short story than a song, filled with involved, poetic lines and a complete plot, while the album's centerpiece is the completely groovy, left field departure, &quot;Sisterwoman,&quot; which can only (though nervously) be classified as garage pop. Opening with a ridiculously simple beat and piano groove reminiscent of the Violent Femmes classic &quot;Raisin in the Sun,&quot; Campbell proceeds to layer on and incorporate fabulously unforeseen musical elements: rock &amp; roll rhythm guitar, Booker T. &amp; the MG's organ fills, incredible Stax-style horn charts. On top of it all, she gives a subtly campy vocal performance, at once recalling the Go-Go's and literal go-go singers of the '60s, specifically Nancy Sinatra, as well as British waifs like Lulu. It is unlike anything out of the Belle &amp; Sebastian catalog or, for that matter, anything recorded previously by the Gentle Waves. It doesn't entirely fit with the rest of the album in sound or spirit, but nevertheless displays a different side of Campbell and, hopefully, points to an avenue ripe for future exploration by this most delightful of side projects.","torrent":{"xt":"urn:btih:1a38104f13190085f402fb44565d43e834a00bdc","amp;dn":"The+Gentle+Waves+-+Swansong+For+You+%5B2000%5D%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1a38104f13190085f402fb44565d43e834a00bdc","infoHashBuffer":{"type":"Buffer","data":[26,56,16,79,19,25,0,133,244,2,251,68,86,93,67,232,52,160,11,220]},"announce":[],"urlList":[]}}