{"title":"The Science of the Swastika {BBS}","uid":6898669,"size":5535755,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1b789d421bc76f95db24d37ab91ec44e8c193b5c&amp;dn=The+Science+of+the+Swastika+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1324306412,"description":"This is the first theoretically informed study of the relationship between an academic discipline and what the Nazis termed their Weltanschauung. The first study of Sinnbildforschung, German ideograph or swastika studies, though more broadly it tells the tale of the development of German antiquarian studies (ancient Germanic history, archeology, anthropology, folklore, historical linguistics and philology) under the influence of radical-rightwing politics, and the contemporary construction of 'Germanicness' and its role in Nazi thought. The swastika and similar symbols were employed by the ancestors of the modern-day Germans. As these had also become emblematic symbols of the forces of German reaction, Sinnbildforschung became intrinsically connected with the National Socialist regime after 1933 and disappeared along with the Third Reich in 1945.With the Nazi seizure of power, ideographic studies became directly supported by the state. In 1935, an organization was founded within the SS to further its study, the SS-Ahnenerbe. Most infamous as the organ through which medical experiments were arranged to be performed on the inmates of concentration camps, the Ahnenerbe was founded as a historical research institution before it expanded its horizons to the physical sciences.\n\n\n# Hardcover: 363 pages\n# Publisher: Central European Univ Pr (November 2008)\n# Language: English\n# ISBN-10: 9639776181\n# ISBN-13: 978-9639776180","torrent":{"xt":"urn:btih:1b789d421bc76f95db24d37ab91ec44e8c193b5c","amp;dn":"The+Science+of+the+Swastika+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1b789d421bc76f95db24d37ab91ec44e8c193b5c","infoHashBuffer":{"type":"Buffer","data":[27,120,157,66,27,199,111,149,219,36,211,122,185,30,196,78,140,25,59,92]},"announce":[],"urlList":[]}}