{"title":"Runtime GetDataBack for FAT NTFS 3.50","uid":4357101,"size":5629457,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:1bec804a51ed1de7add32838dc2c3597fb66232e&amp;dn=Runtime+GetDataBack+for+FAT+NTFS+3.50&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Jodyanne","files":3,"time":1219460552,"description":"Screenshot: &lt;a href=&quot;\nhttp://jody.hopto.org/imagehost/images/jody/untimegetdatabackforfatntfs3.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://jody.hopto.org/imagehost/images/jody/untimegetdatabackforfatntfs3.jpg&lt;/a&gt;\n\nInfo:\nData Recovery Software - GetDataBack is a highly advanced data recovery software, which will help you to get your data back when your drive&amp;#039;s partition table, boot record, Master File Table or root directory is corrupt or lost, when a virus has hit the drive, files were deleted, the drive was formatted or struck by a power failure. GetDataBack comes in two flavours, NTFS and FAT depending on what file system you have.\n\nGetDataBack will recover your data if the hard drive&amp;#039;s partition table, boot record, FAT/MFT or root directory are lost or damaged, data was lost due to a virus attack, the drive was formatted, fdisk has been run, a power failure has caused a system crash, files were lost due to a software failure, files were accidentally deleted...\nGetDataBack can even recover your data when the drive is no longer recognized by Windows. It can likewise be used even if all directory information - not just the root directory- is missing. GetDataBack can even recover your data when the drive is no longer recognized by Windows. It can likewise be used even if all directory information - not just the root directory- is missing.\n\nThe tool works at partition level and will restore files and folders exactly how they used to be. It recovers data from floppy and ZIP disks, drive images and even remote drives connected by a serial cable or TCP/IP. As the name says, it restores files from FAT/ NTFS disks - file system used by Windows NT/2000/XP, yet works on all Windows systems. Make sure you never install the program on the to-be-recovered drive and you will never lose important data.\n\nAdvanced algorithms will make sure that all directories and sub directories are put together as they were, and that long file names are reconstructed correctly. GetDataBack is read-only, meaning the program will never attempt to write to the drive you are about to recover. Please make sure to read the safety instructions...\n\nThe software enables the regular user to conduct his own data recovery by guiding him through three easy to understand steps, thus gives the advanced user the possibility to interfere with the recovery and improve the results, by examining the scan log, the file system details, file and directory information, by selecting the sector range to be scanned, by choosing excessive search for file systems or search for lost files, by calling Runtime&amp;#039;s DiskExplorer.\n\nRecover files over your local network or over a serial cable - This feature enables you to run GetDataBack on one computer (&quot;remote&quot;) while accessing the drives of another computer (&quot;host&quot;). Recovering data over a network is useful, especially when you are not able to remove the drive you want to recover from and attach it to another computer.\n\nGetDataBack recovers from:\n* Hard drives (IDE, SCSI, SATA)\n* USB drives\n* Firewire drives\n* Partitions\n* Dynamic Disks\n* Floppy drives\n* Drive images\n* Zip/Jaz drive\n* Compact Flash Cards\n* Smart Media Cards\n* Secure Digital Cards\n* USB Flash Drive\n* iPod Disks","torrent":{"xt":"urn:btih:1bec804a51ed1de7add32838dc2c3597fb66232e","amp;dn":"Runtime+GetDataBack+for+FAT+NTFS+3.50","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1bec804a51ed1de7add32838dc2c3597fb66232e","infoHashBuffer":{"type":"Buffer","data":[27,236,128,74,81,237,29,231,173,211,40,56,220,44,53,151,251,102,35,46]},"announce":[],"urlList":[]}}