{"title":"Build the Ideal Bug Out Bag: The Ultimate Guide to Preparing a 7","uid":8232942,"size":115119,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1c23ab7ba54f6a886b59fa8ffeff927f712ec4b4&amp;dn=Build+the+Ideal+Bug+Out+Bag%3A+The+Ultimate+Guide+to+Preparing+a+7&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"DaRule762","files":-1,"time":1362768598,"description":"This Amazon Best Seller is perfect for anyone who is concerned about preparing for emergencies! We live in a world that if full of uncertainties. Whether it's a major natural disaster or a breakdown in civilized society, there's a very high likelihood that you may have to evacuate your home in a hurry someday. You never know when things are going to get so bad that you have to leave your home and seek shelter someplace safer. It could happen today!\n\nBuild The Ideal Bug Out Bag is written by Patty Hahne, the author of the popular book entitled Doomsday Prepping Crash Course: The Ultimate Preppers Guide to Getting Prepared When You're on a Tight Budget. She's also the owner of the emergency preparedness blog called PreppersIllustrated.com.\n\nThis book is packed with great information that will help prepare you to survive comfortably if you are ever forced to bug out and leave your home quickly.\n\nInside this book you'll learn:\n\n    What it means to bug out and why you might be forced to.\n    What a bug out bag is and how it's used.\n    How to select the right kind of bag to make the ideal bug out bag.\n    What the essential items for any bug out bag are and why you'll need them.\n    How to pack a bug out bag correctly so that it's easy to carry.\n    How to make sure that you have everything you need to survive comfortably when you bug out.\n    ...and much more!","torrent":{"xt":"urn:btih:1c23ab7ba54f6a886b59fa8ffeff927f712ec4b4","amp;dn":"Build+the+Ideal+Bug+Out+Bag%3A+The+Ultimate+Guide+to+Preparing+a+7","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c23ab7ba54f6a886b59fa8ffeff927f712ec4b4","infoHashBuffer":{"type":"Buffer","data":[28,35,171,123,165,79,106,136,107,89,250,143,254,255,146,127,113,46,196,180]},"announce":[],"urlList":[]}}