{"title":"Ruth Warburton: The (Witches) Winter Trilogy (YA) -  Barbie1710","uid":8221935,"size":5969425,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1c4e778eddca31e61faa1c448d203f7c0ef78658&amp;dn=Ruth+Warburton%3A+The+%28Witches%29+Winter+Trilogy+%28YA%29+-++Barbie1710&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Barbie1710","files":16,"time":1362496413,"description":"Ruth Warburton: The (Witches) Winter Trilogy (YA) - Kindle &amp; ePub - Barbie1710\n\nAZW3, EPUB, MOBI\n\n\nA Witch in Winter\nAnna Winterson doesn't know she's a witch and would probably mock you for believing in magic, but after moving to the small town of Winter with her father, she learns more than she ever wanted to about power. When Anna meets Seth, she is smitten, but when she enchants him to love her, she unwittingly amplifies a deadly conflict between two witch clans and splits her own heart in two. She wants to love Seth, to let him love her - but if it is her magic that's controlling his passion, then she is as monstrous as the witch clan who are trying to use her amazing powers for their own gain. When love is tangled up in magic, how can you be sure what's real?\n\n\nA Witch in Love\nAnna still finds it hard to believe that Seth loves her and has vowed to suppress her powers, no matter what. But magic - like love - is uncontrollable and soon, Anna is being hunted. Abe wants Anna to embrace her power, while Seth is pushing Anna to accept that his feelings are real. She finally does ... a moment too late. Suddenly, it's like the Salem witch trials all over again: burnings, torture and faceless judgements. In the face of the ultimate betrayal, who will save her?\n\n\nA Witch Alone\nWhere do you go when your heart has been ripped out? For Anna there is only one answer; into her past, where the truth about her mother, her power, and her real identity lie hidden. But as Anna delves deeper into her history, she begins to fear that the truth about what set her mother running may be darker than she ever suspected. With the witches of the world on the brink of war, the love of her life, Seth, gone and her closest friend, Abe, wanting more from her than she can possibly give, Anna is in crisis. Ultimately she will have to choose between friends, family and rival tribes of witches and - at the last - between love and magic.\n\n\nThis is a multi-tracker torrent.  Please check your Bit-Torrent client for the true number of seeds.  Enjoy &amp; Please Seed","torrent":{"xt":"urn:btih:1c4e778eddca31e61faa1c448d203f7c0ef78658","amp;dn":"Ruth+Warburton%3A+The+%28Witches%29+Winter+Trilogy+%28YA%29+-++Barbie1710","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c4e778eddca31e61faa1c448d203f7c0ef78658","infoHashBuffer":{"type":"Buffer","data":[28,78,119,142,221,202,49,230,31,170,28,68,141,32,63,124,14,247,134,88]},"announce":[],"urlList":[]}}