{"title":"EnigmaT Set Rips { Cuts } - August 27th, 2013","uid":8853994,"size":926439971,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:1c895aef8ba163057561ec16603b101d214614d2&amp;dn=EnigmaT+Set+Rips+%7B+Cuts+%7D+-+August+27th%2C+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"EnigmaT","files":79,"time":1377602579,"description":"Aero - Space Flow (Cut From GO Set)-enTc.mp3\nAerosoul - Strings Theory (Original Balearic Mix) (Cut From Myon Set)-enTc.mp3\nAhmed Romel &amp; Tonny Nesse - Alva (Intro Mix) (Cut From A&amp;F Set)-enTc.mp3\nAiden Arie - L'espoir (Ico Remix) (Cut From Random X Set)-enTc.mp3\nAlan Crown &amp; Binary Finary - Cielo (Original Mix) (Cut From Binary Set)-enTc.mp3\nAraya - Stakato (Original Mix) (Cut From Romel Set)-enTc.mp3\nArmin Van Buuren Feat. Cindy Alma - Beautiful Life (Instrumental Mix) (ABGT 042 Rip)-enTc.mp3\nAstrix - Dharma (Vertical Mode Remix) (Cut From Patterson Set)-enTc.mp3\nAvail - The Awakening (Original Mix) (Cut From Above Clouds Set)-enTc.mp3\nAWD - Freedom (Cut From Tritonal Set)-enTc.mp3\nAyleon - Supremacy (Pierre In The Air'S Breeze Remix) (Cut From Shah Set)-enTc.mp3\nBart Claessen &amp; Sir Adrian - Machiavelli (Cut From Claessen Set)-enTc.mp3\nBinary Finary &amp; Lele Troniq feat. Christina Novelli - Waiting For The Sun (Club Mix) (Cut From Binary Set)-enTc.mp3\nBlue Horizon - Cage Of Freedom (Allen Watts Remix) (Cut From Above Clouds Set)-enTc.mp3\nBrad Ashtar - Azure (Matt Skyer Remix) (Cut From Cogito Set)-enTc.mp3\nBT &amp; tyDi feat. Tania Zygar - Stem The Tides (Cut From Tydi Set)-enTc.mp3\nChris Voro &amp; Victims - X-Rated (Liam Wilson &amp; The Technicians Remix) (Cut From Taylor Set)-enTc.mp3\nDavid Broaders - Curracole (Vintage Morelli Remix) (ABGT 042 Rip)-enTc.mp3\nDigital Elements - The Final Project (Deathmind Remix) (Cut From Estigma Set)-enTc.mp3\nDim Line - Colour Mode (Flatlex Remix) (Cut From Sty Set)-enTc.mp3\nE.T Project - The Dream (Original Mix) (Cut From Above Clouds Set)-enTc.mp3\nEddie Bitar - Kaboom (XGenic Remix) (Cut From Pear Set)-enTc.mp3\nEximinds - Russia (Cut From Tritonal Set)-enTc.mp3\nFelix Pot Pres. Van Ziel - Side World (Daniel Skyer Remix) (Cut From Saux Set)-enTc.mp3\nGary Edgar - ID (Cut From Sherry Set)-enTc.mp3\nGavin Holland - Sunrise (Tom Middleton Liquatech Mix) (ABGT 042 Rip)-enTc.mp3\nGreenflash - Redsky (Cut From Claessen Set)-enTc.mp3\nHi5 -As Long As It Takes (ABGT 042 Rip)-enTc.mp3\nID - ID (A.Squared Remix) (Cut From Several Spirits Set)-enTc.mp3\nJames Woods - Moorea (Cut From Several Spirits Set)-enTc.mp3\njjoo - Bittersweet (Cut From Tritonal Set)-enTc.mp3\nJK Walker - Antichrist (Edit) (Cut From Ekman Set)-enTc.mp3\nJoe Synkro - Why Don't You (Tom Middleton Liquatech Mix) (ABGT 042 Rip)-enTc.mp3\nJohan Ekman &amp; Tobias Johansson - ID (Cut From Ekman Set)-enTc.mp3\nJohn Askew - Bored of You, Bored of Me (Johan Ekman Heard You Like 303 Remix) (Set Rip)-enTc.mp3\nJulian Vincent feat. Cathy Burton - Certainty (Philippe El Sisi Dub) (Cut From RAM Set)-enTc.mp3\nKaimo K &amp; Cate Kanell - The Mystery (Dub) (Cut From Shah Set)-enTc.mp3\nKryder - Aphrodite (Cut From W&amp;W Set)-enTc.mp3\nLael &amp; Harnois - Parris Island (Original Mix) (Cut From Sherry Set)-enTc.mp3\nLostly - Snowfall (Cut From A&amp;F Set)-enTc.mp3\nLTJ Bukem &amp; Peshay -19.5 ( Tom Middleton Liquatech Mix) (ABGT 042 Rip)-enTc.mp3\nMagic Sense Feat. Daniel Nova - Phoenix (Simon O'Shine Remix) (Cut From A&amp;F Set)-enTc.mp3\nManuel Le Saux - #TeamLeSaux (MilamDo Remix) (Cut From Saux Set)-enTc.mp3\nMark Sherry &amp; 2nd Phase - Venomous (Cut From Sherry Set)-enTc.mp3\nMassai One - Zen Up (Cut From Karanda Set)-enTc.mp3\nMightyfools - Put Em Up (Cut From W&amp;W Set)-enTc.mp3\nMike Hennessy - Bella Notte (Cut From Tydi Set)-enTc.mp3\nMike Saint-Jules - The Landing (Danilo Ercole Remix) (Cut From GO Set)-enTc.mp3\nMino Safy pres. Pure Amine - Evening Star (Ico Remix) (Cut From Tasev Set)-enTc.mp3\nMono Suono - Home  (Cut From Several Spirits Set)-enTc.mp3\nNarayana - Amnesia (Original Mix) (Cut From Photographer Set)-enTc.mp3\nNeev Kennedy and Adrian&amp;Raz - Crystal Clear (Igor Dyachkov &amp; U Jeen Remix) (Cut From Susana Set)-enTc.mp3\nOutcasted - Ellypsoid (Original Mix) (Cut From Random X Set)-enTc.mp3\nPhil Parry - Venomous (Original Mix) (Cut From Taylor Set)-enTc.mp3\nPhoenix TDF &amp; Thomas Nikki - Ashes (Original Mix) (Cut From Saux Set)-enTc.mp3\nPopeska - Kraken (Cut From Karanda Set)-enTc.mp3\nPrimitive Eskimo -YNTOO (DJ Tom Middleton Liquatech Edit) (ABGT 042 Rip)-enTc.mp3\nQueensway - Healing (ABGT 042 Rip)-enTc.mp3\nREZarin &amp; Viktor Fox - Bouvaria (Original Mix) (Cut From Super8 Set)-enTc.mp3\nSava - Tree of Life (Original Mix) (-OvErSpAmMeD- Cut From Sty Set)-enTc.mp3\nScience Deal vs Jerom - Decade (CC Anthem 2013) (Original Mix) (Cut From Jerom Set)-enTc.mp3\nSebastian Weikum - Paroxysm (Louis Tan Remix) (ABGT 042 Rip)-enTc.mp3\nSimon Moon - Polish Language (Original Mix) (Cut From Saux Set)-enTc.mp3\nSimon Moon - Step Forward (Hoyaa Remix) (Cut From A&amp;F Set)-enTc.mp3\nSomnium Sensu - Oasis Of Heaven (Abandoned Rainbow's Uplifting Mix) (Cut From Pear Set)-enTc.mp3\nSou Kanai - Follow Me (Cut From Haig Set)-enTc.mp3\nSunlounger Feat. Inger Hansen - Come As You Are (Original Mix) (Cut From Shah Set)-enTc.mp3\nSwilow &amp; Diamans feat. Daniel Rise - Amsterdam 6 A.M (Original Mix) (Cut From Saux Set)-enTc.mp3\nTeenu Aurora - Intense (Cut From Bolier Set)-enTc.mp3\nTellur &amp; Sound Quelle - Hanky Panky (Cut From Tydi Set)-enTc.mp3\nTom Colontonio Feat. Amber Noell - Wish You Were Here (Orla Feeney Remix) (Cut From Susana Set)-enTc.mp3\nTritonal Feat. Underdown - Follow Me Home (Cut From W&amp;W Set)-enTc.mp3\nUDM - Galactica (Johan Ekman Remix) (Cut From Above Clouds Set)-enTc.mp3\nUNKNOWN - ID (Harmonic Rush Remix) (Cut From Romel Set)-enTc.mp3\nVasaris - Origin (Serge Macoveu Remix) (Cut From Saux Set)-enTc.mp3\nWoody van Eyden &amp; Maarten De Jong - It's A Shark! (Woody van Eyden Alternative Mix) (Cut From GO Set)-enTc.mp3\nZ.E.R.O - Absolution (Cut From Tritonal Set)-enTc.mp3\nZaa feat. Molly Bancroft - Timebomb (Jorge Nava Remix) (Cut From Binary Set)-enTc.mp3\nZiRENZ Vs SQ - Viva Voce Opus9 (Pandora Vs Ken Plus Ichiro Remix) (Cut From A&amp;F Set)-enTc.mp3\n","torrent":{"xt":"urn:btih:1c895aef8ba163057561ec16603b101d214614d2","amp;dn":"EnigmaT+Set+Rips+%7B+Cuts+%7D+-+August+27th%2C+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c895aef8ba163057561ec16603b101d214614d2","infoHashBuffer":{"type":"Buffer","data":[28,137,90,239,139,161,99,5,117,97,236,22,96,59,16,29,33,70,20,210]},"announce":[],"urlList":[]}}