{"title":"VA - The Bodyguard OST - (Whitney Housten)(1992)[FLAC-EAC-CUE]","uid":4600300,"size":407441314,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:1e88f9dc6e83be70d99405e7f7fba670291cf50d&amp;dn=VA+-+The+Bodyguard+OST+-+%28Whitney+Housten%29%281992%29%5BFLAC-EAC-CUE%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"seanprince","files":23,"time":1230176305,"description":"VA - The Bodyguard OST - (Whitney Housten)(1992)[FLAC-EAC-CUE]\n\n\n\nTrack list\n\nVarious - The Bodyguard\n\n01. Whitney Houston / I Will Always Love You 04:31\n02. Whitney Houston / I Have Nothing 04:49\n03. Whitney Houston / I'm Every Woman 04:46\n04. Whitney Houston / Run To You 04:24\n05. Whitney Houston / Queen Of The Night 03:09\n06. Whitney Houston / Jesus\nLoves Me 05:12\n07. Kenny G. &amp; Aaron Neville / Even If My Heart Would Break 04:58\n08. Lisa Stansfield / Someday (I'm Coming Back) 04:58\n09. Soul System / It's Gonna Be A Lovely Day 04:51\n10. Curtis Stigers / (What's So Funny 'Bout) Peace Love And Understanding 04:05\n11. Kenny G. / Waiting For You 04:56\n12. Joe Cocker Feat. Sass Jordan / Trust In Me 04:13\n13. Alan Silvestri / Theme From 'The Bodyguard' 02:44\n\nReview by Stephen Thomas Erlewine\n\nFew observers expected that Whitney Houston's first big-screen role in 1992's The Bodyguard would generate a phenomenon. Not that the film itself was a phenomenon -- it was a healthy success, due not only to Houston, but to her co-star Kevin Costner's drawing power -- but the soundtrack's success was astonishing. The Bodyguard followed Houston's cover of Dolly Parton's &quot;I Will Always Love You&quot; to the top of the charts, and once they got there, neither the single nor the album budged for weeks. &quot;I Will Always Love You&quot; spent a record-shattering 14 weeks in the top slot, while The Bodyguard spent 20 weeks at number one, eventually selling over 15 million copies and winning the Grammy award for Album of the Year. Like many phenomena of that magnitude, it's hard to see, in retrospect, what triggered such a massive public response. True, The Bodyguard isn't a typical soundtrack in that its first half plays like Houston's sequel to I'm Your Baby Tonight, but its second half is filled with the flotsam and jetsam typical for a big-budget soundtrack -- an excerpt from Alan Silverstri's score, some flavorless but pleasant Kenny G instrumentals, dated pop and dance numbers, and a cover (Curtis Stigers' take on &quot;(What's So Funny 'Bout) Peace, Love and Understanding,&quot; which is notable in some circles as the recording that made the song's\nauthor, Nick Lowe, a millionaire). Then again, nobody really paid attention to anything outside of the first six songs, all of which rank among Houston's best efforts, demonstrating progress from the somewhat stilted I'm Your Baby Tonight. It's not startling enough to justify the phenomenon, but &quot;I Have Nothing,&quot; &quot;Queen of the Night,&quot; &quot;Run to You,&quot; and especially her cover of &quot;I'm Every Woman&quot; are all first-rate urban pop songs that skillfully capture Houston at her best. In a sense, the album is no different than any other album Houston recorded. It may seem odd that a soundtrack is Houston's biggest-selling album to date, but consider this -- even her best records\nhad five or six great songs surrounded by well-constructed filler; the same is true here, only the filler is recorded by other artists.","torrent":{"xt":"urn:btih:1e88f9dc6e83be70d99405e7f7fba670291cf50d","amp;dn":"VA+-+The+Bodyguard+OST+-+%28Whitney+Housten%29%281992%29%5BFLAC-EAC-CUE%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e88f9dc6e83be70d99405e7f7fba670291cf50d","infoHashBuffer":{"type":"Buffer","data":[30,136,249,220,110,131,190,112,217,148,5,231,247,251,166,112,41,28,245,13]},"announce":[],"urlList":[]}}