{"title":"CompTIA Security+: Get Certified Get Ahead: SY0-301 Study Guide","uid":8366831,"size":2374146,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1ecbd72735e4204713924acea8acf022b3536c6b&amp;dn=CompTIA+Security%2B%3A+Get+Certified+Get+Ahead%3A+SY0-301+Study+Guide+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"cnstarz","files":1,"time":1365792082,"description":"Publication Date: November 10, 2011 | ISBN-10: 1463762364 | ISBN-13: 978-1463762360 | Edition: Stg\n\nAuthor: Darril Gibson\n\nCompTIA Security+: Get Certified Get Ahead: SY0-301 Study Guide is an update to the top-selling SY0-201 guide, which helped thousands of readers pass the exam the first time they took it. The SY0-301 version covers every aspect of the SY0-301 exam, and includes the same elements readers raved about in the previous version. \n\nEach of the eleven chapters presents topics in an easy to understand manner and includes real-world examples of security principles in action. The author uses many of the same analogies and explanations he's honed in the classroom that have helped hundreds of students master the Security+ content. You'll understand the important and relevant security topics for the Security+ exam, without being overloaded with unnecessary details. Additionally, each chapter includes a comprehensive review section to help you focus on what's important. \n\nOver 450 realistic practice test questions with in-depth explanations will help you test your comprehension and readiness for the exam. The book includes a 100 question pre-test, a 100 question post-test, and practice test questions at the end of every chapter. Each practice test question includes a detailed explanation to help you understand the content and the reasoning behind the question. You'll be ready to take and pass the exam the first time you take it. \n\nIf you plan to pursue any of the advanced security certifications, this guide will also help you lay a solid foundation of security knowledge. Learn this material, and you'll be a step ahead for other exams. This SY0-301 study guide is for any IT or security professional interested in advancing in their field, and a must read for anyone striving to master the basics of IT systems security.","torrent":{"xt":"urn:btih:1ecbd72735e4204713924acea8acf022b3536c6b","amp;dn":"CompTIA+Security%2B%3A+Get+Certified+Get+Ahead%3A+SY0-301+Study+Guide+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1ecbd72735e4204713924acea8acf022b3536c6b","infoHashBuffer":{"type":"Buffer","data":[30,203,215,39,53,228,32,71,19,146,74,206,168,172,240,34,179,83,108,107]},"announce":[],"urlList":[]}}