{"title":"Axa (Eclipse, Ken Pierce Books)","uid":8990961,"size":333562040,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:1eee9dbd951c6f3215e5d16691e7cd3508e1a19f&amp;dn=Axa+%28Eclipse%2C+Ken+Pierce+Books%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Ichthypod_Crane","files":13,"time":1380778645,"description":"Confronted by a Wacky Waving Inflatable Arm-Flailing Tubemen outside the auto parts store, the ECUP curls into a ball and submissively urinates, with 'Axa'!\n\nThe Wacky Waving Inflatable Wiki says:\n\nAxa was the title of a newspaper comic strip featuring an eponymous lead character, which was published in British daily tabloid The Sun from 1978 to 1986. It was written by Donne Avenell and drawn by Romero. Romero created 2238 strips in black/white before the comic was cancelled. The last strip published in The Sun was number 2234. It was published on November 16, 1985.\n\nRomero returned to draw his previous series, Modesty Blaise, but also took Axa to the American company Eclipse Comics, who published a two issue series of new adventures, though this time with much less nudity and Chuck Dixon as writer. All the strips from The Sun have been reprinted in trade paperback format by Ken Pierce Books.\n\nOpening on a post-apocalyptic Earth in the year 2080, Axa is a woman who, having grown sick of the regimented and stifling society inside a domed city, flees into the untamed wilderness. The strip mixed elements of science fiction and sword-swinging barbarian tales (the lead character herself bears more than a casual similarity to Red Sonja). However, it is arguable that the strip's main draw were the frequent depictions of the gorgeous and full-figured Axa's tendency to wind up topless or fully nude, as rendered by good-girl artist Romero.\n\nThis torrent contains the two issues published by Eclipse in 1987, as well as the ten volumes from Ken Pierce Books that preceded it. Much love for the creators, the scanners and the nudity! Grab it, grant it!\n\n\n\nDownload deux is the oddball 'Tales of the Beanworld' by Larry Marder! Running a total of twenty-one issues, Marder published the first four himself (through his imprint, the Beanworld Press) before taking the series to Eclipse in 1986. Our good friend shipjolly uploaded this one waaaaaaaaay back in November of 2008. Go ye here:\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/4537853/Tales_of_the_Beanworld_(Complete)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/4537853/Tales_of_the_Beanworld_(Complete)&lt;/a&gt;\n\nShow you care, continue to share!","torrent":{"xt":"urn:btih:1eee9dbd951c6f3215e5d16691e7cd3508e1a19f","amp;dn":"Axa+%28Eclipse%2C+Ken+Pierce+Books%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1eee9dbd951c6f3215e5d16691e7cd3508e1a19f","infoHashBuffer":{"type":"Buffer","data":[30,238,157,189,149,28,111,50,21,229,209,102,145,231,205,53,8,225,161,159]},"announce":[],"urlList":[]}}