{"title":"Getting Screwed - Sex Workers and the Law (2015).pdf Gooner","uid":14418158,"size":5589182,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1fe1db9c6e45e38f486d901135c29dacfb1c5ef4&amp;dn=Getting+Screwed+-+Sex+Workers+and+the+Law+%282015%29.pdf+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1461513216,"description":"Getting Screwed - Sex Workers and the Law (2015).pdf Gooner\r\n\r\nPublisher: ForeEdge (October 6, 2015)\r\nLanguage: English\r\nISBN-10: 1611686342\r\nISBN-13: 978-1611686340\r\n\r\nAlison Bass weaves the true stories of sex workers with the latest research on prostitution into a gripping journalistic account of how women (and some men) navigate a culture that routinely accepts the implicit exchange of sex for money, status, or even a good meal, but imposes heavy penalties on those who make such bargains explicit. Along the way, Bass examines why an increasing number of middle-class white women choose to become sex workers and explores how prostitution has become a thriving industry in the twenty-first-century global economy. Situating her book in American history more broadly, she also discusses the impact of the sexual revolution, the rise of the Nevada brothels, and the growing war on sex trafficking after 9/11. \r\n\r\nDrawing on recent studies that show lower rates of violence and sexually transmitted diseases, including HIV, in regions where adult prostitution is legal and regulated, Bass makes a powerful case for decriminalizing sex work. Through comparisons of the impact of criminalization vs. decriminalization in other countries, her book offers strategies for making prostitution safer for American sex workers and the communities in which they dwell. \r\n\r\nThis riveting assessment of how U.S. anti-prostitution laws harm the public health and safety of sex workers and other citizens—and affect larger societal attitudes toward women—will interest feminists, sociologists, lawyers, health-care professionals, and policy makers. The book also will appeal to anyone with an interest in American history and our society’s evolving attitudes toward sexuality and marriage","torrent":{"xt":"urn:btih:1fe1db9c6e45e38f486d901135c29dacfb1c5ef4","amp;dn":"Getting+Screwed+-+Sex+Workers+and+the+Law+%282015%29.pdf+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1fe1db9c6e45e38f486d901135c29dacfb1c5ef4","infoHashBuffer":{"type":"Buffer","data":[31,225,219,156,110,69,227,143,72,109,144,17,53,194,157,172,251,28,94,244]},"announce":[],"urlList":[]}}