{"title":"Dynamic Colonial Experience - Europa Universalis IV mod","uid":10792941,"size":5476504,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:1ffcf4db7b77d56ee571cefb619711d1665e68d8&amp;dn=Dynamic+Colonial+Experience+-+Europa+Universalis+IV+mod&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Nimbleton","files":-1,"time":1408271791,"description":"Dynamic Colonial Experience - Europa Universalis IV mod\n\n\nExtract 7zip file to your C:Users[user]Documents Paradox Interactive Europa Universalis IV mod folder\n\n\nDESCRIPTION\nThe Dynamic Colonial Experience Mod expands past the limitations of the vanilla experience and let's you truly dive into the realm of expansion and colonization. Featuring over 15 new formable nations, new national ideas and traditions, new colonial regions, new names for colonies based on cultural groups and unique colony names on a nation-by-nation basis, and removing all wasteland provinces, this mod is a must-have for any player who is wanting to immerse themselves in the colonial experience. \n\nNew Colonial Nations: \n\nThese are nations that can only be formed after a colony has declared and successfully gained independence. The AI or human player can form these nations. \nMost, if not all, of these nations include new national ideas and some also introduce new cultures to the game. \n\n-Republic of Texas \n-Acadiana \n-Appalachia \n-North American Union \n-Pacific Union \n-Yukon \n-United Islands of the Caribbean \n-United Pacific Islands \n-Australia \n-New Zealand \n-Australasia \n-Ameristralia \n\nNew Formable Nations: \n\nThese nations can be formed by anyone who meets the proper requirements, usually designated as a culture group or capital location. Both the AI or human player can form these nations. \nNot all of these nations include unique national ideas. \n\n-Confederation of North American Tribes \n-Celtic League \n-United Alpine States \n-Iberia \n-Arab League \n-Baltic Federation \n-Iceland \n\nThis mod also removes all wasteland, providing new names for provinces otherwise not accessible. In addition to removing the wasteland, it adds colonial regions to North America, South America, Africa, and the Pacific, creating a more dynamic colonization experience.Instead of colonies having the name &quot;Castillian Brazil&quot; or &quot;English Mexico&quot;, colonies will now have more appropriate names to their culture. \n\nIf you play as a nation who does not have a dynamic colony naming system, please let me know. \n\nAlso, the requirements for a colony to delacre independence has been changed quite significantly. You will find colonies will revolt much sooner, providing a more interesting experience. Instead of England just having their colonies until the end of the game, they will fight back and attempt to form their own nations,including the ones I created above. The trade nodes have been adjusted accordingly, and everything should run rather smoothly. Obviously, this mod has a large emphasis on colonization so it will be the most fun if you attempt to colonize with it.","torrent":{"xt":"urn:btih:1ffcf4db7b77d56ee571cefb619711d1665e68d8","amp;dn":"Dynamic+Colonial+Experience+-+Europa+Universalis+IV+mod","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1ffcf4db7b77d56ee571cefb619711d1665e68d8","infoHashBuffer":{"type":"Buffer","data":[31,252,244,219,123,119,213,110,229,113,206,251,97,151,17,209,102,94,104,216]},"announce":[],"urlList":[]}}