{"title":"Nanotechnology in the Food, Beverage and Nutraceutical Industrie","uid":15321064,"size":25918804,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:21a4ec1d8631e0d431d7969127f6ab814fca1e2d&amp;dn=Nanotechnology+in+the+Food%2C+Beverage+and+Nutraceutical+Industrie&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1468644504,"description":"Nanotechnology in the Food, Beverage and Nutraceutical Industries - Qingrong Huang (WP, 2012).pdf\r\n\r\nISBN 978-1-84569-739-6\r\n\r\nNanotechnology has the potential to impact on food processing significantly. This important book summarises current research in this area and provides an overview of both current and possible future applications of nanotechnologies in the food industry. Issues such as safety and regulation are also addressed.\r\n\r\nAfter an introductory overview, the first part discusses general issues such as risk assessment, the regulatory framework, detection and characterisation of nanoparticles in food. Part two summarises the wide range of applications of nanotechnology in food processing, including nanoscale nutraceutical delivery systems, nanoemulsions and colloids, nanoscale rapid detection devices for contaminants, nanofiltration and nanocomposite packaging materials.\r\n\r\nWith its distinguished editor and international team of contributors, Nanotechnology in the food, beverage and nutraceutical industries is a valuable reference work for both food processors and those researching this expanding field.\r\n\r\nDiscusses issues such as risk assessment, regulatory framework, detection and characterisation of nanoparticles in food\r\nSummarises the wide range of applications of nanotechnology in food processing, including nutraceutical delivery and packaging materials\r\nWritten by a distinguished team of international contributors, this book is an invaluable reference for industry professionals and academics alike","torrent":{"xt":"urn:btih:21a4ec1d8631e0d431d7969127f6ab814fca1e2d","amp;dn":"Nanotechnology+in+the+Food%2C+Beverage+and+Nutraceutical+Industrie","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"21a4ec1d8631e0d431d7969127f6ab814fca1e2d","infoHashBuffer":{"type":"Buffer","data":[33,164,236,29,134,49,224,212,49,215,150,145,39,246,171,129,79,202,30,45]},"announce":[],"urlList":[]}}