{"title":"Cook-Tracking Deception-Bush Mid-East Policy(2006)","uid":4537832,"size":1328070,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:21b3330fdd3ae157d2f56949a2955173971d3141&amp;dn=Cook-Tracking+Deception-Bush+Mid-East+Policy%282006%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"red_gonzo","files":1,"time":1227809714,"description":"This is William A. Cook&amp;#039;s shocking book Tracking Deception - Bush Mid-East Policy (2006) which is a compelling indictment of this Bush-sponsored New World Order of endless wars against Arabs/Moslems, relentlessly promoted by a nauseating campaign of deceit and lies at the highest levels of the US Administration in complicity with a corrupt self-serving corporate media, at the behest of a greedy so-called corporate &quot;elite&quot; and of the aggressive fundamentalist pro-Israel lobbies whose representatives are in dominant numbers at the White House. This is a complex book containing a stunning and eye-opening amount of information about a hijacked American administration and its corporate allies who are greedily taking what they want from the middle-east and running roughshod over a beleaguered Palestinian people (and others). You are about to discover the catalogue of horrors that have been and continue to be perpetrated by the Bush administration by their commitment to fund and support the violent repression of the Palestinian people by an ugly Israeli regime. Many people have no idea that Israel has flouted over one hundred UN resolutions and never been held to account. It is also little known that Ariel Sharon was such a barbaric character who has personally instigated many appalling crimes against the Palestinian people during his spell in the Israeli military and now is able to continue to do so from government itself. And not to mention that Israel has had more American money pumped into it than any other nation in the world and by such a huge margin. Tracking Deception will make you wonder how in this day and age with the technology we all have at our disposal, things like this can go on and the general public can be kept in virtual ignorance. Surely if the truth was laid before the American public in all its stark reality then the Bush regime would be dropped like a hot stone and would probably be called to account for their actions as it will become clear to you that far from the Palestinians/Iraqis being the terrorists in the middle-east it would appear that an American funded Israeli regime are by far the biggest terrorist organization this world has ever seen. 380 pages. A must read for everyone.\n","torrent":{"xt":"urn:btih:21b3330fdd3ae157d2f56949a2955173971d3141","amp;dn":"Cook-Tracking+Deception-Bush+Mid-East+Policy%282006%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"21b3330fdd3ae157d2f56949a2955173971d3141","infoHashBuffer":{"type":"Buffer","data":[33,179,51,15,221,58,225,87,210,245,105,73,162,149,81,115,151,29,49,65]},"announce":[],"urlList":[]}}