{"title":"Nuclear Nightmares-(WTC-SWE)","uid":4556268,"size":671594252,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:21da0d7ec760921cbedcefade7a2865fad71eb5a&amp;dn=Nuclear+Nightmares-%28WTC-SWE%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"WTC-SWE","files":-1,"time":1228496516,"description":"BBC:\n-----\n\n                               NUCLEAR NIGHTMARES\n                              --------------------\n\nOn 26 April 1986, reactor number four at the Chernobyl Nuclear Power Plant blew up. Forty-eight hours later the entire area was evacuated. Over the following months there were stories of mass graves and dire warnings of thousands of deaths from radiation exposure.\nYet in a BBC Horizon report screened on Thursday, a number of scientists argue that 20 years after the accident there is no credible scientific evidence that any of these predictions are coming true.\nThe anniversary of the world's worst nuclear accident in April saw the publication of a number of reports that examined the potential death toll resulting from exposure to radiation from Chernobyl.\nEnvironmental group Greenpeace said the figure would be near 100,000. Another, Torch (The Other Report on Chernobyl), predicted an extra 30,000-60,000 cancer deaths across Europe. But according to figures from the Chernobyl Forum, an international organisation of scientific bodies including a number of UN agencies, deaths directly attributable to radiation from Chernobyl currently stand at 56 - less than the weekly death toll on Britain's roads.\n&quot;When people hear of radiation they think of the atomic bomb and they think of thousands of deaths, and they think the Chernobyl reactor accident was equivalent to the atomic bombing in Japan which is absolutely untrue,&quot; says Dr Mike Repacholi, a radiation scientist working at the World Health Organization (WHO).\n\nOutdated models:\n----------------\n\nScientists involved in the Forum expect the death toll to rise but not far. \n&quot;We're not going to get an epidemic of leukaemia,&quot; Dr Repacholi tells Horizon, &quot;and we don't expect an epidemic of solid cancers either.&quot;So why have the predictions varied so wildly?\nScientific as well as public attitudes to radiation are still dominated by the devastating effects of the atomic bombs dropped on the Japanese cities of Hiroshima and Nagasaki by the US more than half-a-century ago.\nAt least 200,000 people died almost immediately from the blast, and thousands more were exposed to higher levels of radiation than anybody had ever been exposed to before.\nThe survivors of Hiroshima and Nagasaki became the most intensely studied people in the world.\n&quot;The detonation of the A-bomb,&quot; explains Professor Antone L Brooks of Washington State University, US, &quot;was the first time that scientists had an opportunity really to look and to see the health effects of radiation; how much radiation was required to produce how much cancer.&quot;\nIn 1958, using data largely drawn from these bomb studies, scientists came up with an answer. It was called the Linear No Threshold (LNT) model and suggested all radiation, no matter how small, was dangerous. \n\n\n\nTitle: Nuclear Nightmares (2006)\nFile Size: 639 MB \nFormat:AVI\nVideo Length: 00:49:22\nVideo Codec: XviD\nVideo Resolution: 624x352\nVIdeo Bitrate: 1769 kbit/s\nFPS:  25.000000\nAudio Bitrate: 129 kbit/s\nAudio Codec: MPEG Layer-3\nChannels:  2\nSubtitles:(N/A)\n  &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0828787/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0828787/&lt;/a&gt;\n\n\n\nENJOY:\n\n\n\n\n\nYOUR CHOICE\n\nWTC-SWE\n\n\n\n\n(Please seed so others can enjoy)\n","torrent":{"xt":"urn:btih:21da0d7ec760921cbedcefade7a2865fad71eb5a","amp;dn":"Nuclear+Nightmares-%28WTC-SWE%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"21da0d7ec760921cbedcefade7a2865fad71eb5a","infoHashBuffer":{"type":"Buffer","data":[33,218,13,126,199,96,146,28,190,220,239,173,231,162,134,95,173,113,235,90]},"announce":[],"urlList":[]}}