{"title":"Overseas - Overseas [2013][EAC,log,cue. FLAC]","uid":8545255,"size":191990860,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:21db96b3ecc355d522c3ba8d207a2793a4c68838&amp;dn=Overseas+-+Overseas+%5B2013%5D%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":13,"time":1370511091,"description":"Artist: Overseas\nRelease: Overseas\nReleased: 2013\nLabel: Studio Recording\nCatalog#: 001\nFormat: FLAC / Lossless / Log (100%) / Cue\n[color=blue]Country: USA\nStyle: ROCK\n\nimage\n\n\n1 Ghost To Be\n2 Redback Strike\n3 Old Love\n4 HELLP\n5 Lights Are Gonna Fall\n6 Here (Wish You Were)\n7 The Sound Of Giving Way\n8 Down Below\n9 Came With The Frame\n10 All Your Own\n\nShortly after the 2009 death of incredibly influential songwriter Vic Chestnutt, four friends and fans of the musician -- David Bazan, known for his witty solo material as well as his work in Pedro the Lion; Will Johnson from Centro-Matic; and brothers Bubba and Matt Kadane, the minds behind seminal slowcore units Bedhead and the New Year -- met up in a Denton, Texas studio and began work on what would become the debut album from Overseas. Though not officially uniting in memoriam of their talented friend, the four musicians already had inclinations toward somber, grave-faced music at times. The ten songs on this self-titled debut don't all sound like the slowcore murmurings of their respective pasts, but there's a certain collective darkness at the core of even the most upbeat Overseas tracks. Though all talented vocalists, Johnson and Bazan handle all of the singing here, often trading back and forth between Bazan's husky grumbles and Johnson's protracted sighs. Though Overseas is clearly a total collaborative effort, the individual components are easy to pick out. Bazan's sardonic wit pops up in the lyrics of songs like &quot;Lights Are Gonna Fall&quot; and the brilliantly mean &quot;Hellp.&quot; Johnson's ghostly harmonies draw out songs like &quot;Here (Wish You Were)&quot; with a pastoral blues bent not unlike his rustic solo album Scorpion. The silent heroes of Overseas, however, are the Kadane brothers, whose instrumental fingerprints touch every surface of every song and sculpt the vibe of the album in a way unmistakable to their slowcore past. While Bazan's raw, comical lyrics about kids eating pizza on the boardwalk may perk up the ears of those already familiar with his style, the patient, meticulous interlocking of guitar lines and melodies springing from every instrument recall the brightest spots of Bedhead and the New Year's incredible brilliance. The triumphant instrumental introduction of &quot;Redback Strike&quot; lingers just a little longer than usual, fades into a single verse, and then returns before the song abruptly stops. The slow-motion tumble of &quot;The Sound of Giving Way&quot; breaks down into laser-beam guitar leads. These examples are just a few of the type of paint-by-numbers orchestrations that made Bedhead's late-'90s melancholia so sticky and captivating, and that sound continues to develop on Overseas. All four members of this indie supergroup make Overseas unique, but at its highest heights, the Kadane brothers make the band great.","torrent":{"xt":"urn:btih:21db96b3ecc355d522c3ba8d207a2793a4c68838","amp;dn":"Overseas+-+Overseas+%5B2013%5D%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"21db96b3ecc355d522c3ba8d207a2793a4c68838","infoHashBuffer":{"type":"Buffer","data":[33,219,150,179,236,195,85,213,34,195,186,141,32,122,39,147,164,198,136,56]},"announce":[],"urlList":[]}}