{"title":"Democracy Now - 11 jan 2012","uid":6948075,"size":455557750,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:227eb41caec3f7992c76d1511fdd3d4295ef7725&amp;dn=Democracy+Now+-+11+jan+2012&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1326302455,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Jan 11, 2012\n\n- Romney Wins New Hampshire Primary, Paul Follows in Strong Second-Place Finish\n- South Carolina to Sue Over Voter ID Challenge\n- Former Prisoners, Advocates Mark Decade of Gitmo\n- Activists to Protest GuantÃƒÂ¡namo in D.C.\n- Arab League Observer Calls Syria Mission a &quot;Farce&quot;\n- U.N.: Increased Killings Since Arrival of Arab League Mission\n- Report: Israeli Settlement Expansion Breaks Records\n- Drones Account for 31% of U.S. Military Aircraft\n- Iranian Nuclear Scientist Killed in Bombing\n- Nuclear &quot;Doomsday&quot; Clock Moves Closer to Midnight\n- Child Malnutrition Soars in India\n- Barricades Removed From Occupy Wall Street Park\n\n\nSpecial reports\n\n- Romney Wins Republican New Hampshire Primary, Followed by Paul, Huntsman\n\nMitt Romney won the New Hampshire Republican presidential primary with almost 40 percent of the vote, giving the former Massachusetts governor a sweep of the first two critical tests in the GOP nominating contest. He used his victory speech to alternatively attack his potential rival, President Obama, and outline his plans if elected, saying voters must choose &quot;between two very different destinies.&quot; Meanwhile, Texas Rep. Ron Paul finished a strong second with 23 percent of the vote and told his supporters, &quot;but we are nibbling at [Romney's] heels.&quot; Despite campaigning almost exclusively in New Hampshire, former Utah Governor Jon Huntsman secured just 17 percent of the vote, but argued that &quot;third place is a ticket to ride&quot; and vowed to continue his campaign in New Hampshire. We play excerpts from last night's speeches by the top three Republican contenders.\n\n\n- Romney Cements Front-Runner Status with Unlimited Spending from Unregulated Super PACs\n\nWe speak with Mother Jones reporter Andy Kroll about how Mitt Romney &quot;got his money's worth&quot; in New Hampshire's Republican primary, winning about 40 percent of voter support, almost double that of his closest challenger, Rep. Ron Paul. Kroll says the victory demonstrates how one of the key stories in this campaign has been the rise of Super PACs, the independent political action committees that can now raise and spend unlimited amounts of money since the Supreme Court's 2010 Citizens United ruling. &quot;This outside money, especially for the pro-Romney folks, has been a way to knock [his challengers] all out at the knees and solidify Governor Romney's spot on the top. And it's something that his campaign can't do, and really doesn't want to do,&quot; Kroll says. &quot;They don't have to worry about being so negative, because they have this outside dark-money group to do it.&quot;\n\n\n- Rivals' Attacks on Romney's Corporate Record Display Occupy Wall Street's Wide Reach\n\nThe New Hampshire primary brought fewer than 50 percent of voters to the polls. The candidates are &quot;addressing issues that aren't really connecting with a whole bunch of Americans, especially blue-collar Americans,&quot; says Dale Kuehne, a New Hampshire political science professor. &quot;I don't know that they see a whole lot of reason to go out and vote for either Obama or out to vote for Romney or some of the others.&quot; Many undeclared New Hampshire voters lent their support to the Libertarian-leaning Republican candidate, Ron Paul, who veers from the mainstream GOP platform by calling for the withdrawal of U.S. troops from Iraq and Afghanistan and has spoken out against the military-industrial complex. Meanwhile, Paul's fellow challengers have attacked Romney for the jobs lost he was head of the venture capitalist firm, Bain Capital. &quot;Occupy Wall Street has to understand not only have they changed the conversation in the country, but now that conversation is going to be reinforced in South Carolina by two people that you would think would be the least likely - Rick Perry and Newt Gingrich,&quot; says Arnie Arneson, longtime New Hampshire radio and TV host.\n\n\n- How New Hampshire Became Last U.S. State to Recognize MLK Day Holiday\n\nAhead of the Monday holiday celebrating Martin Luther King, Jr., we speak with two people key to establishing the day as a paid state holiday in New Hampshire - the last state to do so - replacing its optional Civil Rights Day in 1999. &quot;I look at Mitt Romney talking about saving the soul of America and recall that the model of the Southern Christian Leadership Conference was to redeem the soul of America,&quot; says Arnie Alpert, the New Hampshire program coordinator for the American Friends Service Committee since 1981, and activist with Occupy New Hampshire. &quot;What we have to look forward to on Martin Luther King Day, is to reconnect ourself with values that tie together a message of peace, a message of social justice, a message of standing up forever against racism and linking together with the social movements that take courageous non-violent action.&quot;\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:227eb41caec3f7992c76d1511fdd3d4295ef7725","amp;dn":"Democracy+Now+-+11+jan+2012","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"227eb41caec3f7992c76d1511fdd3d4295ef7725","infoHashBuffer":{"type":"Buffer","data":[34,126,180,28,174,195,247,153,44,118,209,81,31,221,61,66,149,239,119,37]},"announce":[],"urlList":[]}}