{"title":"The Art Of War- Restored Edition - Free Sample","uid":4630247,"size":6884245,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:236c3a7ae6c79155b790528fff584da82f931762&amp;dn=The+Art+Of+War-+Restored+Edition+-+Free+Sample&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"demolitio","files":1,"time":1231361156,"description":"Until the First World War, the theory of war in Europe revolved around a rivalry between two thinkers - Carl von Clausewitz and Baron Antoine Henri de Jomini. For most of the 19th century, Jomini's The Art of War was considered the most important book written on the subject, and Jomini the leading expert on military theory.\n\nNapoleon himself, upon reading some of Jomini's early writings on war, is reported to have remarked, &quot;It betrays to the enemy the whole of my system of war!&quot;\n\nThe Art of War was translated into English twice. The first time was in 1854. The standard translation was published in 1862, but that translation was incomplete - the translators had excised Jomini's introductory material, losing an important part of The Art of War, including key points in the rivalry between Jomini and Clausewitz.\n\nFor the first time in English since 1854, Legacy Books Press Classics presents Baron de Jomini's The Art of War complete and restored, with the original front matter reinstated, and a new introduction by John-Allen Price. Still influential even today, this is a key volume for understanding the art of war and the Age of Napoleon.\n\nNow available from Barnes &amp; Noble and Amazon.com in the United States, Canada, Great Britain, France, Germany, and Japan.","torrent":{"xt":"urn:btih:236c3a7ae6c79155b790528fff584da82f931762","amp;dn":"The+Art+Of+War-+Restored+Edition+-+Free+Sample","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"236c3a7ae6c79155b790528fff584da82f931762","infoHashBuffer":{"type":"Buffer","data":[35,108,58,122,230,199,145,85,183,144,82,143,255,88,77,168,47,147,23,98]},"announce":[],"urlList":[]}}