{"title":"Lignin in Polymer Composites - Omar Faruk, ‎Mohini Sain","uid":15463401,"size":27090946,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:23733e6b7ee23e794cd97e4e9ccdeb2ef0c5fa57&amp;dn=Lignin+in+Polymer+Composites+-+Omar+Faruk%2C+%26lrm%3BMohini+Sain&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"clouderone","files":1,"time":1470070624,"description":"Lignin in Polymer Composites - Omar Faruk, ‎Mohini Sain (WA, 2016).pdf\r\n\r\nLignin in Polymer Composites presents the latest information on lignin, a natural polymer derived from renewable resources that has great potential as a reinforcement material in composites because it is non-toxic, inexpensive, available in large amounts, and is starting to be deployed in various materials applications due to its advantages over more traditional oil-based materials.\r\n\r\nThis book reviews the state-of-the-art on the topic and their applications to composites, including thermoplastic, thermosets, rubber, foams, bioplastics, nanocomposites, and lignin-based carbon fiber composites. In addition, the book covers critical assessments on the economics of lignin, including a cost-performance analysis that discusses its strengths and weaknesses as a reinforcement material.\r\n\r\nFinally, the huge potential applications of lignin in industry are explored with respect to its low cost, recyclable properties, and fully biodegradable composites, and the way they apply to the automotive, construction, and packaging industries.\r\n\r\nReviews the state-of-the-art on the topic and their applications to composites, including thermoplastic, thermosets, rubber, foams, bioplastics, nanocomposites, and lignin-based carbon fiber composites\r\nPresents the essential processing and properties information for engineers and materials scientists, enabling the use of lignin in composites\r\nProvides critical insight into the applications and future trends of lignin-based composites, including advantages, shortcomings, and economics\r\nIncludes a thorough coverage of extraction, modification, processing, and applications of the material","torrent":{"xt":"urn:btih:23733e6b7ee23e794cd97e4e9ccdeb2ef0c5fa57","amp;dn":"Lignin+in+Polymer+Composites+-+Omar+Faruk%2C+%26lrm%3BMohini+Sain","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"23733e6b7ee23e794cd97e4e9ccdeb2ef0c5fa57","infoHashBuffer":{"type":"Buffer","data":[35,115,62,107,126,226,62,121,76,217,126,78,156,205,235,46,240,197,250,87]},"announce":[],"urlList":[]}}