{"title":"Total War Shogun 2 READNFO-FLT","uid":6257639,"size":13285689702,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:23c0b2fdd093b9b691b914ab6cac250a82cbee82&amp;dn=Total+War+Shogun+2+READNFO-FLT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"DibyaTPB","files":137,"time":1300636101,"description":" &lt;a href=&quot;http://www.thedesiadda.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.thedesiadda.com/&lt;/a&gt;\n\nServer seed there!\n==================\n\nIn Their 24th Year Of Glory, FairLight Released #1000!\n\nTotal War: Shogun 2 (c) SEGA ÃƒÅ¡Ãƒâ„¢\n\n Supplied by: FAIRLIGHT : : Release Date: 20/03/2011 :\n Cracked by: FAIRLIGHT Ã‚Â³ Ã‚Â³ Game Type: Strategy Ã‚Â³\n Packaged by: FAIRLIGHT Ã‚Â³ Ã‚Â³ Image Format: ISO Ã‚Â³\n-----\nÃ‚Â³ DISCS: 2 DVDs Ã‚Â³ Ã‚Â³ Protection: Steam + CEG Ã‚Â³\n\nÃ‚Â³ DVD1: flt-sh2a.001 -&gt; flt-sh2a.071 Ã‚Â³\nÃ‚Â³ DVD2: flt-sh2b.001 -&gt; flt-sh2b.063 Ã‚Â³\n\nSpecial Announcement:\n=====================\nRelease #1000!\nTwo boys sit on a train, in rural areas of a low density populated part\nof the world. There and then they form a pact that will forever change\nthe course of the computer industry, marking a shift in culture that is\nsoon to reach far and beyond their own expectations, and the horizon of\ntheir own vision. There and then, the group FairLight was born.\n\nApril 1987 was the year when the infant was conceived. The infant is\nnow a grown man at the age of 23 who made significant impressions on\nCommodore 64, Amiga, Super Nintendo and the PC scenes, both for demo and\ncracks. Today we celebrate a historic day, a day few people would even\nenvisage could ever come - FairLight celebrates it's 1000th release!\nWell, this is naturally not entirely correct, it's release #1000 on\nPC ISO which followed hundreds of on C64, Amiga, SNES and earlier\nPC floppy scene appearing in parallel, or the dozens of mind boggling demos\never seen on most consumer hardware. So, rejoice and celebrate today as you\nare one of those who can taste yet another fruit, resulting from our\nblood, sweat and skills. Hours, days, weeks and months have been spent\n- both screen time and in some cases also prison time, for you to enjoy our\nwork. Rejoice and celebrate with us, the efforts earning your respect. We\nare still here; we are still the sentinels of a world free of copy\nprotections. We are still here as we were built stronger to last longer.\n\nWe are FairLight, standing up for quality, tradition and pride!\n\nThe FairLight council stands with eyes wet in admiration from the work\nof the PC ISO section. &quot;Boys, you have all done well. You bow to no one!&quot;\nWe are proud to be the first gameISO group reaching #1000 gameISO releases.\nFairLight started the gameISO division in late 1998 and is still going.\nFor your pleasure, check the FairLight dir for all the #1000 nfo's, and the\nreleases.txt for all the game releases both in the included zip-file.\nSpecial thanks to our lost/retired members that made this possible!\nIn April 2012 we will celebrate our 25th anniversary. Stay tuned!\n\nGame information:\n=================\n\nIn 2000, the Creative Assembly re-invented the strategy genre with Shogun:\nTotal War, an unprecedented blend of 3D real-time battles and turn-based\nmanagement game and the first offering in the multi-award winning series.\nWith over 7 million units sold and universal acclaim from the press and\ncommunity, Total War has consistently been at the cutting edge of the genre\nand is today one of the most successful PC franchises of all time.\nIn 2011, the makers of Rome and Empire: Total War will release the sequel\nto the game that started it all. Shogun 2: Total War will take long-time\nveterans and newcomers alike to the next level of strategy gaming on PC.\nBased on 10 years of experience in making Total War, Shogun 2 is the\nperfection of the series with a new Artificial Intelligence (AI),\nrevolutionary multiplayer modes, brand new campaign map options and epic 3D\nreal-time battles.\nIt is the middle of the 16th century in Medieval Japan. The country, once\nruled by a unified government, is now split into many warring clans. The\nplayer takes on the role of one Daimyo - the clan leader - and will use\nmilitary engagements, economics and diplomacy to achieve the ultimate goal:\nre-unite Japan under his supreme command and become the new Shogun - the\nundisputed ruler of Japan.\nSet during the golden age of Samurai warfare, Shogun 2 brings to life the\nmost turbulent period of Japanese history.\n* New character progression\n* A complete single and multiplayer offering\n* New Generation AI system\n* Improved land and naval battle gameplay\n* Accessible and in-depth empire-building gameplay\n\nInstallation Information:\n=========================\n\n* Burn or Mount.\n* Use our Installer located on DVD1 in the FairLight folder. When asked if\nyou want to apply updates and crack press Yes. If this step fails or if\nyou want to do it manually by extracting the zip files in the FairLight\nfolder on DVD2, you will need to extract update_common.zip and one of the\nupdate_XX.zip depending on what language you choose to install.\nWe leave it as an exercise to the user to figure out which one.\n* Launch the game using Shogun2.exe in the directory where you installed it.\n* Buy the game if you enjoy it, saves are compatible with uncracked version.\n\n\nDibyaTPB\n========\n\nWell i think this is what you all have been waiting for! ENjoy!! Rand Remember there was a guy called DibyaTPB who uploads stuff! LMAO xD\nEnjoy!","torrent":{"xt":"urn:btih:23c0b2fdd093b9b691b914ab6cac250a82cbee82","amp;dn":"Total+War+Shogun+2+READNFO-FLT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"23c0b2fdd093b9b691b914ab6cac250a82cbee82","infoHashBuffer":{"type":"Buffer","data":[35,192,178,253,208,147,185,182,145,185,20,171,108,172,37,10,130,203,238,130]},"announce":[],"urlList":[]}}