{"title":"The Source - A Documentary [1999]","uid":4428270,"size":734202008,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:24cdbedc4332bbbc8a34b2c1a9529a6a0c8e5572&amp;dn=The+Source+-+A+Documentary+%5B1999%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"spolevc","files":2,"time":1223147609,"description":"The Source is a 1999 documentary about the Beat Generation.\n\nIt was directed by Chuck Workman,and features appearances by Johnny Depp, Dennis Hopper, and John Turturro.\n\nThe Beat Generation is a term used to describe both a group of American writers who came to prominence in the late 1950s and early 1960s, and the cultural phenomena that they wrote about and inspired (later sometimes called &quot;beatniks&quot;): a rejection of mainstream American values, experimentation with drugs and alternate forms of sexuality, and an interest in Eastern spirtuality.\n\nThe major works of Beat writing are Allen Ginsberg&amp;#039;s Howl (1956), William S. Burroughs&amp;#039;s Naked Lunch (1959) and Jack Kerouac&amp;#039;s On the Road (1957).[1] Both Howl and Naked Lunch were the focus of obscenity trials that ultimately helped to liberalize what could be published in the United States. On the Road transformed Kerouac&amp;#039;s friend Neal Cassady into a youth-culture hero. The members of the Beat Generation quickly developed a reputation as new bohemian hedonists, who celebrated non-conformity and spontaneous creativity.\n\nThe original &quot;Beat Generation&quot; writers met in New York. Later, the central figures (with the exception of Burroughs) ended up together in San Francisco in the mid-1950s where they met and became friends with figures associated with the San Francisco Renaissance. During the 1960s, the rapidly expanding Beat culture underwent a transformation: the Beat Generation gave way to The Sixties Counterculture, which was accompanied by a shift in public terminology from &quot;beatnik&quot; to &quot;hippie&quot;.\n\n\n\nEnjoy and do seed!\n\n","torrent":{"xt":"urn:btih:24cdbedc4332bbbc8a34b2c1a9529a6a0c8e5572","amp;dn":"The+Source+-+A+Documentary+%5B1999%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"24cdbedc4332bbbc8a34b2c1a9529a6a0c8e5572","infoHashBuffer":{"type":"Buffer","data":[36,205,190,220,67,50,187,188,138,52,178,193,169,82,154,106,12,142,85,114]},"announce":[],"urlList":[]}}