{"title":"Return To Labrynth V1-4","uid":8658409,"size":532955886,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:25473f951b428e148e6efbf3d636b1948772b513&amp;dn=Return+To+Labrynth+V1-4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"LeonardTSpock","files":-1,"time":1373264316,"description":"This is manga. The image size for the fourth volume is much smaller, but it's readable and a decent enough scan, so I'm just gonna roll with it.\n\n--------------------------------------------------------------------------------------\n\nReturn To Labrynth V1\nTokyoPop, 2008, 208 pages\nWritten by Jake T Forbes\nIllustrated by Chris Lie\nInked by Jeremy Freeman, Robert Grabe, Alex McCaffrey, Tyler Niccum, Em Stone\nToned by Erfan Fajar Studio\n\nAfter having survived his initial visit, Toby has returned home and has grown up. As he has grown he has noticed that many things have come very easily to him, even when under pressure. Little does he know that Jareth, the Goblin King, has been looking.\n\n\nReturn To Labrynth V2\nTokyoPop, 2007, 192 pages\nWritten by Jake T Forbes\nIllustrated by Chris Lie\nInked by Dyotami Febriani, Rhoald Marcellius\nToned by Infinity Studio\n\nSecrets are revealed as the reign of power passes from one heir to another. Toby has been named the next Goblin King and Lord of the Labyrinth, and the goblins are in an uproar. As heir to Jareth's throne, Toby hopes he can be more successful than he was in the human world, but first he must earn the respect of his subjects and learn to control the Labyrinth. His tutor in leadership and magic is Mizumi, the icy Queen of Moraine, but with each lesson, the young king finds himself drifting further away from his friends. Toby may have what it takes to rule this unruly kingdom, but at what cost?\n\nReturn To Labrynth V3\nTokyoPop, 2009, 192 pages\nWritten by Jake T Forbes\nIllustrated by Chris Lie\nInked by Rhoald Marcellius, Angie Nathalia\nToned by Erfian Asafat, Razi of Infinity, Faisal of Infinity, Beatusvir, Ari Siswanto\n\n....the blurb gave away too much! \n\n\nReturn To Labrynth V4\nTokyoPop, 2010, 208 pages \nWritten by Jake T Forbes\nIllustrated by Chris Lie\nInked by Rhoald Marcellius, Angie Nathalia, Dyotami Febriani\nToned by Erfian Asafat, Razi of Infinity, Faisal of Infinity, Beatusvir\n\nThis is the final volume of the &quot;Return to Labyrinth&quot; saga! The Goblin King has kept a watchful eye on Toby: his minions secretly protecting the child. Legions of goblins work behind the scenes to ensure that Toby has whatever his heart desires, preparing him for the day when he will return to the Labyrinth and take his rightful place beside Jareth as the heir to the Goblin Kingdom. That day has come, but no one has told Toby! Everything that Toby has worked for is in peril. Will he be able to save the Labyrinth and his kingdom?\n","torrent":{"xt":"urn:btih:25473f951b428e148e6efbf3d636b1948772b513","amp;dn":"Return+To+Labrynth+V1-4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"25473f951b428e148e6efbf3d636b1948772b513","infoHashBuffer":{"type":"Buffer","data":[37,71,63,149,27,66,142,20,142,110,251,243,214,54,177,148,135,114,181,19]},"announce":[],"urlList":[]}}