{"title":"Ice.Age.Continental.Drift.Arctic.Games-SKIDROW","uid":7370988,"size":1806123008,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:25aa252eb345b00f60e356b3018e5a94c40edf61&amp;dn=Ice.Age.Continental.Drift.Arctic.Games-SKIDROW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ontotita","files":-1,"time":1340229859,"description":"\nIce Age: Continental Drift - Artic Games (c) Activision\n\n20-06-2012....Release Date - Protection.................SecuROM\nAction...........Game Type - Disk(s)......................1 DVD\n\nRELOADED NOTES\n\nApparently it's comedy season, because the laughable crew RELOADED has\nonce more proved to that scene, that they're clowns of the scene.\n\nFirst of all, their The Dark Eye Chains of Satinav Proper Crack is\nfeaturing untrue informations, because those slower loading times they\nmention in their nfo - isn't even close to our own testing times. Maybe\nit's time to get your slow imaginary PC's replaced. At least boost your\nhardware in your little imaginary world.\n\nWhat's the issue RELOADED? We can do SecuROM reversed and you absolutly\nhave to find. and make up a rule in the scene that does not exist, just\nto be able to find a peakhole to proper us.\n\nAre we propering Steam emulations loading times too? Because we could\nproper alot of yours, if we wanted.\n\nWe could proper Call.of.Duty.Modern.Warfare.3-RELOADED easily because\nof loading times, and no your crackfix for that didn't help with the\nloading times.\n\nTake the lastest Dirt game - when are you going to proper that, because\nour crack loads around 30-40% faster than the crack released into the\nscene.\n\nDear siteops, admins etc - don't listen to RELOADED and their bullshit.\nOur cracks are working and if they're not, RELOADED can proper, but not\nbefore, and with their imaginary laughable reasons.\n\nRELEASE NOTES\n\nGet ready to brave the icy cold glacial games in Ice Age: Continental\nDrift.\n\nWhen their island is set adrift in the midst of continental upheaval,\nManny, Sid, Diego and the herd encounter a ragtag menagerie of\nseafaring pirates with a secret treasure. Having trouble deciding on\nhow to split the treasure evenly, they collectively decide to settle\nthe problem through a series of off-the-wall sporting events including\nski jumping, ice smashing and glacial hopping. Ultimately, the winner\nof the most events will be entitled to the prize.\n\nAs the prehistoric games begin, players must side with Manny and the\nherd, or the seafaring pirates to determine the fate of the riches.\n\nIn Ice Age: Continental Drift, gamers of all ages can use teamwork or\ngo head-to-head as their favourite characters in a motion controlled\ncompetition that's fun for the whole family.\n\nFeatures:\n\nHop, Smash and Dash in 10 wild arctic events including Glacier\nHopping, the Prehistoric Plumber, Bob-Smashing, and Coconut Slingshot\n\nBattle for Prehistoric Plunder and win gold, silver and bronze acorns\n\nClimb to the top of the leaderboard as you challenge your friends in\nfast-paced multi-player action\n\nTest your skills in multiple modes including Story Mode and Free Play\ndesigned to test even the most skilled arctic athletes\n\nINSTALL NOTES\n\n1. Unpack the release\n2. Mount or burn image\n3. Install\n4. Copy everything from the SKIDROW folder into the game installation\n5. Play the game\n6. Support the companies, which software you actually enjoy","torrent":{"xt":"urn:btih:25aa252eb345b00f60e356b3018e5a94c40edf61","amp;dn":"Ice.Age.Continental.Drift.Arctic.Games-SKIDROW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"25aa252eb345b00f60e356b3018e5a94c40edf61","infoHashBuffer":{"type":"Buffer","data":[37,170,37,46,179,69,176,15,96,227,86,179,1,142,90,148,196,14,223,97]},"announce":[],"urlList":[]}}