{"title":"Stanley Milgram's Experiment - 1974","uid":4418793,"size":533018508,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:25fc9436ee9a658f83d152db5086097c09ba34e9&amp;dn=Stanley+Milgram%5C%27s+Experiment+-+1974&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"oddeven","files":1,"time":1222665095,"description":"&quot;Obedience and Individual Responsibility&quot; \n\nStanley Milgram, a psychologist at Yale University, conducted a study focusing on the conflict between obedience to authority and personal conscience. He examined justifications for acts of genocide offered by those accused at the World War II, Nuremberg War Criminal trials. Their defense often was based on &quot;obedience&quot; - - that they were just following orders of their superiors. \nIn the experiment, so-called &quot;teachers&quot; (who were actually the unknowing subjects of the experiment) were recruited by Milgram. They were asked administer an electric shock of increasing intensity to a &quot;learner&quot; for each mistake he made during the experiment. The fictitious story given to these &quot;teachers&quot; was that the experiment was exploring effects of punishment (for incorrect responses) on learning behavior. The &quot;teacher&quot; was not aware that the &quot;learner&quot; in the study was actually an actor - - merely indicating discomfort as the &quot;teacher&quot; increased the electric shocks. \n\nWhen the &quot;teacher&quot; asked whether increased shocks should be given he/she was verbally encouraged to continue. Sixty percent of the &quot;teachers&quot; obeyed orders to punish the learner to the very end of the 450-volt scale! No subject stopped before reaching 300 volts! \n\nAt times, the worried &quot;teachers&quot; questioned the experimenter, asking who was responsible for any harmful effects resulting from shocking the learner at such a high level. Upon receiving the answer that the experimenter assumed full responsibility, teachers seemed to accept the response and continue shocking, even though some were obviously extremely uncomfortable in doing so. The study raised many questions about how the subjects could bring themselves to administer such heavy shocks. More important to our interests are the ethical issues raised by such an experiment itself. What right does a researcher have to expose subjects to such stress? What activities should be and not be allowed in marketing research? Does the search for knowledge always justify such &quot;costs&quot; to subjects? Who should decide such issues? \n\n_______________________________\n\nThanks to the original uploader","torrent":{"xt":"urn:btih:25fc9436ee9a658f83d152db5086097c09ba34e9","amp;dn":"Stanley+Milgram%5C%27s+Experiment+-+1974","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"25fc9436ee9a658f83d152db5086097c09ba34e9","infoHashBuffer":{"type":"Buffer","data":[37,252,148,54,238,154,101,143,131,209,82,219,80,134,9,124,9,186,52,233]},"announce":[],"urlList":[]}}