{"title":"Peter Dickinson - The Kin (pdf)","uid":8498408,"size":3699676,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2752834e7ef1ddfe4c782e802128c266f15157fb&amp;dn=Peter+Dickinson+-+The+Kin+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pharmakate","files":-1,"time":1369201715,"description":"Peter Dickinson - The Kin (Penguin, 2003). 628 pages.\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\n\nPeter Dickinson's young adult historical (or more precisely, prehistorical) tetralogy comprises four novels: \n\nSuth's Story\nNoli's Story\nKo's Story\nMana's Story\n\n\ndescription:\n\nIt is two hundred thousand years ago. A small group of children are cut off from their Kin, the Moonhawks, when they are driven from their &quot;Good Place&quot; by violent strangers. While searching for a new Good Place, they face the parched desert, an active volcano, a canyon flood, man-eating lions, and other Kins they've never seen before. Told from four points of view, with tales of the Kins' creation interspersed throughout, this epic novel humanizes early man and illuminates the beginning of language, the development of skills, and the organization of society. It is a triumphant book from one of the genre's most revered authors.\n\nReview\n\nThe dazzling British writer...spins fascinating fiction. -- The New York Times Book Review\n\nAbout the Author\n\nPeter Dickinson is one of the UK's most acclaimed children's writers. He has won the Carnegie Medal twice, for City of Gold and Tulku, the Whitbread Children's Award twice, for AK and Tulku, and the Guardian Children's Fiction Award for The Blue Hawk. He is the author of many books for children, teenagers and adults. He was one of the three shortlisted candidates for the first Children's Laureate, alongside Anne Fine and Quentin Blake, and was shortlisted for the International Hans Christian Anderson Award in 2000. He lives in Hampshire.\n","torrent":{"xt":"urn:btih:2752834e7ef1ddfe4c782e802128c266f15157fb","amp;dn":"Peter+Dickinson+-+The+Kin+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2752834e7ef1ddfe4c782e802128c266f15157fb","infoHashBuffer":{"type":"Buffer","data":[39,82,131,78,126,241,221,254,76,120,46,128,33,40,194,102,241,81,87,251]},"announce":[],"urlList":[]}}