{"title":"Ted.Hughes.Stronger.Than.Death.720p.HDTV.x264-MVGroup","uid":12553454,"size":1358217689,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:2792c0c0c1906134e7579355add36671a0086a74&amp;dn=Ted.Hughes.Stronger.Than.Death.720p.HDTV.x264-MVGroup&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MVGroup","files":1,"time":1444596801,"description":"Ted Hughes is widely recognised as one of Britain's greatest poets. He is also one of the most controversial. The Heathcliff of poetry who 'attracted more scandal than any other literary figure with the exception of Lord Byron' as one contributor notes. Now, for the first time, the events of his life and the breadth and influence of his poetry are the focus of a major documentary.\r\n\r\nFeaturing the first television interview with Frieda Hughes - poet, artist and daughter of Ted Hughes and Sylvia Path - alongside a rich seam of testimony from family members, friends, fellow poets and writers, this film will illuminate one of the 20th century's most influential cultural figures and show how his compelling life story shaped his vision as a poet.\r\n\r\nHughes's significance is incontrovertible, yet so often during his lifetime, attention was focused on the scandalous events in his personal life. Love and work collided with tragic consequences during his marriage to Sylvia Plath. When she committed suicide, he was forced to weather a storm of speculation and accusation over her death, which gathered momentum after Assia Wevill, his lover, also killed herself.\r\n\r\nHughes's mythic creation Crow proclaims 'But who is stronger than death? Me, evidently', and this film will explore how Hughes's ability to survive the traumas in his own life were bound up in a belief in the power and importance of poetry.\r\n\r\nIt is a journey in which the passions and preoccupations that informed his unique poetic voice - nature, mythology, death and the occult - became increasingly infused with a more personal tone culminating in the searing power of his final volume Birthday Letters - his only account of his life with Plath. Nine months later he was dead.\r\n\r\nIntroduction by Simon Armitage.\r\nReadings by Sean Bean.\r\n\r\nTechnical Spec\r\nVideo Codec: x264 CABAC   \r\nVideo Bitrate: CRF 20 (~1864Kbps)\r\nVideo Resolution: 1280x720\r\nVideo Aspect Ratio: 16:9\r\nFrame Rate: 25 FPS\r\nAudio Codec: AAC-LC\r\nAudio Bitrate: Q=0.45 VBR 48KHz (~128Kbps)\r\nAudio Channels: 2\r\nRun-Time: 89 mins\r\nNumber of Parts: 1\r\nPart Size: 1.26 GB\r\nSource: HDTV\r\nSubtitles: Merged","torrent":{"xt":"urn:btih:2792c0c0c1906134e7579355add36671a0086a74","amp;dn":"Ted.Hughes.Stronger.Than.Death.720p.HDTV.x264-MVGroup","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2792c0c0c1906134e7579355add36671a0086a74","infoHashBuffer":{"type":"Buffer","data":[39,146,192,192,193,144,97,52,231,87,147,85,173,211,102,113,160,8,106,116]},"announce":[],"urlList":[]}}