{"title":"Corbin Fisher - - - Caleb Fucks Ryan ((MictrmbL))","uid":5358314,"size":265451146,"categoryP":"porn","categoryS":"other","magnet":"?xt=urn:btih:27a49536b804ba14b33efeb648691d4ebe7d2237&amp;dn=Corbin+Fisher+-+-+-+Caleb+Fucks+Ryan+%28%28MictrmbL%29%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mictrmbl","files":60,"time":1266015870,"description":"From the vaults of Corbin Fisher:\n\n\nIt's taken awhile for Caleb to come around to the idea of some full-on guy/guy, hardcore sex but, without a doubt, the wait has been worth it! When Caleb first came to shoot a couple solos with us, he made it pretty clear that was all he was interested in doing despite my having asked a few times if he'd be at all interested in going further. As you know, though, I eventually decided to ask one more time if he had any interest in doing a scene with a guy, and to my pleasant surprise he said he'd be up for receiving a bj! Cade delivered a masterful bj for this straight stud's introduction to guy/guy sex, and I think that definitely made Caleb more open to the idea of going even further.\n\nFast forward a few weeks, and I shot Caleb an e-mail again to see if he'd given any thought to doing even more with a guy. Well, the much-anticipated answer was &quot;Sure, why not&quot; (Actually, hehe, it was &quot;Well... how much does that pay?&quot; and then &quot;Sure, why not&quot; after I informed him of the numbers!) Caleb agreed to use that big long dick of his to fuck one of our other CF studs, and I couldn't wait to see this young stud in some hardcore action, finally, after all these months! With Ryan being quite the trooper and such a great performer, I figured he'd be the ideal one to take on Caleb's nice tool and show Caleb just how hot sex with a guy can be!\n\nWith this being straight stud Caleb's first experience in hardcore sex with a guy, I wanted it to be intense and all about the fucking.\n\nRyan was tasked with taking the lead in getting Caleb warmed up and then taking his dick up his tight hole. It's pure sex, and Caleb's cumshot at the end is truly explosive! He just about drowned poor Ryan! :)","torrent":{"xt":"urn:btih:27a49536b804ba14b33efeb648691d4ebe7d2237","amp;dn":"Corbin+Fisher+-+-+-+Caleb+Fucks+Ryan+%28%28MictrmbL%29%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"27a49536b804ba14b33efeb648691d4ebe7d2237","infoHashBuffer":{"type":"Buffer","data":[39,164,149,54,184,4,186,20,179,62,254,182,72,105,29,78,190,125,34,55]},"announce":[],"urlList":[]}}