{"title":"Codes-The Guide to Secrecy from Ancient to Modern Times","uid":4429034,"size":5655671,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:27dcd9f47f025ed5849759bf794c302440284a1a&amp;dn=Codes-The+Guide+to+Secrecy+from+Ancient+to+Modern+Times&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"philmccrevice","files":1,"time":1223190421,"description":"This book has been written with a broad spectrum of readers in mind, which\nincludes anyone interested in secrecy and related issues. Thus, this is a tome\nfor the merely curious, as well as history-minded readers, amateur mathematicians,\nengineers, bankers, academics, students, those practitioners working in\ncryptography, specialists in the field, and instructors wanting to use the book\nfor a text in a course on a variety of topics related to codes. We will look at\nthis topic from all aspects including not only those related to cryptography (the\nstudy of methods for sending messages in secret), but also the notion of codes\nas removal of noise from telephone channels, satellite signals, CDs and the like.\nThe uninitiated reader may consider the following. Imagine a world where\nyou can send a secret message to someone, and describe to anyone listening\nin precise detail how you disguised the message. Yet that person could not\nremove the disguise from that message no matter how much time or how many\nresources are available. Well, that world exists in the here and now, and the\nmethodology is called public-key cryptography. It permeates our lives, from the\nuse of a bank card at an automated teller machine ATM to the buying of items\nor bank transactions over the Internet. You can even purchase items over the\nInternet and do so anonymously, as you would using hard cash. In this book,\nyou will find out how this is done.","torrent":{"xt":"urn:btih:27dcd9f47f025ed5849759bf794c302440284a1a","amp;dn":"Codes-The+Guide+to+Secrecy+from+Ancient+to+Modern+Times","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"27dcd9f47f025ed5849759bf794c302440284a1a","infoHashBuffer":{"type":"Buffer","data":[39,220,217,244,127,2,94,213,132,151,89,191,121,76,48,36,64,40,74,26]},"announce":[],"urlList":[]}}