{"title":"Quartier Lointain (2010)(Retail)(DD5.1)(NL SUBS) TBS Betty Boop","uid":6847465,"size":4248639395,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:296cf8826cd91dba07eb90fe04f407e2116cc468&amp;dn=Quartier+Lointain+%282010%29%28Retail%29%28DD5.1%29%28NL+SUBS%29+TBS+Betty+Boop&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Betty-Boop","files":-1,"time":1322402437,"description":"Quartier Lointain (2010)\n\n\nAlternatieve titel: A Distant Neighborhood\n\n\n\nTagline:\nA grown man wakes up to discover he is a teenager again.\n\nLand: BelgiÃƒÂ« / Luxemburg / Frankrijk / Duitsland\nGenre: Drama / Fantasie\nLengte: 98 minuten\n\nActeurs: Pascal Greggory, Jonathan ZaccaÃƒÂ¯ en Alexandra Maria Lara\n\nWaardering:\nMoviemeter: 3,35\nIMDB: 6.9/10\n\nLiefhebbers van een avondje film, vergeet niet dat er naast de grote &quot;Hollywoodreleases&quot; nog tig &quot;andere&quot; (kwaliteits) films zijn. Kleinere filmparels uit alle hoeken van de wereld, films die zich onderscheiden van de massa door een eigenzinnige filmtaal en een rijke inhoud, films die je raken ....\n\n\nDeze film geregisseerd door Sam Garbarski, is een verfilming van de gevierde mangastrip van de Japanner Jiro Taniguchi (Herinneringen). De muziek is van Air.\n\nSamenvatting:\nAls Thomas per toeval in zijn geboortestad terecht komt, bevindt hij zich opeens in het verleden. Hij beleeft zijn jeugd opnieuw als 40 jarige in het lichaam van een veertienjarige. In deze situatie probeert hij erachter te komen waarom zijn vader destijds het gezin verliet.\n\nRecensie:\nEen strip overbrengen naar het witte doek is op zich al riskant genoeg, daarbij het verhaal ook nog eens verplaatsen van een Aziatische setting naar een Westerse lijkt nog gewaagder. Garbarski slaagt er echter in de essentie te behouden en levert een opvallend ingetogen en betoverende prent af.\n\nBijna iedereen vraagt het zich gedurende zijn leven wel eens af: hoe zou het zijnom met de kennis van nu weer eens terug te keren naar vroeger? Zou je dingen anders doen, zou je meer je best doen om van de mensen om je heen te houden, zou je bewuster in het leven staan? Thomas Verniaz krijgt die kans en hij probeert dat alles inderdaad.\n\nMet het gegeven van een terugkeer in de tijd kun je in feite 2 kanten op in een film. Of je maakt er een film vol met speciale effecten van, waardoor het fantasy-element versterkt wordt, of je gaat voor een subtielere oplossing. Garbarski kiest voor dat laatste en dat doet waarschijnlijk het meeste recht aan de boodschap van het verhaal. Veel meer dan een terugkeer in de tijd om gedane zaken een andere wending proberen te geven, is Quartier Lointain een film waarin de hoofdpersoon zich bewuster wordt van zijn verleden en de keuzes die hij en zijn ouders vroeger maakten.\n\nDe kracht van de film zit hem vooral in de manier waarop Thomas tot nadenken wordt gedwongen en daardoor jij zelf als toeschouwer ook. De prachtige beelden van het Franse Nantua, waar de film is opgenomen, en de dromerige muziek versterken de bijzondere sfeer. Quartier Lointain duikt in het warme bad van de nostalgie en verdrinkt er niet in: het verleden blijft na deze film even ongrijpbaar als voorheen, maar de film helpt wel om juist daar even bij stil te staan. Topper!\n\nVerhaal:\nThomas Verniaz is een bekend striptekenaar van middelbare leeftijd. Zijn leven lijkt wat in een sleur geraakt, en een midlifecrisis loert om de hoek. Wanneer hij na een stripbeurs in de verkeerde trein stapt komt hij in zijn geboortedorp uit, waar hij enkele uren moet wachten op de trein naar Parijs. Hij komt een vriend van vroeger tegen en neemt de tijd om het graf van zijn moeder te bezoeken. Op de begraafplaats heeft hij een vreemde ervaring: hij komt ten val, en als hij weer opstaat bevindt hij zich plotseling in zijn jeugd, en is hij opnieuw 14 jaar oud.\n\nHij keert terug naar zijn ouderlijk huis en daar beleeft hij de meest zwarte dagen uit zijn kindertijd nog een keer. Hij krijgt de kans op Sylvie Dumontelle af te stappen, het meisje waarop hij altijd heimelijk een oogje had. Maar nog belangrijker, Thomas krijgt de kans ook om zijn vader ervan te weerhouden op de avond van diens verjaardag de trein naar Parijs te pakken en voorgoed uit het leven van zijn vrouw en twee kinderen te verdwijnen. Zal hij in staat zijn de loop van zijn familiegeschiedenis te veranderen en zo te voorkomen dat zijn moeder van verdriet op jonge leeftijd sterft?\n\n\nEnglish\n\nStoryline\n\nA grown man wakes up to discover he is a teenager again. \n\nTechnische specificaties:\nBron: Retail\nTaal: Frans\nAudio: DD 5.1\nOndertitels: Nederlands\n\nMet dank en alle eer voor de originele poster\n\n\n &lt;a href=&quot; http://www.quartierlointain-lefilm.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.quartierlointain-lefilm.com&lt;/a&gt; &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/67325&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/67325&lt;/a&gt; &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1266037&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1266037&lt;/a&gt;\n\n@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@\n\nKom ook eens kijken :\n        &lt;a href=&quot;\nhttp://black-sam.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://black-sam.org&lt;/a&gt;\nEnjoy\n\n@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@","torrent":{"xt":"urn:btih:296cf8826cd91dba07eb90fe04f407e2116cc468","amp;dn":"Quartier+Lointain+%282010%29%28Retail%29%28DD5.1%29%28NL+SUBS%29+TBS+Betty+Boop","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"296cf8826cd91dba07eb90fe04f407e2116cc468","infoHashBuffer":{"type":"Buffer","data":[41,108,248,130,108,217,29,186,7,235,144,254,4,244,7,226,17,108,196,104]},"announce":[],"urlList":[]}}