{"title":"The Witching Hour","uid":5117928,"size":1398122795,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:297aa7f516170d9a8e3bd0e7fbb063d9680a4d4d&amp;dn=The+Witching+Hour&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"brodahisou","files":-1,"time":1255167848,"description":"The Witching Hour was a DC comic book horror anthology that ran from 1969 to 1978.  Its tagline was &quot;It's 12 o'clock... The Witching Hour!&quot; (changed to &quot;It's midnight... The Witching Hour!&quot; after about a year).  The series was originally edited by Dick Giordano, but it was taken over by Murray Boltinoff with issue #14.\nStories in the comic were &quot;hosted&quot; and introduced by three witches, based on Macbeth's Weird Sisters: Morded, Mildred, and Cynthia. (The witches defined the archetypal Maiden/Mother/Crone (in reverse order) triumverate of womanhood.)\nAfter The Witching Hour's cancellation, it was merged with The Unexpected, until issue #209. The witches were later revived - along with the hosts of the companion series House of Secrets and House of Mystery -as important characters in Neil Gaiman's The Sandman.\n\nIn 2000 Jeph Loeb, Chris Bachalo and Art Thiber produced a three-issue mini-series entitled The Witching Hour under the Vertigo imprint.  The series featured the mysterious Amanda Collins who would give people the chance to change their lives, but the choice they make will depend entirely on the forces that already exist in their hearts.\n\n\n\nReleased on http://ComicPirates.info","torrent":{"xt":"urn:btih:297aa7f516170d9a8e3bd0e7fbb063d9680a4d4d","amp;dn":"The+Witching+Hour","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"297aa7f516170d9a8e3bd0e7fbb063d9680a4d4d","infoHashBuffer":{"type":"Buffer","data":[41,122,167,245,22,23,13,154,142,59,208,231,251,176,99,217,104,10,77,77]},"announce":[],"urlList":[]}}