{"title":"Nat Adderley - Introducing Nat Adderley (1955) @320","uid":5491691,"size":105020514,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:297a408985d2efa1bca48f335542e861f199c6e1&amp;dn=Nat+Adderley+-+Introducing+Nat+Adderley+%281955%29+%40320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"artpepper","files":-1,"time":1271062973,"description":"Nat Adderley - Introducing Nat Adderley (1955)\n\nMp3 320 kbps\n\n\n\n\n\nThe Adderley brothers were key players in the birth of hard bop, a style which grew out of the advancements of Bud Powell and other pioneers who formed a sound that many artists took to the bank for years. At this point in time Cannonball had formed his first quintet with Nat as a sideman; facing indifferent recognition, Cannonball went on to join Miles Davis and met with far greater acclaim. \n\n\n\nThe two would later reunite in the second Cannonball Adderley quintet with much greater success; after his stint with Davis, the public was much more receptive to what Cannonball had to say. This album is a bit unusual in that Nat is the leader and Cannonball is the sideman, although since the altoist is such a pervasive influence and all the tunes we co-written by the two, the distinction of who is in charge makes little difference.\n\n\n\nThe Adderley brothers were always at their best working in the hard bop vein. Although they specialized in different instruments, their styles were remarkably similar; playful and lively, with a generous helping of the blues. \n\n\n\nThey wear their Parker-Gillespie influences on their sleeves, trading off fluttering arpeggios and staccato runs at a rapid fire pace, and obviously prefer sticking to the higher register given their choice of instruments (Nat is one of the few jazz players to specialize in the cornet). \n\n\n\nMost of the songs here are skillfully designed to exploit the talents of both, although they are interchangeable with hundreds of other hard bop themes from the era. However, they truly seem to be enjoying themselves here, indulging their love of playing jazz.\n\n\n\nYou would also be hard pressed to find a rhythm section better than the one assembled here; all three were highly regarded sidemen who amongst them have probably appeared on over a third of all sessions recorded during this period. Horace Silver would go on to record greasy soul anthems for the hard bop generation like &quot;Song For My Father&quot;; his sharp attack provides a bed of nails for the horns to blow over. \n\n\n\n\nTracklist\n\n\n\n\n01 Watermelon (2:44) (J. &amp; N. Adderley)\n02 Little Joanie Walks (4:01) (J. &amp; N. Adderley)\n03 Two Brothers (3:29) (J. &amp; N. Adderley)\n04 I Should Care (4:25)(Cahn, Sterdal &amp; Weston)\n05 Crazy Baby (5:59) (J. &amp; N. Adderley)\n06 New Arrivals (6:38) (J. &amp; N. Adderley)\n07 Sun Dance (3:48) (J. &amp; N. Adderley)\n08 Fort Lauderdale (3:18) (J. &amp; N. Adderley)\n09 Friday Nite (3:11) (J. &amp; N. Adderley)\n10 Blues For Bohemia (5:21) (J. &amp; N. Adderley)\n\n\n\n\n\nNat Adderley, Trumpet\nJulian (Cannonball) Adderley, Alto sax\nHorace Silver, Piano\nRoy Haynes, Drums\nPaul Chambers, Bass\n\n\n\n\nRecorded in New York on September 6, 1955\n\n","torrent":{"xt":"urn:btih:297a408985d2efa1bca48f335542e861f199c6e1","amp;dn":"Nat+Adderley+-+Introducing+Nat+Adderley+%281955%29+%40320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"297a408985d2efa1bca48f335542e861f199c6e1","infoHashBuffer":{"type":"Buffer","data":[41,122,64,137,133,210,239,161,188,164,143,51,85,66,232,97,241,153,198,225]},"announce":[],"urlList":[]}}