{"title":"The Gap  by Thomas Suddendorf","uid":9343211,"size":10808185,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:29d257ae4677c362b4ccc43a31db42de535b60dc&amp;dn=The+Gap++by+Thomas+Suddendorf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"7","files":-1,"time":1386973910,"description":"The Gap: The Science of What Separates Us from Other Animals by Thomas Suddendorf\n\n\nFormat: mobi/epub/azw3\nLength: 368 pages\nGenre: Non-Fiction/Biology/Evolution\nDate: 12 November 2013\n\nThere exists an undeniable chasm between the capacities of humans and those of animals, but what exactly is the difference between our minds and theirs?\n\nIn The Gap, psychologist Thomas Suddendorf provides a definitive account of what makes human minds unique and how this disparity arose. He proposes that two innovations account for all of the ways in which our minds appear so distinct: our open-ended ability to imagine and reflect, and our insatiable drive to link our minds together. It is not language or morality that set us apart, but the ability to consider a range of scenarios, real and imagined, past and future.\n\nSuddendorf concludes with the provocative suggestion that our unrivalled status may be our own creation - and that the gap is growing wider not so much because we are becoming smarter but because we are killing off our closest intelligent animal relatives.\n\nA provocative argument for reconsidering our place in nature, The Gap is essential reading for anyone interested in our evolutionary origins and our relationship with the rest of the animal kingdom.\n\nAuthor:\n\nThomas Suddendorf is a professor of psychology at the University of Queensland whose research has attracted honors and awards from such organizations as the American Psychological Association, the Academy of the Social Sciences in Australia, and the Association for Psychological Science. His work has been covered by the New York Times, Discover, and Science, among other outlets. Born and raised in Germany, he lives in Brisbane, Australia.","torrent":{"xt":"urn:btih:29d257ae4677c362b4ccc43a31db42de535b60dc","amp;dn":"The+Gap++by+Thomas+Suddendorf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"29d257ae4677c362b4ccc43a31db42de535b60dc","infoHashBuffer":{"type":"Buffer","data":[41,210,87,174,70,119,195,98,180,204,196,58,49,219,66,222,83,91,96,220]},"announce":[],"urlList":[]}}