{"title":"Pat Boone - The Fifties Collection CD 4 of 6 [1997/192kbps]","uid":3349994,"size":108243232,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2a2210dd672ff9b262806bf5174dcfefc36f07c2&amp;dn=Pat+Boone+-+The+Fifties+Collection+CD+4+of+6+%5B1997%2F192kbps%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"metro20","files":31,"time":1120041333,"description":"By 1957 Pat Boone's popularity had skyrocketed and the movie and television producers began to come calling. He appeared in 15 films, including Bernardine, April Love, and State Fair. From 1957 to 1960 he hosted his own television series The Pat Boone/Chevy Showroom. He somehow managed to finish his degree, graduating from Columbia University in New York City in 1958. And all the while, the hits kept coming: Why Baby Why, Love Letters In The Sand [which held the number one spot for seven weeks], and April Love [number one for six weeks] were huge hits in 1957. The following year he continued to put records in the top ten, including A Wonderful Time Up There and Sugar Moon. \nIn 1959 and 1960 Pat Boone continued to sell many records, although his production of top ten songs slowed down a bit. Some of his songs during this period included With The Wind And The Rain In Your Hair and Twixt Twelve and Twenty. In 1961 he came back with Moody River, which was to be his fifth and final number one song. His final top forty song was a novelty record, Speedy Gonzalez in 1962. The female backing voice on this song was Robin Ward, and it peaked at number six.","torrent":{"xt":"urn:btih:2a2210dd672ff9b262806bf5174dcfefc36f07c2","amp;dn":"Pat+Boone+-+The+Fifties+Collection+CD+4+of+6+%5B1997%2F192kbps%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2a2210dd672ff9b262806bf5174dcfefc36f07c2","infoHashBuffer":{"type":"Buffer","data":[42,34,16,221,103,47,249,178,98,128,107,245,23,77,207,239,195,111,7,194]},"announce":[],"urlList":[]}}