{"title":"Like-Minded -Sneddon- [Philosophy] [Non-Fiction] PDF_(K-Slender)","uid":8952816,"size":4047158,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2a49b62f7a85f1ede8f927838853adba50e8936f&amp;dn=Like-Minded+-Sneddon-+%5BPhilosophy%5D+%5BNon-Fiction%5D+PDF_%28K-Slender%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"K-Slender","files":3,"time":1379926806,"description":"\nHardcover: 296 pages\nPublisher: The MIT Press; First Edition edition (August 12, 2011)\nLanguage: English\nISBN-10: 0262016117\nISBN-13: 978-0262016117\n\nWhat are the psychological foundations of morality? Historically, the issue has been framed as one of emotion versus reason. Hume argued that reason is the slave of the passions and so morality must be based on them; Kant argued that moral law is given by rational agents to themselves in virtue of their rationality. The debate has continued in these terms to the present day. In Like-Minded, Andrew Sneddon argues that &quot;reason&quot; and &quot;passion&quot; do not satisfactorily capture all the important options for explaining the psychological foundations of morality. He proposes a third possibility: that the cognitive processes that make us moral agents are centrally constituted by features of our external environments. Sneddon calls this the Wide Moral Systems Hypothesis (WMSH).\n\nThe WMSH fits within an array of positions known as externalism or the Extended Mind Hypothesis, according to which the world outside our bodies is not just input to cognitive processes located within our brains but partially constitutes those processes. After explaining the WMSH, Sneddon presents a series of more particular hypotheses about distinct aspects of our moral psychology: moral judgment, moral reasoning, the attribution of moral responsibility, and production of action. Sneddon revisits overlooked externalist aspects of moral psychology, noting the integration of agent and environment found in existing research. With Like-Minded, Sneddon offers an innovative contribution to work in both moral psychology and the Extended Mind Hypothesis. ","torrent":{"xt":"urn:btih:2a49b62f7a85f1ede8f927838853adba50e8936f","amp;dn":"Like-Minded+-Sneddon-+%5BPhilosophy%5D+%5BNon-Fiction%5D+PDF_%28K-Slender%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2a49b62f7a85f1ede8f927838853adba50e8936f","infoHashBuffer":{"type":"Buffer","data":[42,73,182,47,122,133,241,237,232,249,39,131,136,83,173,186,80,232,147,111]},"announce":[],"urlList":[]}}