{"title":"[040722][PS2][SLPM-65621] Street Fighter III 3rd Strike (J)","uid":4891626,"size":544310172,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:2a57091e63558244db333cc7d2dff1567f311626&amp;dn=%5B040722%5D%5BPS2%5D%5BSLPM-65621%5D+Street+Fighter+III+3rd+Strike+%28J%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"Totenkruez","files":1,"time":1242032041,"description":"Released on May 1999, the third and final installment of the Street Fighter III brought back the classic Street Fighter II character Chun-Li, along with four new characters, and Gill could be unlocked as a playable character extending the selectable roster to 20 characters (with Akuma now a regular character). All of the returning characters from the previous Street Fighter III games were given new stages, endings and even voice actors, continuing the overall storyline from where the first two games left off.\n\nThe commands for Air Parries, Throws/Holds and Leap Attacks were changed from 2nd Impact. Additionally, the player can perform a &quot;Guard Parry&quot; or a Parry during a Guard Stun if the timing is right. A &quot;Guard Parry&quot; is also known as a &quot;Red Parry&quot; due to the fact that the character turns red when performing it. The game also introduces a grade-based &quot;Judgement System&quot;, in which the winning player in a single or two-player match is graded after the match based on Offense, Defense, Techniques and Extra Points. Special Points are also awarded after fulfilling special requirements.\n\nThe single player mode consists of ten regular opponents, which includes a character-specific rival as the penultimate opponent and Gill as the final boss for all the characters. Despite his status as a regularly selectable character, the CPU version of Q can only be fought in the single-player mode as a secret challenger. The &quot;Parry the Ball&quot; minigame from 2nd Impact returns as well as a new version of the &quot;Crush the Car&quot; minigame from Street Fighter II.","torrent":{"xt":"urn:btih:2a57091e63558244db333cc7d2dff1567f311626","amp;dn":"%5B040722%5D%5BPS2%5D%5BSLPM-65621%5D+Street+Fighter+III+3rd+Strike+%28J%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2a57091e63558244db333cc7d2dff1567f311626","infoHashBuffer":{"type":"Buffer","data":[42,87,9,30,99,85,130,68,219,51,60,199,210,223,241,86,127,49,22,38]},"announce":[],"urlList":[]}}