{"title":"Gwen Stefani feat. Akon - The Sweet Escape  (2nafish)","uid":5386481,"size":176164868,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:2a6dbe1e8fcebc184f9015f8b8fd063616d86b64&amp;dn=Gwen+Stefani+feat.+Akon+-+The+Sweet+Escape++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1266914438,"description":"File Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 8000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;The Sweet Escape&quot; is a pop song written by Gwen Stefani, Akon, and Giorgio Tuinfort for Stefani's second solo album The Sweet Escape (2006). Akon developed the song's beat before collaborating with Stefani. He designed it based on her previous work with No Doubt, and Stefani later commented that it put her &quot;on the yellow brick road to the No Doubt record I might do.&quot; &quot;The Sweet Escape&quot;, which features elements of doo-wop, Synthpop, New Wave, and ska music, is an apology for a fight between two lovers and describes a dream of a pleasant life for them. As the album's title track, its title was chosen to help market Stefani's music and fashion lines.\n\nThe song generally received positive reviews from contemporary music critics, though there was a negative response to Akon's presence as a featured artist. &quot;The Sweet Escape&quot; was released as the album's second single in early 2007 and was commercially successful in mainstream and adult contemporary markets. It entered the top ten of most singles charts and topped the New Zealand Singles Chart. The song was nominated for Best Pop Collaboration with Vocals at the 50th Grammy Awards. In the song's accompanying music video, Stefani attempts to escape from a golden prison.\n\nThe song's music video premiered on January 10, 2007 on LAUNCHcast. The video opens with scenes of Stefani and the Harajuku Girls in a golden jail. After obtaining the key from a dog, they escape. Stefani is then shown in a penthouse two hours later. She lets down two long braids, allowing the Harajuku Girls to scale the building and cut off the braids. They meet Akon at a parking lot, and Stefani drives off with him. They are pursued by two of the Harajuku Girls as police officers, and the video closes with Stefani back in jail after two hours of chasing. The video is intercut with sequences of Stefani and Akon in front of a letter G in lights.\n\nThe video was filmed in December 2006, several days before Christmas. It was directed by Joseph Kahn and produced by Maryann Tenado of H.S.I. Productions. The jail and penthouse scenes in the video are symbolic of &quot;being jailed by love&quot;. Stefani being unable to escape her metaphoric prisons represents how one cannot escape from oneself. The penthouse scene is an allusion to the nineteenth century fairy tale &quot;Rapunzel&quot;. The video features product placement for two General Motors vehicles, the 2007 Chevrolet Tahoe and the Buick Lucerne.\n\n&quot;The Sweet Escape&quot; premiered on MTV's top-ten video chart program Total Request Live at number seven January 16, 2007, and it peaked at number two the next month. The video was nominated for Most Earthshattering Collaboration, one of four categories created for the reinvented 2007 MTV Video Music Awards, but lost to BeyoncÃƒÂ© Knowles and Shakira's &quot;Beautiful Liar&quot;. After its January 20 debut on MuchMusic's Countdown, it reached number one for two weeks in March 2007. In December 2007, MTV International introduced a certification system to recognize music videos that were successful on stations outside the U.S. Plays were totaled from February through June 2007, and with 11,000 plays, &quot;The Sweet Escape&quot; was the most successful video, receiving a platinum award.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:2a6dbe1e8fcebc184f9015f8b8fd063616d86b64","amp;dn":"Gwen+Stefani+feat.+Akon+-+The+Sweet+Escape++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2a6dbe1e8fcebc184f9015f8b8fd063616d86b64","infoHashBuffer":{"type":"Buffer","data":[42,109,190,30,143,206,188,24,79,144,21,248,184,253,6,54,22,216,107,100]},"announce":[],"urlList":[]}}