{"title":"Ross Mackintosh - Seeds","uid":8653037,"size":43612152,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:2ac734a7fea98228568b2c00f47722e4536f0c53&amp;dn=Ross+Mackintosh+-+Seeds&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"LeonardTSpock","files":-1,"time":1373151796,"description":"'Seeds'\n\nCom.x, 2011, 80 pages\n\nWritten and Illustrated by Ross Mackintosh\n\nIn July 2009, Ross Mackintosh learned that his father had contracted cancer. Beginning with the diagnosis, then taking us through the journey of his father s decline and eventual passing, Seeds is a touching tribute and powerful, autobiographical account of one man's experience, combining humor, sadness, philosophy and honesty. A portion of the royalties from the sale of this book will be appropriated for selected Cancer charities.\n\nTelling the truth usually isn't nearly as easy as most of us think. When the truth is told in a work of autobiographical art, it stands out as something particularly rare and noteworthy. This sense of truth telling is what gives Mackintosh's thoughtful, spare account of his father's death from cancer such a potent punch. In neatly compacted, simply drawn square frames, Mackintosh tells of how his father - affectionately memorialized as a guy who wanted little more from life than to not have to work too hard - was diagnosed in rapid succession with two different kinds of cancer. As Mackintosh and his mother come to grips with his father's impending death, he details in quick, deglamorized strokes the stages of treatment and decline from hospital to home to hospice. Mackintosh also comes to grips with his own sense of mortality, speaking directly to the reader and (much less successfully) dialoguing with a philosophy-prone friend, while evading completely the feel-good bromides or false, eliding profundities so common to graphic memoirists. The book's ability to take on a dismally grim topic with such forthright sincerity is ultimately much less depressing than it is hopeful and even revelatory","torrent":{"xt":"urn:btih:2ac734a7fea98228568b2c00f47722e4536f0c53","amp;dn":"Ross+Mackintosh+-+Seeds","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ac734a7fea98228568b2c00f47722e4536f0c53","infoHashBuffer":{"type":"Buffer","data":[42,199,52,167,254,169,130,40,86,139,44,0,244,119,34,228,83,111,12,83]},"announce":[],"urlList":[]}}