{"title":"Stan Getz - Quartets - 1950 - 320Kbps # DrBn","uid":9386732,"size":101204218,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2ad15f527be802e7a50170b1bdafcbe21342c7f1&amp;dn=Stan+Getz+-+Quartets+-+1950+-+320Kbps+%23+DrBn&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"Drebben","files":16,"time":1387817023,"description":"After gaining initial fame with Woody Herman's band, Stan Getz went solo in the late '40s, hitting his zenith during the bossa nova craze of the early '60s. Before scoring with &quot;Girl From Ipanema,&quot; though, Getz established himself with a slew of fine dates for Prestige and Verve, including this one from 1950. At the time, Getz's cool, Lester Young-inspired sound was becoming more distinct and harmonically varied, featuring the beautifully mellifluous tone he would soon turn into his trademark. Getz's airy approach is optimally heard on Quartets' many ballad standards, including stellar versions of &quot;My Old Flame&quot; and &quot;What's New.&quot; He even pens the standout ballad of the set, &quot;Mar-cia,&quot; while demonstrating his varied writing skills with the original swinger &quot;Crazy Chords.&quot; Other highlights include medium cookers like &quot;There's a Small Hotel&quot; and &quot;Too Marvelous for Words&quot; and the Latin-tinged &quot;Lady in Red&quot; (a sort of minor classic and admittedly one of Getz's favorites). Getz is ably supported by top players throughout, including pianist Al Haig, bassist Percy Heath, and drummer Roy Haynes.\n\nAlthough the sound is not crystal clear (this is, after all, the early days of the LP), Quartets is still a very enjoyable set. Those new to his work, though, might want to start in with later, better-sounding releases on Verve . . .\n\n\n\nSTAN GETZ\n\nQuartets     1950\n\n- CD\n- 320Kbps\n\n\nRecorded in New York in 1949 and 1950\n","torrent":{"xt":"urn:btih:2ad15f527be802e7a50170b1bdafcbe21342c7f1","amp;dn":"Stan+Getz+-+Quartets+-+1950+-+320Kbps+%23+DrBn","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ad15f527be802e7a50170b1bdafcbe21342c7f1","infoHashBuffer":{"type":"Buffer","data":[42,209,95,82,123,232,2,231,165,1,112,177,189,175,203,226,19,66,199,241]},"announce":[],"urlList":[]}}