{"title":"The Pipkins - Gimme Dat Ding (1970 Bubblegum Pop)","uid":4876012,"size":26902384,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2b079a15953d03de7704acaba18f2e59d1d8225e&amp;dn=The+Pipkins+-+Gimme+Dat+Ding+%281970+Bubblegum+Pop%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Iron_Horse","files":13,"time":1241129686,"description":"The Pipkins - Gimme Dat Ding (1970 Bubblegum Pop)\nLP To Mp3 192 mbit/s\nIncluded: LP Covers and this Info\n\nThe Pipkins were a short-lived novelty duo, best known for their hit single &quot;Gimme Dat Ding&quot; (Albert Hammond/Mike Hazelwood), which reached No. 6 in the UK Singles Chart in 1970. They were Roger Greenaway, best known as a member of several songwriting teams as evidenced by the track listing, and Tony Burrows (singer), who had fronted several groups (often simultaneously) such as Edison Lighthouse, White Plains, The First Class and Brotherhood of Man. The Pipkins also released two follow-ups as singles, &quot;Yakety Yak&quot; and &quot;Are You Cooking, Goose?&quot;, but without success. &quot;My Baby Loves Lovin'&quot; had been a hit for White Plains, whilst &quot;Sunny Honey Girl&quot; was a Top 20 hit for Cliff Richard in 1971. &lt;a href=&quot; http://en.wikipedia.org/wiki/The_Pipkins&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://en.wikipedia.org/wiki/The_Pipkins&lt;/a&gt;\n\nBiography\tby Jason Ankeny  allmusic.com\nRemembered almost exclusively for the 1970 novelty smash &quot;Gimme Dat Ding,&quot; the Pipkins were another in a long series of one-hit wonders to feature bubblegum pop king Tony Burrows. The British session singer dominated pop charts on both sides of the Atlantic throughout much of 1970, albeit anonymously -- his lead vocals were also featured on Edison Lighthouse's &quot;Love Grows (Where My Rosemary Goes)&quot; and White Plains' &quot;My Baby Loves Lovin',&quot; and in February Burrows became the first and only performer ever to appear on the BBC's Top of the Pops fronting three different acts in one episode. The Pipkins paired Burrows with pop songwriter Roger Greenaway, whose extensive rÃƒÂ©sumÃƒÂ© included such blockbusters as Gene Pitney's &quot;Something's Gotten Hold of My Heart&quot; and the Hollies' &quot;Long Cool Woman in a Black Dress.&quot; The nonsensical &quot;Gimme Dat Ding,&quot; with its tongue-in-cheek voices and rollicking, boogie-woogie piano, reached number six on the pop charts, and at mid-year EMI's budget imprint Music for Pleasure issued the Pipkins' sole LP, a split release with then-fledgling glam rock outfit the Sweet, also titled Gimme Dat Ding. Two subsequent Pipkins singles -- a cover of the Coasters' classic &quot;Yakety Yak&quot; and &quot;Are You Cooking, Goose?&quot; -- both flopped and Burrows and Greenaway each moved on to their next studio sessions. &quot;Gimme Dat Ding&quot; nevertheless earned immortality as the theme for the British children's television series Oliver in the Overworld, and was also a staple of the long-running sketch comedy series The Benny Hill Show. \n\nTracklist:\n01. Here Come De Kins\n02. Sunny Honey Girl\n03. Busy Line\n04. Yakety Yak\n05. Gimme Dat Ding\n06. The People Dat You Wanna Phone Ya !\n07. My Baby Loves Lovin'\n08. Are You Cookin' Goose\n09. You Can't Go Wrong\n10. All You'll Ever Get From Me","torrent":{"xt":"urn:btih:2b079a15953d03de7704acaba18f2e59d1d8225e","amp;dn":"The+Pipkins+-+Gimme+Dat+Ding+%281970+Bubblegum+Pop%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b079a15953d03de7704acaba18f2e59d1d8225e","infoHashBuffer":{"type":"Buffer","data":[43,7,154,21,149,61,3,222,119,4,172,171,161,143,46,89,209,216,34,94]},"announce":[],"urlList":[]}}