{"title":"The Ultimate Book of Saturday Science: The Very Best Backyard","uid":8685549,"size":12066061,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2b0a7382e6494c4917f05ba355c41d08cfd709d7&amp;dn=The+Ultimate+Book+of+Saturday+Science%3A+The+Very+Best+Backyard&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1373792427,"description":" Neil A. Downie, &quot;The Ultimate Book of Saturday Science: The Very Best Backyard Science Experiments You Can Do Yourself&quot;\nEnglish | ISBN: 0691149666 | 2012 | EPUB | 576 pages | 11,5 MB\n\nThe Ultimate Book of Saturday Science is Neil Downie's biggest and most astounding compendium yet of science experiments you can do in your own kitchen or backyard using common household items. It may be the only book that encourages hands-on science learning through the use of high-velocity, air-driven carrots.\n\nDownie, the undisputed maestro of Saturday science, here reveals important principles in physics, engineering, and chemistry through such marvels as the Helevator--a contraption that's half helicopter, half elevator--and the Rocket Railroad, which pumps propellant up from its own track. The Riddle of the Sands demonstrates why some granular materials form steep cones when poured while others collapse in an avalanche. The Sunbeam Exploder creates a combustible delivery system out of sunlight, while the Red Hot Memory experiment shows you how to store data as heat. Want to learn to tell time using a knife and some butter? There's a whole section devoted to exotic clocks and oscillators that teaches you how.","torrent":{"xt":"urn:btih:2b0a7382e6494c4917f05ba355c41d08cfd709d7","amp;dn":"The+Ultimate+Book+of+Saturday+Science%3A+The+Very+Best+Backyard","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b0a7382e6494c4917f05ba355c41d08cfd709d7","infoHashBuffer":{"type":"Buffer","data":[43,10,115,130,230,73,76,73,23,240,91,163,85,196,29,8,207,215,9,215]},"announce":[],"urlList":[]}}