{"title":"Learning and Memory: The Brain in Action","uid":4561896,"size":13254411,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2b5caae81d2bba77938bf91c72df8619b99af4cf&amp;dn=Learning+and+Memory%3A+The+Brain+in+Action&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"reegzzz","files":-1,"time":1228707250,"description":"\t \n\nBrowsing Options:\n\nBrain research is much in the news, but what is its relevance in the classroom? Are there ways to take what brain researchers are discovering about learning and memory and apply it to the situations that educators face every day? Practicing teacher and author Marilee Sprenger tells how to do just that in this book. Sprenger has spent years studying neurological research and training other educators in brain-compatible teaching methods. \n\nThis background, combined with her long career as a classroom teacher, has given her priceless knowledge of what works in a multitude of\nclassroom situations. Current brain research is as amazing as it can be confusing. This book discusses in plain terms the structure, function, and development of the human brain. \n\nThe author describes the five &quot;memory lanes&quot;--semantic, episodic, procedural, automatic, and emotional--and tells how they function in learning and memory. She offers dozens of practical suggestions for teaching and assessing in brain-compatible ways. Bridging the gap between theory and practice, the book offers valid, usable, &quot;What you can do on Monday&quot; ideas to incorporate into the classroom. \n\nThis is an approach to brain research that educators at all levels can apply in their daily work. ","torrent":{"xt":"urn:btih:2b5caae81d2bba77938bf91c72df8619b99af4cf","amp;dn":"Learning+and+Memory%3A+The+Brain+in+Action","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b5caae81d2bba77938bf91c72df8619b99af4cf","infoHashBuffer":{"type":"Buffer","data":[43,92,170,232,29,43,186,119,147,139,249,28,114,223,134,25,185,154,244,207]},"announce":[],"urlList":[]}}