{"title":"Under The Dome Episode 11 (720p)","uid":10726380,"size":327658892,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:2c8d4f699003e222f50f1eb5f7f96120453f1d55&amp;dn=Under+The+Dome+Episode+11+%28720p%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"shareregi","files":2,"time":1407568226,"description":"Big Jim turns the town against and forms a manhunt on Barbie after the truth about his past is revealed. Meanwhile, Maxine makes it personal when she confronts Barbie's closest ally. Joe, Norrie, Angie, and Junior release their grip from the mini-dome and see white spots all over the barn, which are supposed to link up the constellations that they created. Later, Junior tries again to seduce Angie, with her replying that a relationship will never happen. Junior then decides to leave the three kids and forget about the mini-dome. As this happens, funnel clouds begin to appear in the sky. Junior then heads home and finds his father Big Jim, who arms him with a gun and bullets saying to stay at the house and beware of Maxine, who is threatening to hurt those closest to him. Angie then heads to the house pleading for Junior to return and help her, Joe, and Norrie with a situation with the mini-dome. As the funnel cloud grows, the wind picks up a bench, which almost hits Angie, but is saved by Junior. The clouds then begin to subside. Junior and Angie then realize that the dome wants him to stick with the three kids. Julia is shot by Maxine after Barbie rejected her in the previous episode. Barbie then gets Joe to drive them to the hospital. When they got there and see that the nurses are busy with other tornado-related emergencies, Barbie is forced to heal Julia's wounds. While sucking air out of her chest through a small tube, her heart stops. As this happens, a branch flies through the window, with Barbie pushing Joe out of the way. The clouds then subside, and Julia's heart begins to beat again. Joe then concludes that Barbie is the &quot;monarch [that] will be crowned.&quot; Later, Barbie gets Big Jim's help to take down Maxine without any death on their part. The two head to Maxine's underground club, but are ambushed by Maxine and a gunman. She says how she wants revenge for the murder of her mother Agatha, and that she wants to live a life with Barbie, but he rejects her advances. The power then goes out from Barbie's activated alarm which cut the power. Barbie and Big Jim then steal their guns and lead them outside. Barbie then leaves, telling Maxine &quot;You're done.&quot; As he walks off, Big Jim kills both Maxine and the gunman. Big Jim then tries to shoot Barbie, but he punches him in the throat and steals the gun. Linda then appears and Big Jim lies, saying that Barbie killed the two. Throughout the episode, Linda has been finding false evidence that concludes that Barbie is a dangerous felon. Barbie runs off before anything can happen to him. Big Jim later heads to the radio station and finds Dodee, who during the storm managed to gain access to a message from the military, saying that they have found Barbie. Big Jim hears this message, and then goes on the radio, framing Barbie for numerous crimes that occurred over the past few days. Norrie convinces Joe, Angie and Junior to touch the bigger dome at the same time. Upon doing so, the four see a vision of Big Jim bleeding from three stab wounds and a bloody nose. The vision then has the four holding four bloody knives, with Junior running off to find his dad. The three others then consider that in order for the dome to come down, they have to kill Big Jim.","torrent":{"xt":"urn:btih:2c8d4f699003e222f50f1eb5f7f96120453f1d55","amp;dn":"Under+The+Dome+Episode+11+%28720p%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2c8d4f699003e222f50f1eb5f7f96120453f1d55","infoHashBuffer":{"type":"Buffer","data":[44,141,79,105,144,3,226,34,245,15,30,181,247,249,97,32,69,63,29,85]},"announce":[],"urlList":[]}}