{"title":"La storia in giallo 146 - Edda e Galeazzo Ciano [Mp3 Ita] [TNTvi","uid":6697967,"size":72524404,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:2d3f214d2c65b3675182c8fe164441a4cec75b11&amp;dn=La+storia+in+giallo+146+-+Edda+e+Galeazzo+Ciano+%5BMp3+Ita%5D+%5BTNTvi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"darayava","files":1,"time":1316857887,"description":"La storia in giallo 146 - Edda e Galeazzo Ciano [Mp3 Ita] [TNTvillage]\n\nLA STORIA IN GIALLO\n\nLa Storia in giallo  ÃƒÂ¨ un programma in onda su radio3 scritto e condotto da Antonella Ferrera, con la regia di Francesco Pannofino, regia del dibattito di Manuel de Lucia, musiche originali di Alessandro Molinari, assistenza tecnica di Fiore Liborio, cura di Diana Vinci.\nRedazione: Carlo Dellonte e Roberto Ritondale Paola Veneto\nDa poco ha subito il mutamento nel nome diventando: Cuore di Tenebra\n\nLa storia e le storie di personaggi celebri, le vicende tragiche o misteriose che hanno segnato I loro destini e a volte quelli di molti altri. Uomini della politica o del malaffare, uomini di fede o vissuti nel peccato, personalitÃƒÂ  borderline, mitomani o geni maledetti. Le devianze e I turbamenti di grandi artisti di tutti I tempi che hanno riversato nella loro opera la fatica o la follia del vivere.\nLa Storia in Giallo li racconta come in un film, attraverso le voci dei migliori doppiatori italiani. Dopo lo sceneggiato che catapulta l'ascoltatore al centro di una storia, segue l'intervista ad un personaggio della cultura che ne spiega e racconta dinamiche, curiositÃƒÂ  e risvolti inediti.\n\nLa storia in giallo - in onda il 07/01/2006\n\nEDDA E GALEAZZO CIANO\n\n\nUna storia d'amore che somigliava ad una favola, quella tra Galeazzo Ciano e Edda Mussolini, tra il degno discendente di un eroe nazionale e la figlia capricciosa e ribelle del Duce. Dapprima testimoni della gloriosa ascesa del fascismo alla vigilia della seconda guerra mondiale, si separarono piÃƒÂ¹ volte, dando cosÃƒÂ¬ voce alle inquietudini e alle contraddizioni della realtÃƒÂ  italiana. Alla fine, si ritrovarono vittime di un regime che loro stessi avevano sostenuto.\nAntonella Ferrera ospita in studio lo storico e scrittore Giordano Bruno Guerri, che sull'amore tra Edda e Galeazzo Ciano ha da poco pubblicato un libro.\nLa voce di Galeazzo Ciano ÃƒÂ¨ quella di Riccardo RossI.\n\nFile Details\n========================================\nName..........: 2006 - Edda e Galeazzo Ciano.mp3\nFilesize......: 69Mb\n\nAudio Bitrate.: 192Kbps\nAudio Freq....: 44KHz\nAudio Channels: Mono\n\nVisit http://www.tntvillage.scambioetico.org/","torrent":{"xt":"urn:btih:2d3f214d2c65b3675182c8fe164441a4cec75b11","amp;dn":"La+storia+in+giallo+146+-+Edda+e+Galeazzo+Ciano+%5BMp3+Ita%5D+%5BTNTvi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2d3f214d2c65b3675182c8fe164441a4cec75b11","infoHashBuffer":{"type":"Buffer","data":[45,63,33,77,44,101,179,103,81,130,200,254,22,68,65,164,206,199,91,17]},"announce":[],"urlList":[]}}