{"title":"Planetbase version 1.0.10b repack Mr DJ","uid":13256939,"size":266627012,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:2d84f51ba4f4d9833cfb3e067d020b9f31c1f201&amp;dn=Planetbase+version+1.0.10b+repack+Mr+DJ&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rock840","files":2,"time":1453225990,"description":"Title: Planetbase\r\n Genre: Indie, Simulation, Strategy\r\n Developer: Madruga Works\r\n Publisher: Madruga Works \r\n Release Date: 15 Oct, 2015\r\n Crack based on : 3DM ;\r\n Languages: English , French , German , Spanish ;\r\n\r\nAbout This Game\r\n\r\nPlanetbase is a strategy game where you guide a group of space settlers trying to establish an outpost on a remote planet.\r\n\r\nIn the game you play the role of the base architect and manager, telling your colonists where to build the structures they will need to survive. You will have to ensure that they have a constant supply of oxygen, food and water to stay alive.\r\n\r\nYou will get them to collect energy, extract water, mine metal, grow food, manufacture bots, and build a fully self-sufficient base.\r\n\r\nEven if the game is not intended to be a simulator, all the mechanics are plausible, and based on what the expected challenges of establishing a colony in an new planet would be.\r\n\r\n System Requirements\r\n\r\n Minimum:\r\n OS: Windows Vista/7/8/10\r\n Processor: 2 GHz Dual Core\r\n Memory: 2 GB RAM\r\n Graphics: 512 MB VRAM (Shader Model 3)\r\n DirectX: Version 9.0c\r\n Hard Drive: 550 MB available space \r\n\r\nChangelog:\r\n\r\nNEW PLATFORM \r\n- The game is now available on Mac \r\n\r\nAI \r\n- AI will now will prioritize the storage of resources with low condition \r\n- Engineers will try really hard to build structure connections before going back to base \r\n- AI will wait for longer to go back inside the base for food, drink or sleep, this should prevent them from going out of the airlock and coming back in straight away \r\n\r\nGAMEPLAY \r\n- The meal maker will now make a salad out of any three different vegetables \r\n- Simplified recipe list in Meal Maker help \r\n- Reduced power consumption of Base Pad to 0.25 KW \r\n\r\nSHORTCUTS \r\n- Backspace now does the same as Delete (this is mainly for Mac) \r\n- Toggle panels shortcut his now the T key (it was Alt before) \r\n\r\nLOCALIZATION \r\n- When you select a language, a toast will appear if it has any missing strings. \r\n\r\nFIXES \r\n- Fixed issue where meteors were the same frequency regardless of game speed \r\n- Fixed mouse offset issues if resolution didn't match screen's aspect ratio \r\n- Fixed colonists sometimes getting stuck in a loop when there are no tables available to eat \r\n- Fixed issue where you would get paid even if visitors had died in the colony \r\n- Fixed repairable structures sometimes getting stuck in a weird state \r\n- Resolution is now saved in settings file instead on relying on windows to remember it \r\n- Stability fixes\r\n**INSTALL INSTRUCTIONS:\r\n\r\nOpen Planetbase v1.0.10b.exe , wait for a bit for the self extractor to open, specify the directory where u want to extract the game folder, open the extracted folder and play.....\r\n OR\r\nExtarct it yourself using 'WinRAR'\r\n\r\nAlways open the game using run as administrator\r\n\r\nCheck my FB page for more :\r\nMr DJ repacks","torrent":{"xt":"urn:btih:2d84f51ba4f4d9833cfb3e067d020b9f31c1f201","amp;dn":"Planetbase+version+1.0.10b+repack+Mr+DJ","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2d84f51ba4f4d9833cfb3e067d020b9f31c1f201","infoHashBuffer":{"type":"Buffer","data":[45,132,245,27,164,244,217,131,60,251,62,6,125,2,11,159,49,193,242,1]},"announce":[],"urlList":[]}}