{"title":"Kitty Wells - Kitty Wells' Country Hit Parade (1956) MP3@320","uid":9673708,"size":77830208,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2d90cbc747fbe24c73400175ff4793a642ae0799&amp;dn=Kitty+Wells+-+Kitty+Wells%27+Country+Hit+Parade+%281956%29+MP3%40320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"AaronVincent","files":15,"time":1393518768,"description":"Kitty Wells was a major influence on Dolly Parton, Linda Ronstadt, Emmylou Harris and so many other women who crossed over from country to pop. &quot;Too many times married men think they are single&quot; is the sentiment displayed in &quot;It Wasn't God Who Made Honky Tonk Angels&quot; -- which is 1950s male bashing, and Wells' perfect vocal cuts through the violin and accompaniment. It's pure country music that is far removed from the slick pop Nashville began manufacturing decades after this groundbreaking disc. &quot;Paying for That Back Street Affair&quot; is one of three Billy Wallace titles, featuring the lyrics &quot;you gambled and I lost/now I must pay with hours of despair.&quot; The songs are full of someone having done someone wrong, and though there is a sameness throughout, vocally and instrumentally, the purity of Wells' performance and sincerity makes the 12 short stories very appealing. &quot;I don't claim to be an angel, my life's been full of sin&quot; is her statement, and she's sticking to it. Wells covers Roy Acuff, Zeke Clements, and J.B. Miller, and the work is consistently high. The passion in the opening track, Jimmy Work's &quot;Making Believe,&quot; is powerful stuff, but it's her performance on the Eddie Miller/Dube Williams/Robert Yount classic &quot;Release Me&quot; which is the album's high point, as influential as the hit &quot;It Wasn't God Who Made Honky Tonk Angels.&quot; This track may have helped establish Engelbert Humperdinck's career as he took the song to the Top Five in 1967. Jimmy Heap had a country hit with the &quot;Release Me&quot; in 1955, and Esther Phillips took it to the top of the R&amp;B charts in 1962 (as well as Top Ten on the Top 40), but Kitty Wells adds something extra to it here, and her performance of the tune is timeless. Release Me doesn't have &quot;your lips are sweet as honey&quot; lines, but &quot;There's Poison in Your Heart&quot; lines, and maybe that's what makes it so effective. Still, Kitty Wells can take corny country lyrics and deliver them with total sincerity. Kitty Wells Country Hit Parade is a classic of the genre and gave inspiration to decades of male and female vocalists who went on to inspire others. It is entertaining beyond its historical importance.","torrent":{"xt":"urn:btih:2d90cbc747fbe24c73400175ff4793a642ae0799","amp;dn":"Kitty+Wells+-+Kitty+Wells%27+Country+Hit+Parade+%281956%29+MP3%40320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2d90cbc747fbe24c73400175ff4793a642ae0799","infoHashBuffer":{"type":"Buffer","data":[45,144,203,199,71,251,226,76,115,64,1,117,255,71,147,166,66,174,7,153]},"announce":[],"urlList":[]}}