{"title":"Keyboard Remapper 1.2","uid":4520936,"size":96587,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:2dca64622d521640a4e4ac2fa8f27e813015eeff&amp;dn=Keyboard+Remapper+1.2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"DensetsuAE86","files":1,"time":1227158264,"description":"*********************************************************************************\nCracked and all ready to go, just extract the archive whereever you want and run it from there. No install needed!\n********************************************************************************* &lt;a href=&quot;\nhttp://www.easytousetools.com/keyboard_remapper/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.easytousetools.com/keyboard_remapper/&lt;/a&gt;\n*********************************************************************************\n\nKeyboard Remapper allows you to quickly redefine what a key-combination should do allowing you to extend.\n\nThe program was designed to meet specific needs and from there results its advantages and limitations:\n\n    * You do not have run a Setup and install the program. Just download the archive, unpack it where you want and start the program. It works out of the box.\n    * The program is very fast and efficient making sure it does not over use your CPU.\n    * The program is very small so that will not eat-up you memory (RAM).\n    * Very easy to use. No advanced interface, no hidden features, no need to learn anything. In two simple steps you first define the key or key(s) that you what to assign a function to and then you will chose what that function will be. As simple as that.\n    * No need to uninstall. If you do not want to use the program anymore just stop it and then remove the files from your hard drive.\n    * Quick enable/disable of the software. No need to reboot/restart your machine or restart the program. If needed you can just temporarily disable it.\n\nWe wanted to create a tool that is simple, small, fast and does exactly what it is ment to do. Its purpose is not to be a complete or advanced tool. If you need more options and features there are a lot of other programs out there that may suit you.\n\nBUT if all that you need is to just redefine what a key does, or simply replace a broken key with another one and you what to do that now, fast and without spending time in learning new stuff, then Keyboard Remapper is the tool for you. We have kept the interface and the software as simple as possible.","torrent":{"xt":"urn:btih:2dca64622d521640a4e4ac2fa8f27e813015eeff","amp;dn":"Keyboard+Remapper+1.2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2dca64622d521640a4e4ac2fa8f27e813015eeff","infoHashBuffer":{"type":"Buffer","data":[45,202,100,98,45,82,22,64,164,228,172,47,168,242,126,129,48,21,238,255]},"announce":[],"urlList":[]}}