{"title":"CompTIA Security+ Study Guide SY0-401, 6th Edition Apr-2014-Jayp","uid":10637549,"size":124684287,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2e1702ed2a028ec5c205903cad9fe727e1fe58d8&amp;dn=CompTIA+Security%2B+Study+Guide+SY0-401%2C+6th+Edition+Apr-2014-Jayp&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":16,"uploader":"jaypm","files":4,"time":1406408486,"description":"I got mine.. so here its is.. Enjoy\n\nJoin over 250,000 IT professionals who've earned Security+ certification\nIf you're an IT professional hoping to progress in your career, then you know that the CompTIA Security+ exam is one of the most valuable certifications available. Since its introduction in 2002, over a quarter million professionals have achieved Security+ certification, itself a springboard to prestigious certifications like the CASP, CISSP, and CISA. The CompTIA Security+ Study Guide: SY0-401 covers 100% of the Security+ exam objectives, with clear and concise information on crucial security topics.\n\nYou'll find everything you need to prepare for the 2014 version of the Security+ certification exam, including insight from industry experts on a wide range of IT security topics. Readers also get access to a robust set of learning tools, featuring electronic flashcards, assessment tests, robust practice test environment, with hundreds of practice questions, and electronic flashcards.\n\nCompTIA authorized and endorsed\nIncludes updates covering the latest changes to the exam, including better preparation for real-world applications\nCovers key topics like network security, compliance and operational security, threats and vulnerabilities, access control and identity management, and cryptography\nEmploys practical examples and insights to provide real-world context from two leading certification experts\nProvides the necessary tools to take that first important step toward advanced security certs like CASP, CISSP, and CISA, in addition to satisfying the DoD's 8570 directive\nIf you're serious about jump-starting your security career, you need the kind of thorough preparation included in the CompTIA Security+ Study Guide: SY0-401.","torrent":{"xt":"urn:btih:2e1702ed2a028ec5c205903cad9fe727e1fe58d8","amp;dn":"CompTIA+Security%2B+Study+Guide+SY0-401%2C+6th+Edition+Apr-2014-Jayp","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2e1702ed2a028ec5c205903cad9fe727e1fe58d8","infoHashBuffer":{"type":"Buffer","data":[46,23,2,237,42,2,142,197,194,5,144,60,173,159,231,39,225,254,88,216]},"announce":[],"urlList":[]}}