{"title":"Ultimate Secrets of Total Self Confidence","uid":4072683,"size":85979188,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:2e42761726e52eb99b13ce8e5310bac750c3c5cc&amp;dn=Ultimate+Secrets+of+Total+Self+Confidence&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"philpia","files":4,"time":1205134580,"description":"This is no way to live! Like so many others, you can now enjoy your own personal success story by mastering the principles of total self-confidence. Here Dr. Robert Anthony reveals the secrets he has taught in seminars and workshops that have changed thousands of lives. Executive businessmen, star athletes, and celebrities know how total self-confidence can make you soar. And now you can, too.\n\nYOU WILL LEARN:\n\n* How to tap into your creative imagination?and use it to get what you want\n* How to clear your mind of fear, worry, guilt, and reverse failure\n* The best ways to communicate and the art of small talk\n* The simplest ways to get perspective and set goals\n* The joys and benefits of being different\n\nLet Dr. Anthony guide you on this step-by-step, day-by-day path toward total self-confidence?in your career, family, love life, finances, and mental and physical health?and achieve a brand-new, totally positive and confident outlook.\n\nAbout the Author\nDr. Robert Anthony is an undercover secret for some of the most successful people on the planet. For the past 30 years he has spent his life unraveling the mysteries of the mind. During that time he has earned a Ph.D. in behavioral psychology and has worked as a psychotherapist, NLP practitioner, master hypnotist and personal performance trainer.\n\nHe has spoken at over 5,000 prestigious seminars all over the world, and been featured as the keynote speaker to clients who paid hundreds or thousands of dollars to attend.\n\nHe has authored over 15 books, which have been published in 22 countries. His flagship book, The Ultimate Secrets of Total Self-Confidence has sold over a million copies.\n\nUnlike most other &quot;mind performance&quot; and &quot;self-improvement&quot; experts, he hasn&amp;#039;t thrived on publicity to make a name for himself. What makes Dr. Anthony different is his ability to take complicated ideas and teach them in a simple but powerful way that gets immediate RESULTS.\n\nHe doesn&amp;#039;t teach motivation seminars and &quot;positive thinking&quot;. It&amp;#039;s much deeper than that. He goes Beyond Positive Thinking. He aligns your personal power in accordance with the natural laws of the Universe - and reverses the polarity of your life! So rather than eliminating the things you don?t want, you become naturally attracted towards the things you do want!","torrent":{"xt":"urn:btih:2e42761726e52eb99b13ce8e5310bac750c3c5cc","amp;dn":"Ultimate+Secrets+of+Total+Self+Confidence","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2e42761726e52eb99b13ce8e5310bac750c3c5cc","infoHashBuffer":{"type":"Buffer","data":[46,66,118,23,38,229,46,185,155,19,206,142,83,16,186,199,80,195,197,204]},"announce":[],"urlList":[]}}