{"title":"Bob Dylan Encyclopedia (2006) [FrankFoo]","uid":9910513,"size":8286289,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2eaca6062cb7c2c567d664b66b31f1bd5664dbc6&amp;dn=Bob+Dylan+Encyclopedia+%282006%29+%5BFrankFoo%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"FrankFoo2","files":-1,"time":1396888513,"description":"\nBob Dylan Encyclopedia\n\nFrom Publishers Weekly:\n\nStarred Review. Fans of Bob Dylan have a multitude of choices when it comes to biographies and retrospectives, but author Michael Gray (Song &amp; Dance Man #3: The Art of Bob Dylan) outdistances them all with this voluminous collection of all things Dylan. Over the course of 823 pages Gray considers everything from railroad imagery in Dylan's songs to his use of nursery rhymes, covering the topics houghtfully and thoroughly. \n\nAn entry on Rubin &quot;Hurricane&quot; Carter details the plight of the wrongfully jailed boxer immortalized in Dylan's song &quot;Hurricane,&quot; including not only a biography of the fighter, but details of the song's recording and live performance. \n\nEven the briefest of encounters merits an entry, such as when Neil Diamond challenged Dylan to top him as he came offstage. \nDylan's reply: &quot;Waddaya want me to do-go onstage and fall asleep?&quot; \n\nGray's knowledge of his subject is seemingly boundless, yet he manages to maintain a critical eye and keep Dylan's work in perspective. &quot;Unbelievable,&quot; a song off Dylan's Under the Red Sky album, is called &quot;a hopeless piece of rockist sludge picked from the obscurity of the album and issued as a single. Almost any other track would have fared better .&quot; \n\nWhile Gray is certainly a fan, it's this impartiality that fuels the book and gives it weight. \n\nInsightful and entertaining, Gray's tome will broaden appreciation of the artist, his influences and his legacy. \n100 b&amp;w illustrations.\n\n\nFrom Booklist:\n\nRock 'n' roll historian and Bob Dylan authority Gray offers a detailed volume featuring entries related to Dylan's life, \nartists who influenced him and were influenced by him, musical styles he created, and background stories of specific Dylan songs and recordings. \n\nGray states in his preface that this work was prompted by friends and readers of his books (Song &amp; Dance Man: The Art of Bob Dylan, 1972, and its 900-page revised edition, 2000) who suggested that he present some of that material in a more &quot;reference-based&quot; way.\n\nMost of the entries are sketches of musicians, although Gray includes actors, authors, and other nonmusicians. \n\nThese entries provide brief biographies and then explain how the people are connected to Dylan: \nhow they worked with him, influenced or were influenced by him, and which of his songs they performed or recorded. \n\nThe 3-page entry for Johnny Cash, for example, tells of Cash's defense of Dylan when Columbia Records wanted to drop him, their first meeting at the Gaslight Cafe in Greenwich Village, and their duo performances and recordings.\n\nGray's opinions and editorializing are prevalent throughout. \n\nThis makes for unique entries, such as Interviews and the myth of their rarity (in which he claims Dylan actually averaged one interview per month over 40 years) and Dylan being &quot;bored&quot; by his acoustic material 1965-66, the myth of. \n\nIn fact, the entire book is written in a refreshingly relaxed manner, as befits a music critic and fan.\n\nThe volume comes with more than 100 black-and-white illustrations and an accompanying CD-ROM with a searchable PDF version of the text. \n\nAlthough there is another published Dylan reference work, \nOliver Trager's Keys to the Rain: The Definitive Bob Dylan Encyclopedia (Billboard, 2004), the current volume is a valuable addition to academic and large public library collections, primarily because of Gray's knowledge and reputation as a Dylan expert. Steven York\n","torrent":{"xt":"urn:btih:2eaca6062cb7c2c567d664b66b31f1bd5664dbc6","amp;dn":"Bob+Dylan+Encyclopedia+%282006%29+%5BFrankFoo%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2eaca6062cb7c2c567d664b66b31f1bd5664dbc6","infoHashBuffer":{"type":"Buffer","data":[46,172,166,6,44,183,194,197,103,214,100,182,107,49,241,189,86,100,219,198]},"announce":[],"urlList":[]}}