{"title":"Rand H Holmes - White Lunch Comix (UG - Restored)","uid":7700972,"size":39480253,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:2ed3d5579ce86107e38f96260ec31fc4f5b22c71&amp;dn=Rand+H+Holmes+-+White+Lunch+Comix+%28UG+-+Restored%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"LeonardTSpock","files":-1,"time":1349515591,"description":"'White Lunch Comix'\n\nGeorgia Straight, 1972\n\nWritten and Illustrated by Rand H. Holmes and Jim Jones\n\n\n\nPart of the 'Restoration' process is done to make it possible to enlarge these images. As such, after you have opened the files in a comic book reader, some of you may actually need to shrink them down a bit to achieve the best image quality possible.\n\n-------------------------------------------------------\n\nAfter it was pointed out to me that people were getting a GonVisor popup, I am now creating these books in such a way as to have stopped that from happening. No GonVisor popup will appear on any 'Restorations' in the future.\n\n-------------------------------------------------------\n\nI have almost 1500 Underground comic books, and countless other b&amp;w comic books, in digital formats. I will be restoring and uploading many of my favorites over the coming months. Any requests, just say the word.\n\nSo what does 'Restored' mean? Well, with respect to all the work the scanners have done in order to make these books available, the pages were not yellow when first printed. Ugly grey newsprint? Yes, often they were. Cheap, thin paper? Yeah, that too. But not yellow. And not looking like some ancient, faded artifact.\n\nIn most cases, the changes make the books look better than they did when they were originally printed. By turning the newsprint or cheap paper they were printed on to a bright white, with crisp, clearly differentiated greys and solid black lines on top, they look very much like a new b&amp;w comic you would buy right off the shelf today on high quality paper.\n\nThis is accomplished by running the original pages through the PhotoScape Batch Editor. The Filters applied to the pages are; Grayscale (changes the image to greyscale, which is not the same as b&amp;w); a 'Middle' or 'High' setting on Auto Level (greatly improves the blacks); a 'Low' or +1 Sharpen (barely noticeable, even if you watch the changes take place); 'Deepen' is used if there is bleed through from the image on the back of the page or to improve the overall look of color or b&amp;w pages. Occasionally 'Brighten' or 'Darken' are used if needed. And during some particularly tough 'Restorations' I recently found that using certain 'Film' effects in combination with the settings above can greatly improve image quality. Color covers, back or interior pages are 'Restored' on a page by page basis using mostly the same techniques.","torrent":{"xt":"urn:btih:2ed3d5579ce86107e38f96260ec31fc4f5b22c71","amp;dn":"Rand+H+Holmes+-+White+Lunch+Comix+%28UG+-+Restored%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ed3d5579ce86107e38f96260ec31fc4f5b22c71","infoHashBuffer":{"type":"Buffer","data":[46,211,213,87,156,232,97,7,227,143,150,38,14,195,31,196,245,178,44,113]},"announce":[],"urlList":[]}}