{"title":"Cosmic Biology - How Life Could Evolve on Other Worlds[BBS]","uid":6611950,"size":137895230,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2f102b769b3e0592cab6847130efa4aee8f1782b&amp;dn=Cosmic+Biology+-+How+Life+Could+Evolve+on+Other+Worlds%5BBBS%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"bigbluesea","files":-1,"time":1313632015,"description":"In Cosmic Biology, Louis Irwin and Dirk Schulze-Makuch guide readers through the range of planetary habitats found in our Solar System and those likely to be found throughout the universe. Based on our current knowledge of chemistry, energy, and evolutionary tendencies, the authors envision a variety of possible life forms. These range from the familiar species found on Earth to increasingly exotic examples possible under the different conditions of other planets and their satellites.\n\nDiscussions of the great variety of life forms that could evolve in these diverse environments have become particularly relevant in recent years with the discovery of around 300 exoplanets in orbit around other stars and the possibilities for the existence of life in these planetary systems. The book also posits a taxonomic classification of the various forms of life that might be found, including speculation on the relative abundance of different forms and the generic fate of living systems. The fate and future of life on Earth will also be considered. The closing passages address the Fermi Paradox, and conclude with philosophical reflections on the possible place of Homo sapiens in the potentially vast stream of life across the galaxies.\nFrom the Back Cover\n\nIt is very unlikely that little green humanoids are living on Mars. But what are the possible life forms that might exist in our Solar System and how might they have evolved?\n\nThis uniquely authoritative and imaginative book on the possibilties for alien life addresses the intrinsic interest that we have about life on other worlds - reinforcing some of our assumptions and reshaping others. It introduces new possibilties that will enlarge our understanding of the issue overall, in particular the enormous range of environments and planetary conditions within which life might evolve.\n\nCosmic Biology\n\n-discusses a broad range of possible environments where alien life might have evolved;\n\n-explains why carbon-based, water-borne life is more likely that its alternatives, but is not the only possiblity;\n\n-applies the principles of planetary science and modern biology to evolutionary scenarios on other worlds;\n\n-looks at the future fates of living systems, including those on Earth.\n\n\n\n\n\n# Paperback: 337 pages\n# Publisher: Praxis; 1st Edition. edition (December 10, 2010)\n# Language: English\n# ISBN-10: 1441916466\n# ISBN-13: 978-1441916464","torrent":{"xt":"urn:btih:2f102b769b3e0592cab6847130efa4aee8f1782b","amp;dn":"Cosmic+Biology+-+How+Life+Could+Evolve+on+Other+Worlds%5BBBS%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2f102b769b3e0592cab6847130efa4aee8f1782b","infoHashBuffer":{"type":"Buffer","data":[47,16,43,118,155,62,5,146,202,182,132,113,48,239,164,174,232,241,120,43]},"announce":[],"urlList":[]}}