{"title":"St. Teresa of Avila - Interior Castles, Way of Perfection (pdf)","uid":8660715,"size":4514791,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2fdadebc27322de34680833f960381183134d5c3&amp;dn=St.+Teresa+of+Avila+-+Interior+Castles%2C+Way+of+Perfection+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pharmakate","files":-1,"time":1373313261,"description":"St. Teresa of Avila (Kieran Kavanaugh and Otilio Rodriguez, trans.)- The Collected Works, Volume 2 (ICS, 1980). 554 pages.\n\nThis volume of St. Teresa's Collected Works contains three works, including two of her best known:\n\n--The Way of Perfection\n\n--Meditations on the Song of Songs\n\n--The Interior Castle\n\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\n\nThis translation, though not as widely available as that of E. Allison Peers, is a newer translation than Peers' and is generally regarded as the current standard translation of Teresa's works.\n\ndescription:\n\nShortly after writing The Book of Her Life for her confessor, St. Teresa wrote The Way of Perfection at the request of her nuns who were eager to learn about prayer and contemplation. Throughout this work she teaches her nuns about prayer and also teaches us.\n\nToward the end of her life, after she had experienced both the spiritual betrothal and spiritual marriage, Teresa wrote The Interior Castle, her own panoramic view of her relationship with God, from the lowest stages to the highest. Teresa here demonstrates her great gift for writing about that relationship and attracting us to explore the possibility of pursuing it.\n\nAlong with these two classics, Volume Two also includes one of Teresa's minor works, her Meditations on the Song of Songs. Includes general and biblical index.\n\nReview\n\nSome of the most important instructions on prayer available in the western Christian tradition. --Margaret Dorgan, Cross Currents\n\n----------\n\nSorry, but I don't have the other volumes in this series of St. Teresa's Collected Works.","torrent":{"xt":"urn:btih:2fdadebc27322de34680833f960381183134d5c3","amp;dn":"St.+Teresa+of+Avila+-+Interior+Castles%2C+Way+of+Perfection+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2fdadebc27322de34680833f960381183134d5c3","infoHashBuffer":{"type":"Buffer","data":[47,218,222,188,39,50,45,227,70,128,131,63,150,3,129,24,49,52,213,195]},"announce":[],"urlList":[]}}