{"title":"FairUse Wizard 2.9 Full Version (+ extra codecs)","uid":4728560,"size":23160132,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:2fdfcf462acf049ec6e878ac9aabcd6a3caa5f35&amp;dn=FairUse+Wizard+2.9+Full+Version+%28%2B+extra+codecs%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"z247","files":39,"time":1234884332,"description":"Actually it is a reupload of my previous release, with additional codecs\n\n\nFairUse Wizard 2.9 (Full, not Light Edition)\n\n\n- Easily create movies that will play on your standalone player with the DivX and XviD codecs\n\n- Use cutting edge technology with new codecs  like the well-known H264, XviD, or the ffVFW codec suite.\n\n-Store several movies on a single DVD\n\n- Protect your expensive DVD collection by letting the children use a backup copy while the original discs stay in a safe place\n\n- Encode tens of episodes of your favourite shows in only a few mouse click\n\n- Let the wizard be your guide at every step of the conversion process.\n\n- Encode up to two audio tracks so you can chose between original and dubbed version at playback (maximum number of audio track may vary depending on the selected encoding profile)\n\n- Preview subtitles on the preview screen during the encoding setup\n\t\n\n\n\nChangelog:\n\nFixed:\nCorrected some corrupted discs handling\nFixed the audio encoding error that occured with AAC-based profiles\nFixed the codec error that occured at the first run\nFixed a potential hang that could occur right before encoding begins\nFixed IDX/SUB files not taking into account the default project folder\nFixed IDX/SUB files not taking into account the custom file naming introduced with FairUse 2.8\nFixed subtitles drifting when exporting to sub/idx while splitting to multiple parts\n\n\n\nIn addition, for advanced users, I included:\n- manual (well, for everybody)\n- DivX 6.8 codec (codec for coding only, without all the DivX crap...)\n- XviD 1.21\n- x.264 r1093\n- On2 VP7 Personal Edition 7.0.1.0 codec\n- VirtualDubMod 1.5.10.2 (just copy to the FairUse catalog if you experience problems with muxing. I do not know why the creator does not integrate it but uses an old version of VDM instead)\n- LAME 3.98.2 (just copy it to the main catalogue of the program)\n- OGG Vorbis audio codec (oggenc2.85-aoTuVb5.6-P4, optimized for newer processor architectures - demands SSE2, just copy it to the main catalogue as above)\n\nEnjoy!\t","torrent":{"xt":"urn:btih:2fdfcf462acf049ec6e878ac9aabcd6a3caa5f35","amp;dn":"FairUse+Wizard+2.9+Full+Version+%28%2B+extra+codecs%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2fdfcf462acf049ec6e878ac9aabcd6a3caa5f35","infoHashBuffer":{"type":"Buffer","data":[47,223,207,70,42,207,4,158,198,232,120,172,154,171,205,106,60,170,95,53]},"announce":[],"urlList":[]}}