{"title":"Between Giants - The Battle for the Baltics in World War II - Pd","uid":9376497,"size":3532340,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:319672283eeee9021282b25acb6d9fd9b847c48a&amp;dn=Between+Giants+-+The+Battle+for+the+Baltics+in+World+War+II+-+Pd&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"KhushSidhu","files":1,"time":1387586785,"description":"\n\nBetween Giants: The Battle for the Baltics in World War II (General Military) \n\nBy Prit Buttar\n\n488 pages - Publisher: Osprey Publishing\nYear - 2013 - Language: English \nSeries: General Military - Pdf\nISBN-10: 1780961634 - ISBN-13: 978-1780961637\n\nWith the exception of Poland, no region or territory suffered more greatly during World War II than the Baltic States. Caught between the giants of the Soviet Union and the Third Reich, Latvia, Lithuania, and Estonia became pawns in the desperate battle for control of Eastern Europe throughout the course of World War II. This is a story of conquest and exploitation, of death and deportation and the fight for survival both by countries and individuals. The three states were repeatedly occupied -- by the Soviet Union in 1939, by Germany in 1941, and again by the Soviet Union in 1944-45. In each case, local government organizations and individuals were forced to choose between supporting the occupying forces or forming partisan units. Many would be caught up in the bitter fighting in the region and, in particular, in the huge battles for the Courland bridgehead during Operation Bagration when hundreds of thousands of soldiers would fight and die in the last year of the war. Over 300,000 Soviet troops would be lost during the repeated assaults on the 'Courland Cauldron' before 146,000 German and Latvia troops were finally forced to surrender. No mercy was shown and all Latvians, Lithuanians, and Estonians who fought for Germany were executed. By the end of the war, death and deportation had cost the Baltic States over 20 percent of their total population and the iron curtain would descend on the region for over four decades. Using numerous first-hand accounts and detailed archival research, Prit Buttar weaves a magisterial account of the bitter fighting on the Eastern Front and the three small states whose fates were determined by the fortunes and misfortunes of war.","torrent":{"xt":"urn:btih:319672283eeee9021282b25acb6d9fd9b847c48a","amp;dn":"Between+Giants+-+The+Battle+for+the+Baltics+in+World+War+II+-+Pd","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"319672283eeee9021282b25acb6d9fd9b847c48a","infoHashBuffer":{"type":"Buffer","data":[49,150,114,40,62,238,233,2,18,130,178,90,203,109,159,217,184,71,196,138]},"announce":[],"urlList":[]}}