{"title":"Nuclear Energy: An Introduction to the Concepts, Systems, and Ap","uid":12819437,"size":30745229,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:31c761ed3d85b4c4f96f41de0fc22a2a7bc95511&amp;dn=Nuclear+Energy%3A+An+Introduction+to+the+Concepts%2C+Systems%2C+and+Ap&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"NoctDeath","files":2,"time":1448275894,"description":"Title: Nuclear Energy: An Introduction to the Concepts, Systems, and Applications of Nuclear Processes \r\nAuthor: Raymond Murray, Keith E. Holbert \r\nFormat: PDF \r\nHardcover: 56 pages \r\nPublisher: Butterworth-Heinemann; 7 edition (February 21, 2014)\r\nLanguage: English \r\nISBN: 9780124166547 \r\n\r\n\r\nNuclear Energy is one of the most popular texts ever published on basic nuclear physics, systems, and applications of nuclear energy. This newest edition continues the tradition of offering a holistic treatment of everything the undergraduate engineering student needs to know in a clear and accessible way. The book presents a comprehensive overview of radioactivity, radiation protection, nuclear reactors, waste disposal, and nuclear medicine.\r\n\r\nThe seventh edition is restructured into three parts: Basic Concepts, Nuclear Power (including new chapters on nuclear power plants and introduction to reactor theory), and Radiation and Its Uses. Part Two in particular has been updated with current developments, including a new section on Reactor Safety and Security (with a discussion of the Fukushima Diiachi accident); updated information on naval and space propulsion; and revised and updated information on radioactive waste storage, transportation, and disposal. Part Three features new content on biological effects of radiation, radiation standards, and radiation detection.\r\n\r\n- Coverage of energy economics integrated into appropriate chapters\r\n- More worked examples and end of chapter exercises\r\n- Updated final chapter on nuclear explosions for current geopolitical developments","torrent":{"xt":"urn:btih:31c761ed3d85b4c4f96f41de0fc22a2a7bc95511","amp;dn":"Nuclear+Energy%3A+An+Introduction+to+the+Concepts%2C+Systems%2C+and+Ap","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"31c761ed3d85b4c4f96f41de0fc22a2a7bc95511","infoHashBuffer":{"type":"Buffer","data":[49,199,97,237,61,133,180,196,249,111,65,222,15,194,42,42,123,201,85,17]},"announce":[],"urlList":[]}}