{"title":"Lamp and Vamp v1.2.9","uid":11730159,"size":13745910,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:33ad7c6655ff559df8d41344afd7d4e5b3c7c156&amp;dn=Lamp+and+Vamp+v1.2.9&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Androider","files":1,"time":1425272333,"description":"Lamp and Vamp' is a rogue-like game where you'll play as a Vampire who wants to reach the castle of his dreams.\n\nBut the Vampire is alone against the world! You will have to master dark powers to find the way to the grave of each level, where you will get new powers. \n\nChoose them wisely if you want to see the castle. Many different ways can lead to victory... but if you fail you'll die... definitely! Many different ways can lead to victory. Will you be an agressive, flying or invisible Vampire? \n\nLamp and Vamp is an enjoyable strategy game where players must navigate a vampire to his coffin through a randomly generated neighborhood, while avoiding the local neighborhood watch, determined to catch them. \n\nMovement is based on a tile system, each turn the player can move to any adjacent tile, and the vampire hunters also move one tile. The catch is that the vampire hunters have torches and flashlights, and can see ahead. If the vampire is caught in the hunter's line-of-sight, all the hunters in the neighborhood will converge and attempt to corner the vampire, resulting in death.&quot;\n\nWhat's New:\n\n- More user friendly\n- Bug fixes\n- Tips added :\n. If the Vampire is detected, the enemies spot him and swarm towards him.\n. If the Vampire is spotted, take 2 turns in the shadows to call off the hunt.\n. If an enemy's way is blocked, he will always turn according to his preferred direction (see Bestiary).\n. Tap the Vampire's space to stay where you are.\n. Enemies act first and foremost from left to right and from top to bottom.\n. etc.\n\nMore info:\n &lt;a href=&quot;\nhttps://play.google.com/store/apps/details?id=air.com.globz.lampvamp&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://play.google.com/store/apps/details?id=air.com.globz.lampvamp&lt;/a&gt;\n","torrent":{"xt":"urn:btih:33ad7c6655ff559df8d41344afd7d4e5b3c7c156","amp;dn":"Lamp+and+Vamp+v1.2.9","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"33ad7c6655ff559df8d41344afd7d4e5b3c7c156","infoHashBuffer":{"type":"Buffer","data":[51,173,124,102,85,255,85,157,248,212,19,68,175,215,212,229,179,199,193,86]},"announce":[],"urlList":[]}}