{"title":"The Charlatans - Discography (1990-2008) [FLAC]","uid":8808942,"size":5058632566,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:33f991e9dce70040706e08b17f766ce4b50d9b1b&amp;dn=The+Charlatans+-+Discography+%281990-2008%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"politux","files":-1,"time":1376411090,"description":"\n  The Charlatans - Discography (1990-2008) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Alternative, Britpop, Indie Rock\n  Source: CD\n  Codec: FLAC\n  Bit Rates: ~ 800 - 1,000 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  2008 You Cross My Path\n  2006 Simpatico\n  2004 Up at the Lake\n  2002 Songs From The Other Side {b.sides}\n  2001 Wonderland\n  1999 Us and Us Only\n  1999 Us and Us Only {Japanese Edition}\n  1997 Tellin' Stories\n  1997 Tellin' Stories {US - Edition}\n  1995 The Charlatans\n  1994 Up to Our Hips\n  1992 Between 10th and 11th\n  1990 Some Friendly\n\n  For many years, the Charlatans UK were perceived as the also-rans of Madchester, the group that didn't capture the zeitgeist like the Stone Roses or the band that failed to match the mad genre-bending of the Happy Mondays. Of course, they were more traditional than either of their peers. Working from a Stonesy foundation, the Charlatans added dance-oriented rhythms and layers of swirling organs straight out of '60s psychedelia. At first, the Charlatans had great promise, and their initial singles -- including &quot;The Only One I Know&quot; -- were hits, but as Madchester and &quot;baggy&quot; faded away, the group began to look like a relic. It was commonly assumed that their third album, 1994's Up to Our Hips, was the end of the line. However, the Charlatans made a remarkable comeback in 1995 with their eponymous fourth album, which found them embracing not only the flourishing Brit-pop movement, but also underground dance and techno, as well as their mainstay of classic rock. The Charlatans UK debuted at number one, and the guys were hailed as survivors. Unfortunately, few knew how literal that term was -- as the band was recording its follow-up album in 1996, organist Rob Collins, who had defined the band's sound, died in a car crash. the Charlatans decided to continue as a quartet, and their subsequent album, Tellin' Stories, debuted at number one upon its 1997 release, suggesting that they had become one of the great British journeyman bands of the '90s.\n\n  At the time of their formation in 1989, it appeared that the Charlatans were all about transience. Inspired by the emergence of the Stone Roses, Rob Collins (keyboards), Jon Baker (guitar), Martin Blunt (bass), and Jon Brookes (drums) formed the Charlatans, rehearsing with a variety of vocalists before Tim Burgess joined as their singer. The group attempted to land a record contract with no success, so they formed Dead Dead Good Records and released their debut 12&quot; single, &quot;Indian Rope,&quot; in January 1990. Collins' dynamic, sweeping Hammond organ distinguished the group from their Madchester peers, and the single became a number one hit on the indie charts. By the spring, they'd signed with Beggars Banquet, releasing &quot;The Only One I Know&quot; a few months later. Borrowing heavily from the Stones, jangle pop, and funk, &quot;The Only One I Know&quot; became a monster hit, climbing into the pop Top Ten and becoming the group's signature single. Following another hit single, &quot;Then,&quot; the band's debut album, Some Friendly, was released in the fall, debuting at number one.","torrent":{"xt":"urn:btih:33f991e9dce70040706e08b17f766ce4b50d9b1b","amp;dn":"The+Charlatans+-+Discography+%281990-2008%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"33f991e9dce70040706e08b17f766ce4b50d9b1b","infoHashBuffer":{"type":"Buffer","data":[51,249,145,233,220,231,0,64,112,110,8,177,127,118,108,228,181,13,155,27]},"announce":[],"urlList":[]}}