{"title":"CFW 4.46 CEX by HABIB - PS3 STABLE","uid":8680687,"size":395740902,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:344a3a40211e8fe1e3b9c34db076ae44dff4b629&amp;dn=CFW+4.46+CEX+by+HABIB+-+PS3+STABLE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Koolitaly","files":4,"time":1373687790,"description":"This is a most recent update to Habibs' new Custom Firmware which I have currently tested on 5 different consoles and counting and is working flawless. \n\nNote: you can go online but at your own risk. I left 3 consoles online since his first public release and so far no ban but use at your own risk. \n\nI have no installed in from anythingn but 3.55 Kmeaw. \n\nWarning! -- I strongly advice to enable QA toggle and go into settings and enable update debug.\n\nWarning! -- I would also install rogeros' downgradger also if you haven't already. \n\nHere are the steps to Install Qa flag and rogeros downgrader pup. \n\nSTEP ONE\n\n1: Install toggle_qa.pkg\n2: Run Toggle QA from XMB\n3: PS3 will beep and return to XMB. (If you do not hear a beep it has not worked)\n\nNOTE: Every now and then it will hang on the lv1 patching stage. If it has not beeped and returned to the XMB after about 30secs you will need to reboot and try again. (TO CHECK THAT IT HAS BEEN ENABLED IS IMPORTANT! GO TO NETWORK SETTINGS FROM THE XMB AND DON'T CLICK IT. INSTEAD HOVER THERE AND PRESS PRESS L2+L1+L3+R1+R2+DOWN ON THE DPAD. \n\nI can't stress how important this is because after you press that combination the menu will expand and give you access to debug settings which you will find system update debud that you need to turn on. \n\nSTEP TWO\n\nThen makE a directory on your usb flash that looks like this\n\n PS3/UPDATE/PS3UPDAT.PUP\n\nrename the rogero downgrader pup I have included to PS3UPDAT.PUP and put it in the UPDATE folder. \n\ngo to system update from the xmb and update via storage media\n\nnow your ps3 will install and reboot into rogero but v9.99\n\nSTEP THREE \n\n\nON YOUR USB FLASH DRIVE IN DIRECTORY PS3/UPDATE/PS3UPDAT.PUP\n\nREINSTALL KMEAW 3.55 CFW \n\n\nSTEP FOUR\n\nRename habib113PS3UPDAT.PUP to PS3UPDAT.PUP AND Replace the PS3UPDAT.PUP in your flash drives directory PS3/UPDATE/PS3UPDAT.PUP\nnow you can install HABIBS' CFW 4.46 CEX through the xmb using the system update\n\nmake sure you chose from recovery media and let it install \n\n\nConfirmed working for me are PS1 PS2 the newest Reactpsn 2.26 along with psn stuff\n\nYou must use Multiman V 4.46 + to support this CFW\n\nAll thanks go to HABIB and all his friends that helped him create this CFW. \n\n(You must install from Kmeaw 3.55 CFW to avoid problems and you must reinstall Kmeaw 3.55 after you install rogeros downgrader before you install habibs' 4.46 CFW)\n\nGood Luck and Enjoy ","torrent":{"xt":"urn:btih:344a3a40211e8fe1e3b9c34db076ae44dff4b629","amp;dn":"CFW+4.46+CEX+by+HABIB+-+PS3+STABLE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"344a3a40211e8fe1e3b9c34db076ae44dff4b629","infoHashBuffer":{"type":"Buffer","data":[52,74,58,64,33,30,143,225,227,185,195,77,176,118,174,68,223,244,182,41]},"announce":[],"urlList":[]}}