{"title":"NEO Scavenger (v1.11) (GOG)","uid":12084206,"size":178225833,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:347da30fea8ba85d96052918a0e2a545e94bc25b&amp;dn=NEO+Scavenger+%28v1.11%29+%28GOG%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"-Virtus-","files":4,"time":1435852146,"description":"About the game:\n================\nNEO Scavenger is a game where you must survive in the wasteland long enough to figure out who you are. Each turn, you must decide where to go, how to scavenge for supplies, and how to deal with anything and anyone you encounter. And with each passing minute, the pit in your stomach grows, your dehydration worsens, your muscles tire, and your body temperature drops in the cold autumn air.\nChoose your starting abilities carefully, because they and your wits are the only tools you have in the apocalypse!\n\n\nFeatures:\n==========\nARealistic survival simulation, with complex wounds and treatments, illnesses, hunger, thirst, warmth, and carrying capacity. Death is permanent!\nA mix of sandbox and story play, with random content and character customization to make each replay different.\nA unique post-apocalyptic setting in near-future Michigan, with elements of science fiction and supernatural horror.\n\nVersion:\n=========\nGame version 1.11 or GOG setup 2.4.0.5, from June, 29 2015.\n\n\nVersion changes:\n=================\nPatch v1.11 \n\nNew changes include: \n- Game now looks in /data subfolder for xml data, instead of root game folder. \n- Game now loads data from either a single neogame.xml file or separate xml data files for each data type. \n- Game will try neogame.xml first, then separate files. \n- Base game data has been moved into separate data files, for easier reading. \n- Loading screen log messages are copied to the clipboard upon reaching the title screen. \n- Fixed a null-pointer bug in wounding code that occurred if no valid wound chosen before modifying stats. \n- Fixed a null-pointer bug in HandleCombatResponse if player died in combat. \n- Fixed a bug that caused Ginny to never give reward if all questions answered. \n- Fixed a bug that incorrectly identified string ID request for sounds as item IDs, causing crashes. \n\nThe main updates here are improvements to modding and bug fixes.\n\n\nInstructions:\n==============\nLaunch Setup and Install\nPlay - Enjoy - Seed!\n \n\nSystem Requirements:\n=====================\nOS: Windows XP/ Vista / 7 / 8\nCPU: 2.33GHz or faster x86-compatible processor\nGPU: DirectX 9.0c-compatible graphics card with 128 MB of VRAM\nRAM: 1 GB RAM \nHDD: 75 MB available space\n\n\n\n\n            If you enjoyed the game then share with others by seeding\n                        Remember to support quality games","torrent":{"xt":"urn:btih:347da30fea8ba85d96052918a0e2a545e94bc25b","amp;dn":"NEO+Scavenger+%28v1.11%29+%28GOG%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"347da30fea8ba85d96052918a0e2a545e94bc25b","infoHashBuffer":{"type":"Buffer","data":[52,125,163,15,234,139,168,93,150,5,41,24,160,226,165,69,233,75,194,91]},"announce":[],"urlList":[]}}