{"title":"Empires of the Dead by David Crane","uid":9329902,"size":8725616,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:34c93893ef089a286483b03cab78d60a8746adda&amp;dn=Empires+of+the+Dead+by+David+Crane&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"7","files":3,"time":1386707740,"description":"Empires of the Dead: How One Man's Vision Led to the Creation of WWI's War Graves by David Crane\n\n\nFormat: mobi/epub/azw3\nLength: 304 pages\nGenre: History\nDate: 26 September 2013\n\nShortlisted for the Samuel Johnson prize for non-fiction; the extraordinary and forgotten story behind the building of the First World War cemeteries, due to the efforts of one remarkable and visionary man: Fabian Ware.\n\nBefore WWI, little provision was made for the burial of the war dead. Soldiers were often unceremoniously dumped in a mass grave; officers shipped home for burial.\n\nThe great cemeteries of WWI came about as a result of the efforts of one inspired visionary. In 1914, Fabian Ware joined the Red Cross, working on the frontline in France. Horrified by the hasty burials, he recorded the identity and position of the graves. His work was officially recognised, with a Graves Registration Commission being set up. As reports of their work became public, the Commission was flooded with letters from grieving relatives around the world.\n\nCritically acclaimed author David Crane gives a profoundly moving account of the creation of the great citadels to the dead, which involved leading figures of the day, including Rudyard Kipling. It is the story of cynical politicking, as governments sought to justify the sacrifice, as well as the grief of nations, following the 'war to end all wars'.\n\nAuthor:\n\nDavid Crane's first book, 'Lord Byron's Jackal' was published to great acclaim in 1998, and his second, 'The Kindness of Sisters' published in 2002, is a groundbreaking work of romantic biography. In 2005 the highly acclaimed 'Scott of the Antarctic' was published, followed by 'Men of War', a collection of 19th Century naval biographies, in 2009. Crane lives in north-west Scotland.\n","torrent":{"xt":"urn:btih:34c93893ef089a286483b03cab78d60a8746adda","amp;dn":"Empires+of+the+Dead+by+David+Crane","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"34c93893ef089a286483b03cab78d60a8746adda","infoHashBuffer":{"type":"Buffer","data":[52,201,56,147,239,8,154,40,100,131,176,60,171,120,214,10,135,70,173,218]},"announce":[],"urlList":[]}}