{"title":"HISTORY OF POP AND ROCK MUSIC - part 530","uid":9140975,"size":415501201,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:350c7cec44416c892f0249eb49d3f0c7ca595d7d&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+530&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zlatkopupovac","files":-1,"time":1383512914,"description":"                     \n\n\n                      PART  530\n\n\n\n     Dream pop is a musical subgenre of pop rock and alternative rock.The term was first used for this type of music in the 1980s and is thought to relate to the 'immersion' in the music experienced by the listener. In the view of Simon Reynolds, dream pop &quot;celebrates rapturous and transcendent experiences, often using druggy and mystical imagery&quot;. Dream pop tends to focus on textures and moods rather than propulsive rock riffs. Vocals are generally breathy or sung in a near-whisper, and lyrics are often introspective or existential in nature.From the 1980s to 2000s, bands such as Pale Saints, The Church, The Sundays, The Dream Academy, Tori Amos, Belly, The Ocean Blue, Bel Canto, Hum, Cranes, Frazier Chorus, Strange Boutique, Curve, Spoonfed Hybrid, Spirea X, Kitchens of Distinction, and No-Man were representatives of the genre. In Europe, some bands emerged that mixed the genre with folk and electronic components, such as Stereolab, Beth Orton, Morcheeba, Dido, Bic Runga, Zero 7, The Legendary Pink Dots and Hooverphonic. Concurrently, a number of more predominantly guitar-driven dream pop bands emerged, including Alison's Halo, Low, Mazzy Star, Velour 100, Love Spirals Downwards, My Bloody Valentine, Doves and Tears Run Rings.\n\n\n           AMERICA  - The Last Unicorn (1982)\n           IN-MOOD Feat. JULLIETE - The Last Unicorn  (1999)\n           ARNOLD VEEMAN - Mon Cher Petit  (2004)\n           AUBURN  -  Cry  (2005)\n                                   \n\n     &quot;The Last Unicorn&quot; is a soundtrack album composed and arranged by Jimmy Webb, released in Germany in 1982 by Virgin Records. The songs were performed by America. The popular 1982 animated film was based on the acclaimed children's book &quot;The Last Unicorn&quot; by Peter Beagle. The title track plays while the scenes from the Unicorn Tapestries form a backdrop for the opening credits, and has been covered by Kenny Loggins on his Return to Pooh Corner album. The film's soundtrack that included the musical score as well as the songs was released in Germany by Virgin Records in 1982, but it has not been released in the United States. Mia Farrow's vocals, which appeared in the film, were overdubbed for the soundtrack album by Katie Irving.   \n\n    &quot;Cry&quot; is a song written by Liz Lenten &amp; Mark Gustavina. It is taken from the debut album &quot;Dreams&quot; by Auburn. . Album was produced by Wan Hewitt and  released in 2003.  In 2005 &quot;Cry&quot; reach no 5 in the indie video charts. Their first EP 'Sweet Sebastian' received extensive airplay, and sold out of its limited pressing within 2 weeks. They then teamed up with producer Tim Pettit, (Travis, Sun House and Carlene Carter) and recorded 'For Life', which also got great radio support and the band toured UK and played many live radio sessions. \n                  ","torrent":{"xt":"urn:btih:350c7cec44416c892f0249eb49d3f0c7ca595d7d","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+530","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"350c7cec44416c892f0249eb49d3f0c7ca595d7d","infoHashBuffer":{"type":"Buffer","data":[53,12,124,236,68,65,108,137,47,2,73,235,73,211,240,199,202,89,93,125]},"announce":[],"urlList":[]}}