{"title":"SmartDeblur 2.3 .Portable+Serial","uid":12006888,"size":25640787,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:353eccbac38fc4eb2f41181341beb4502f97214c&amp;dn=SmartDeblur+2.3+.Portable%2BSerial&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"glaresc","files":2,"time":1433925294,"description":"\nSmartDeblur is a user friendly and useful tool for restoring blurry and defocused images.Blurry images are universal in our life. There are many causes of that, camera shakes, defocussing, artificial blur via photo editors like Photoshop or Gimp.Many people think that blurring is an irreversible operation and the information in this case is lost for good. But it is not quite true - now you can restore your blurry images using SmartDeblur.\n\nNew release features a blind deblurring module which can automatically identify and remove complicated blur patterns in an image. Just load your image and click on the &quot;Analyze Blur&quot; button - the rest will be done automatically!\n\nFeatures\n\nComplex motion blur\nSmartDeblur can restore blur caused by camera shake. See results using real-world photos with complex blur path. Kernel was detected fully automatically without any user interactions.\n\nOut-of-Focus blur\nAlso you can restore defects caused by incorrect focus. See example with extra large defocus - there is no chance to read anything before processing. Of course result is far from ideal due to large information loss, but you can read the most text!\n\nGaussian blur\nBut not only motion and defocus blur - also you can enhance images distorted by artificial blur. For example, via image editors like Photoshop, Gimp etc.\n\nTuning\nGot bad results?\nDon't worry - just open kernel editor and correct detected blur path. Also you can select another region for blur analysis or use &quot;Aggressive Detection&quot; option.\n\nWhats New:\nUpdates: official site does not provide any info about changes in this version\n\nSystem Requirements\n\nWindows version\nOS: Windows XP, Vista, 7, 8 (32 or 64 bit)\nProcessor: 1 GHz or faster\nRAM: 2 GB or more\nDisk Space: 500MB or more\n\n\nPlease seed after download to help others","torrent":{"xt":"urn:btih:353eccbac38fc4eb2f41181341beb4502f97214c","amp;dn":"SmartDeblur+2.3+.Portable%2BSerial","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"353eccbac38fc4eb2f41181341beb4502f97214c","infoHashBuffer":{"type":"Buffer","data":[53,62,204,186,195,143,196,235,47,65,24,19,65,190,180,80,47,151,33,76]},"announce":[],"urlList":[]}}