{"title":"I Survived... - Season 5 - HD 720p","uid":11452397,"size":30119491901,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:3616afba19eb00b243b5eb236ddc88df7eeca1cb&amp;dn=I+Survived...+-+Season+5+-+HD+720p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"voltxrid","files":-1,"time":1415893581,"description":" &lt;a href=&quot;http://bayimg.com/kAElhaaGE&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/kAElhaaGE&lt;/a&gt;\n\n\n==================================\n\nI Survived... - Season 5 - HD 720p\n\n==================================\n\n\nEpisode 10 - &quot;The Norway Massacre: Sofie / Adrian / Magnus / Rebekka&quot; - December 16, 2012\n\nTwo hours after detonating a massive car bomb in Norway's capital, Oslo, the bomber, now disguised as a policeman, makes his way to Utoeya Island where 530 teenagers are attending a summer camp. During an 80 minute rampage he stalks and shoots the defenseless teenagers. Sofie, Adrian, Rebekka and Magnus survive the massacre, but 69 others die. \n\n\nEpisode 11 - &quot;Louie and Wade / Sayeh&quot; - December 30, 2012\n\nTwo Canadian forest workers are attacked by a grizzly bear, leaving one of the men scalped. In Pensacola, Florida, an 8-year-old and her little sister are abducted by their mother's pedophile ex-boyfriend. He drives them into the woods where, after repeatedly raping the older girl, slits both their throats and leaves them to die.\n\n\nEpisode 12 - &quot;John / Kevin / Helena&quot; - March 3, 2013\n\nIn Kirkwood, Missouri a disgruntled contractor executes the city officials he believes wronged him, but one, the City Attorney, fights back. A man is subjected to a vicious storm that lashes against his fishing boat in the Atlantic Ocean. A 17-year-old is raped at gunpoint in Santa Barbara, California.\n\n\nEpisode 13 - &quot;Brent / Hanna and Miranda / Karen&quot; - March 10, 2013\n\nAn Atlanta, Georgia stockbroker is attacked by Mark O. Barton, a man who used to trade at his facilities. Two sisters must find shelter after their rowboat capsizes on a frozen Alaska lake. A Hackettstown, New Jersey woman is abducted at gunpoint for ransom by a man with a grudge against her family.\n\n\nEpisode 14 - &quot;Hostage: Keith and Marc&quot; - March 17, 2013\n\nA routine drug surveillance mission over the Colombian jungle turns into a nightmare when Keith and Marc's plane crash-lands and they are captured by FARC guerillas and held hostage for five grueling years.\n\n\nEpisode 15 - &quot;Amy / Trish and Darrell&quot; - March 24, 2013\n\nA New Haven, Connecticut bartender is raped and beaten with a tree branch by a co-worker. A family seeks shelter as a tornado rips apart their Henryville, Indiana home.\n\n\nEpisode 16 - &quot;Angel / Elyse / Richard&quot; - March 31, 2013\n\nA woman is shot and run over with a car in Webster, Texas. A snowboarder survives an avalanche in Washington state. A Dallas lawyer is shot in the neck by a former client.\n\n\nEpisode 17 - &quot;Morgan and Aaron / David / Amanda&quot; - April 7, 2013\n\nTwo minor league baseball players are held hostage in a Bonifay, Florida motel. An Alaskan fishing boat catches fire. A convenience store worker in Cedar Rapids, Iowa is abducted, taken to an apartment and raped.\n\n\nEpisode 18 - &quot;Kristen / Kimball / Thadius&quot; - April 14, 2013\n\nA college student is abducted in Newark, Delaware and sexually assaulted in a cellar. A man swims to shore after his boat sinks in Strawberry Reservoir, Utah. A 12-year-old from Baraboo, Wisconsin is kidnapped and tortured by his neighbor, who twists his ankles until they snap.\n\n\nEpisode 19 - &quot;Hurricane Sandy: Mike / Chris / Neza&quot; - June 2, 2013\n\nHurricane Sandy hits the Eastern Seaboard of the United States, causing devastation and bringing New York City to its knees. One man is swept out to sea in pitch darkness as his beachfront cottage is torn apart by waves.\n\n\nEpisode 20 - &quot;Regan / Gary and Scott&quot; - June 9, 2013\n\nA 14 year old and her friend are abducted and taken to a house in the orange groves outside Vero Beach, Florida whre they are repeatedly sexually assaulted. Two men are horrifically burned in a plane crash.\n\n\nEpisode 21 - &quot;David / Sandy and Ken / Maura&quot; - June 16, 2013\n\nA 13-year-old boy from San Bernardino County, California is abducted and raped. A nanny is attacked by a crocodile in Africa. A Pacifica, California woman is carjacked and stabbed 4 times.\n\n\nEpisode 22 - &quot;Singer / Romina and John&quot; - June 23, 2013\n\nFour young Americans, kidnapped in Kyrgyzstan, face a desperate situation: kill or be killed. And a young couple's dream holiday at a Thai beach resort turns into a terror-filled fight for survival as a tsunami strikes.\n\n\nEpisode 23 - &quot;Dorothy / Jim / Bud and Katrina&quot; - June 30, 2013\n\nA mother in Eustis, Florida is abducted, raped in front of her children, shot four times and left to die. A man picking blueberries alone in Clayton, Georgia is bitten by a Timber Rattlesnake. A gunman open-fires at a swimming hole in Niagara, Wisconsin.\n\n\nEpisode 25 - &quot;Rhonda / Jason / Patrick&quot; - July 14, 2013\n\nA Pensacola, Florida woman is kidnapped, stabbed and raped, but fakes amnesia to escape her attacker. A Henryville, Indiana man clings to his mobile home when a tornado threatens to rip it from the ground. A man is brutally shot by his brother-in-law at his family Thanksgiving dinner in Jupiter, Florida.\n\n\nEpisode 26 - &quot;Shaunna and Brad / Lee / Emily&quot; - July 21, 2013\n\nA woman and her boyfriend are shot by her ex-partner before he sets their Los Angeles, California home on fire. A man pinned by his arm after wrecking his van faces amputation to escape. A single mom from Grape Creek, Texas is attacked by an intruder and has her neck sawn open, but plays dead in order to live.\n\n\n\n\nI have scoured the Internet for episodes 1-9 and 24, but cannot find them available anywhere.  Furthermore, the shows that are currently marketed for streaming are either out of their original sequence or labeled differently by their video providers.  Not sure why this all is, but it's the reason the season is not complete here.  I still wanted to share what was available, though - in the correct order, too.  If I ever happen to locate the omitted episodes then I will surely add them at that time.\n\nAlso, if problems or inconsistencies with any of the content files are noticed, please let me know via the comments and I will attempt to upload some corrected replacements.  Thanks much and enjoy!  :-)","torrent":{"xt":"urn:btih:3616afba19eb00b243b5eb236ddc88df7eeca1cb","amp;dn":"I+Survived...+-+Season+5+-+HD+720p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3616afba19eb00b243b5eb236ddc88df7eeca1cb","infoHashBuffer":{"type":"Buffer","data":[54,22,175,186,25,235,0,178,67,181,235,35,109,220,136,223,126,236,161,203]},"announce":[],"urlList":[]}}