{"title":"Brainstorm - Bremen 1973 (Jazzy Krautrock @256)","uid":3377897,"size":150933902,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:36665545af9c1ccc8ad69421386485e2fe9c5018&amp;dn=Brainstorm+-+Bremen+1973+%28Jazzy+Krautrock+%40256%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"test78","files":10,"time":1125642381,"description":"Search for test78 to find my other uploads.\n\nReviewed by: Stephanie Sollow, August 2003 \nIn 1973 the German jazz-rock band Brainstorm played live on a &quot;rainy Saturday outside the machine shed of the Bremen College Of Technology,&quot; a show that was broadcast live by Radio Bremen as part of their &quot;Jazz Live&quot; show. Garden Of Delights releases on CD the complete performance. The live line up was the same as on the studio releases: Roland Schaeffer on vocals, clarinet, guitar and sax, Eddy Von Overheidt on keyboards, Rainer Bodensohn on flute and bass, Enno Demov on bass and guitar, and Jo Koinzer on drums.\n\nOverall, what stands out about Brainstorm live are the flute and saxophone passages that are all over this jazz rock release. The band played mainly material from their second album, Second Smile, with three tracks from their debut Smile A While. Well, technically four, since &quot;You're The One,&quot; performed here with that title, was released on the first album as &quot;You Are What's Gonna Make It Last.&quot; This is the track that starts out sounding as if they're going to break into a rendition of &quot;Feeling Alright,&quot; as I alluded to in my review of Second Smile (though, as I've learned, not Clapton but Joe Cocker). Having not heard their first album as yet, the two tracks I'm unfamiliar with open their live set, &quot;Zwick Zwick&quot; and &quot;Das Schwein Tr&amp;uuml;gt&quot; (the third is track that closes their set, &quot;Snakeskin Tango&quot; which is short bit of honking, wheezy, bouncy craziness).\n\n&quot;My Way&quot; doesn't translate well live. While it's an anachronistic reference, I couldn't help but think of Roland Schaeffer (vocals, clarinet, guitar, sax) as Bill Murray as a lounge singer, singing &quot;Star Wars? &quot; If you've see the skit on Saturday Night Live, you'll know what I mean. Musically, it rolls right into a heavy, fusiony jam, but those first few moments? erm, well, I don't remember thinking of Murray when listening to its studio version. Schaeffer gets a little more torchy for the latter half of this piece, as the rhythm slows down, gets a little sultry and laid back. \n\n&quot;There Was A Time?&quot; begins with a flurry of notes being played, like a little tornado twirling through, before what remains behind slowly resolves itself from what I think of late night, no one in the bar but the band and bartender, jazz before coalescing into something a little less &quot;freeform.&quot; More &quot;traditional&quot; jazz. While the studio version was 7 minutes, this live version I more than 14 minutes. &quot;Hirmwind,&quot; which comes two tracks later, goes from having been a 5-plus minute studio version to here a 21 minute live version. Funnily enough, the wordless opening section recalls &quot;My Way&quot; (again you could sing &quot;Star Wars&quot; to it). The spaciness of the studio version is only partially present her in the live setting, Dernov's bass back in the mix until about the 3 minute mark. Of course, the time is lengthened by solos, including the obligatory drum solo. \n\nIf you like noodly jazz, and want to hear it performed in a live setting, then Bremen 1973 is the CD to get. As a live recording, the sound is very, very good. Aside from the live feel ? and the obvious audience applause between pieces ? you'd not really know it was live. The vocal performance on &quot;Marilyn Monroe&quot; is a bit weak and recorded quietly, but the music otherwise comes through. Each instrument can be clearly heard, each cymbal crash, keyboard note, each throb of the bass, etc.\n\n256kbs\n\nTracklist:\n\n1. Zwick zwick (5:29)\n2. Das Schwein tr&amp;uuml;gt (5:00)\n3. You're the one (5:19)\n4. My way (9:53)\n5. There was a time... (14:23) \n6. Affenzahn (5:07)\n7. Hirnwind (21:01)\n8. Marilyn Monroe (9:44)\n9. Snakeskin tango (2:35)\n\nEnjoy!","torrent":{"xt":"urn:btih:36665545af9c1ccc8ad69421386485e2fe9c5018","amp;dn":"Brainstorm+-+Bremen+1973+%28Jazzy+Krautrock+%40256%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"36665545af9c1ccc8ad69421386485e2fe9c5018","infoHashBuffer":{"type":"Buffer","data":[54,102,85,69,175,156,28,204,138,214,148,33,56,100,133,226,254,156,80,24]},"announce":[],"urlList":[]}}