{"title":"Paintings by John William Waterhouse","uid":7380206,"size":20007565,"categoryP":"other","categoryS":"pictures","magnet":"?xt=urn:btih:3710d6cf5d114e25b73ad759ab121163dd920d47&amp;dn=Paintings+by+John+William+Waterhouse&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":-1,"time":1340479198,"description":"From Wikipedia:\n\nJohn William Waterhouse (born 6 April 1849; died 10 February 1917) was an English painter known for working in the Pre-Raphaelite style. He worked several decades after the breakup of the Pre-Raphaelite Brotherhood, which had seen its heyday in the mid-nineteenth century, leading him to have gained the moniker of &quot;the modern Pre-Raphaelite&quot;.[1] Borrowing stylistic influences not only from the earlier Pre-Raphaelites but also from his contemporaries, the Impressionists,[1] his artworks were known for their depictions of women from both ancient Greek mythology and Arthurian legend.\n\nBorn in Italy to English parents who were both painters, he later moved to London, where he enrolled in the Royal Academy of Art. He soon began exhibiting at their annual summer exhibitions, focusing on the creation of large canvas works depicting scenes from the daily life and mythology of ancient Greece. Later on in his career he came to embrace the Pre-Raphaelite style of painting despite the fact that it had gone out of fashion in the British art scene several decades before.\n\nAlthough not as well known as earlier Pre-Raphaelite artists such as Dante Gabriel Rossetti, John Everett Millais and William Holman Hunt, Waterhouse's work is currently displayed at several major British art galleries, and the Royal Academy of Art organised a major retrospective of his work in 2009.","torrent":{"xt":"urn:btih:3710d6cf5d114e25b73ad759ab121163dd920d47","amp;dn":"Paintings+by+John+William+Waterhouse","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3710d6cf5d114e25b73ad759ab121163dd920d47","infoHashBuffer":{"type":"Buffer","data":[55,16,214,207,93,17,78,37,183,58,215,89,171,18,17,99,221,146,13,71]},"announce":[],"urlList":[]}}