{"title":"The Bad Boy's Secret by Susan Stevens","uid":9629424,"size":224734,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:38084f2295c034dd274ccfe5eb332cf69a76dd12&amp;dn=The+Bad+Boy%27s+Secret+by+Susan+Stevens&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"PirateBook","files":1,"time":1392650902,"description":"\nt was the typical story of a childhood friendship. The older boy across the street who earned spare change by babysitting her from time to time, in her upperclass home. He remained the down-to-earth badass who put a different kind of adventure in her life, but never let her have a taste of danger. When his family moved to the middle of no where Midwest, they kept sporadically in touch. He fell in with a crowd of lower class kids, all struggling to make it in the world, walking the streets with switchblades and jumping upperclass rich kids, sleeping on couches instead of returning to broken homes.\n\n... But when she suddenly shows up, pretty still on the outside, but broken on the inside, it's up to her to find her place in the world. He won't let her associate with the riffraff he's fallen in with, unless its in secret, in hidden places. He won't let her fall to where he now lives, but feels betrayed when her heart falls for his enemy.\n\nWhat happened to her in the big city that makes her cry at night, scream from nightmares? Can he take care of her the way he used to, or will she fall farther than he can reach?\n\nGenre: Mystery/Thriller","torrent":{"xt":"urn:btih:38084f2295c034dd274ccfe5eb332cf69a76dd12","amp;dn":"The+Bad+Boy%27s+Secret+by+Susan+Stevens","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"38084f2295c034dd274ccfe5eb332cf69a76dd12","infoHashBuffer":{"type":"Buffer","data":[56,8,79,34,149,192,52,221,39,76,207,229,235,51,44,246,154,118,221,18]},"announce":[],"urlList":[]}}