{"title":"Among the Dead Cities: The History and Moral Legacy -epub","uid":8364013,"size":8156971,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:387ba5ffaff37d1b58add7e69d6fb30364b3d647&amp;dn=Among+the+Dead+Cities%3A+The+History+and+Moral+Legacy+-epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bookzilla","files":1,"time":1365716737,"description":"Among the Dead Cities: The History and Moral Legacy of the WWII Bombing of Civilians in Germany and Japan (Is the Targeting of Civilians in War Ever Justified?\n\n\n\nWhen Nuremberg was scouted in 1945 as a possible site for the Nazi war crime trials, an American damage survey of Germany described it as being &quot;among the dead cities&quot; of that country, for it was 90% destroyed, its population decimated, its facilities lost. As a place to put Nazis on trial, it symbolized the devastation Nazism brought upon Germany, while providing evidence of the destruction the Allies wrought on the country in the course of the war.\n \nIn Among the Dead Cities, the acclaimed philosopher A. C. Grayling asks the provocative question, how would the Allies have fared if judged by the standards of the Nuremberg Trials? Arguing persuasively that the victor nations have never had to consider the morality of their policies during World War II, he offers a powerful, moral re-examination of the Allied bombing campaigns against civilians in Germany and Japan, in the light of principles enshrined in the post-war conventions on human rights and the laws of war.\n \nIntended to weaken those countries' ability and will to make war, the bombings nonetheless destroyed centuries of culture and killed some 800,000 non-combatants, injuring and traumatizing hundreds of thousands more in Hamburg, Dresden, and scores of other German cities, in Tokyo, and finally in Hiroshima and Nagasaki. &quot;Was this bombing offensive justified by the necessities of war,&quot; Grayling writes, &quot;or was it a crime against humanity? These questions mark one of the great remaining controversies of the Second World War.&quot; Their resolution is especially relevant in this time of terrorist threat, as governments debate how far to go in the name of security.\n \nGrayling begins by narrating the Royal Air Force's and U. S. Army Air Force's dramatic and dangerous missions over Germany and Japan between 1942 and 1945. Through the eyes of survivors, he describes the terrifying experience on the ground as bombs created inferno and devastation among often-unprepared men, women, and children. He examines the mindset and thought-process of those who planned the campaigns in the heat and pressure of war, and faced with a ruthless enemy. Grayling chronicles the voices that, though in the minority, loudly opposed attacks on civilians, exploring in detail whether the bombings ever achieved their goal of denting the will to wage war. Based on the facts and evidence, he makes a meticulous case for, and one against, civilian bombing, and only then offers his own judgment. Acknowledging that they in no way equated to the death and destruction for which Nazi and Japanese aggression was responsible, he nonetheless concludes that the bombing campaigns were morally indefensible, and more, that accepting responsibility, even six decades later, is both a historical necessity and a moral imperative.\n \nRarely is the victor's history re-examined, and A. C. Grayling does so with deep respect and with a sense of urgency &quot;to get a proper understanding for how peoples and states can and should behave in times of conflict.&quot; Addressing one of today's key moral issues, Among the Dead Cities is both a dramatic retelling of the World War II saga, and vitally important reading for our time.\n\n\n2006","torrent":{"xt":"urn:btih:387ba5ffaff37d1b58add7e69d6fb30364b3d647","amp;dn":"Among+the+Dead+Cities%3A+The+History+and+Moral+Legacy+-epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"387ba5ffaff37d1b58add7e69d6fb30364b3d647","infoHashBuffer":{"type":"Buffer","data":[56,123,165,255,175,243,125,27,88,173,215,230,157,111,179,3,100,179,214,71]},"announce":[],"urlList":[]}}