{"title":"Flikken Seizoen 3 dvd 2(Dutch) TBS","uid":6245614,"size":4562632361,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:39ad3f804692dd159ad0cc0d5527797bfa5bea58&amp;dn=Flikken+Seizoen+3+dvd+2%28Dutch%29+TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mad_Parrot","files":-1,"time":1300226858,"description":"\n\nFlikken Seizoen 3 dvd 2\n\n\n\nDe serie werd gecreÃƒÂ«erd door scenarioschrijver Pierre De Clercq en producent Erwin Provoost en was een coproductie van het productiehuis MMG en VRT en, seizoen 5 en 6, ook de Nederlandse TROS.\n\nDe serie Flikken heeft de Vlaamse stad Gent als achtergronddecor. Het lokale politieteam staat centraal in de serie en niet een of twee hoofdpersonages. De makers hadden bij aanvang van de serie zoveel vertrouwen in de serie, dat de opnames voor de tweede reeks in 1998 al begonnen waren, voordat de eerste aflevering uitgezonden was. \nIn de eerste reeks was er geen doorlopend verhaal tussen de verschillende afleveringen, dit volgde pas in de latere reeksen. Zo gingen de flikken, bijgestaan door de Nederlandse rechercheur Robert Nieuwman (Boudewijn de Groot), in 2004 op zoek naar de seriemoordenaar Luc Feiremans.\n\nIn april 2007 maakte de Vlaamse omroep VRT bekend dat het tiende seizoen van Flikken het laatste zou zijn. De financiÃƒÂ«n speelden hierbij een rol. De serie kostte veel geld, terwijl de VRT veel andere fictiereeksen op de rol had staan. \nHet slotseizoen, dat overigens maar tien afleveringen heeft in plaats van de gebruikelijke dertien, werd van 15 februari tot 19 april 2009 uitgezonden op ÃƒÂ©ÃƒÂ©n.[1]\n\nOm Flikken een waardige afsluiter te geven werd er op zaterdag 18 april 2009 in Gent een Flikkenparty georganiseerd. Op het einde van de dag kon in Kinepolis Gent de laatste Flikken-aflevering in avant-premiÃƒÂ¨re bekeken worden.\n\nSinds september 2007 zendt de TROS een Nederlandse versie van Flikken uit, Flikken Maastricht. Deze serie is qua cast kleinschaliger dan de originele serie.\n\n30 &quot;Stoffelijke schade&quot; 23 september 2001 3.04 \nBij een wegcontrole in de nacht probeert een auto te vluchten. De afloop is fataal. De passagier is dood. Maar wie is zij? De bestuurder is gevlogen.  \n\n31 &quot;Thuis&quot; 30 september 2001 3.05 \nEen jongetje wordt betrapt bij een kleine diefstal. Er lijkt niets aan de hand te zijn. Totdat blijkt dat er thuis meer aan de hand is dan in eerste instantie leek.  \n\n32 &quot;Blinde hoek&quot; 14 oktober 2001 3.06 \nEen chauffeur wordt zwaargewond naast zijn auto aantroffen midden in de woonwijk voor zijn huis op klaarlichte dag. De hele buurt weet van niets.  \n\n33 &quot;Horen en zien&quot; 21 oktober 2001 3.07 \nEen crimineel weet vÃƒÂ³ÃƒÂ³r zijn berechting uit het gerechtshof te ontsnappen. Raymond weet meer van de crimineel en probeert de zaak te bemachtigen ten koste van de Federale politie.  \nSpotinformatie \n\nCategorie     : Beeld \nFormaat       : DVD5\nBron          : Retail\nMenu          : Ja\nExtra's       : Ja\nAudio         : Nederlands\nOndertitels   : Nederlands (instelbaar)\nCover &amp; label : Ja\nGenre         : Actie\n \n &lt;a href=&quot;\nhttp://nl.wikipedia.org/wiki/Flikken_(televisieserie)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://nl.wikipedia.org/wiki/Flikken_(televisieserie)&lt;/a&gt;\n\n &lt;a href=&quot;\nhttp://www.een.be/programmas/flikken&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.een.be/programmas/flikken&lt;/a&gt;\n\n\n\nBrought to you by TinkerBell @ TBS","torrent":{"xt":"urn:btih:39ad3f804692dd159ad0cc0d5527797bfa5bea58","amp;dn":"Flikken+Seizoen+3+dvd+2%28Dutch%29+TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"39ad3f804692dd159ad0cc0d5527797bfa5bea58","infoHashBuffer":{"type":"Buffer","data":[57,173,63,128,70,146,221,21,154,208,204,13,85,39,121,123,250,91,234,88]},"announce":[],"urlList":[]}}