{"title":"Noches De Tormenta DVDRip Spanish 2008","uid":4715496,"size":736166049,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3a677bc3b54706a74ab686c6a7ff1640b5ee05a7&amp;dn=Noches+De+Tormenta+DVDRip+Spanish+2008&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mois20","files":4,"time":1234256976,"description":"Adrienne Willis (Diane Lane) es una mujer cuya vida estÃƒÂ¡ sumergida en caos y que ahora se ha retirado a un pueblecito costero de Rodanthe, en los Outer Banks de Carolina del Norte, para hacerse cargo de la posada de una amiga durante un fin de semana. AquÃƒÂ­ Adrienne, infelizmente casada, espera encontrar la tranquilidad que necesita desesperadamente para reflexionar sobre los conflictos que tiene a su alrededor -un marido infiel que quiere volver a casa y una hija adolescente que cuestiona todas sus decisiones-. Nada mÃƒÂ¡s llegar Adrienne a Rodanthe, se pronostica una gran tormenta y llega un huÃƒÂ©sped llamado Dr. Paul Flanner (Richard Gere). El mÃƒÂ©dico Flanner no estÃƒÂ¡ allÃƒÂ­ para un descanso de fin de semana, sino para enfrentarse a su propia crisis de conciencia. Ahora, a medida que se acerca la tormenta, los dos se consuelan mutuamente y, en un fin de semana mÃƒÂ¡gico, ponen en marcha el romance que no solo les cambiarÃƒÂ¡ la vida sino que les marcarÃƒÂ¡ para siempre... AdaptaciÃƒÂ³n de otra novela del popular autor norteamericano de best-sellers romÃƒÂ¡nticos Nicholas Sparks (El diario de Noah, Un paseo para recordar, Mensaje en una botella).","torrent":{"xt":"urn:btih:3a677bc3b54706a74ab686c6a7ff1640b5ee05a7","amp;dn":"Noches+De+Tormenta+DVDRip+Spanish+2008","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3a677bc3b54706a74ab686c6a7ff1640b5ee05a7","infoHashBuffer":{"type":"Buffer","data":[58,103,123,195,181,71,6,167,74,182,134,198,167,255,22,64,181,238,5,167]},"announce":[],"urlList":[]}}