{"title":"PhotoDraw 2000","uid":4486631,"size":794150385,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:3a7e5bb597ff20e3a34ea82540d0160d43ec7a5c&amp;dn=PhotoDraw+2000&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"bakjoo","files":6,"time":1225799482,"description":"MICROSOFT\nPHOTODRAW 2000, version 2\nreviewed by Jim Sutherland\n\nPhotoDraw 2000 Version 2 is billed as the, &quot;MS Office Graphics Program.&quot; \nIn spite of that proclamation, MS Office is not a prerequisite. \nPhotoDraw 2000 can and will function as a standalone program. \nMicrosoft has combined traditionally separate types of graphics programs, \ndrawing and photo/graphic editing, into a single program that shares a common work space. \nIt is designed to open, create, and edit just about any graphic format you can think of. \nIt even has the ability to create web-ready elements such as buttons, banners, and animations.\n\nInstallation is as simple as inserting Disc1, provided your &quot;auto-insert notification&quot; \nis enabled for your CD-drive. Total install time was about five minutes and a complete \ninstall will occupy approximately 190MB of disc space.\n\nPhotoDraw&amp;#039;s real benefit for the average Joe&amp;#039;s &amp; Jane&amp;#039;s of the computer world is the \nabsolute need to know NOTHING about graphics concepts or jargon! Don&amp;#039;t quite understand \nthe different graphics formats or image resolutions? A little fuzzy on the difference \nbetween vector graphics (images made up of points, lines, and shapes rather than individual \npixels resulting in small files that can be scaled without affecting image quality) and raster \ngraphics (image files that store information for each individual pixel, commonly known as \nbitmapped images)? Can&amp;#039;t recall what effect produces what output? Well, all is forgiven with \nPhotoDraw. Much like the way Windows acts as a visual bridge to system-level text commands, \nso does PhotoDraw provide visual aid to graphic manipulation and creation.\n\nThe program uses unique interface elements such as a Picture List that shows all open documents, \na Visual Menu that uses icons to identify tasks, and a Workpane that displays options for the \ncurrent operation. You literally see what you get...before you get it! The icons that identify \ntasks/effects are formatted to look like the effect they produce. All this &amp;#039;visualization&amp;#039; \ncomes at the cost of having a slightly busy interface and a sometime crowded screen. \nI would recommend no less than a 17&quot; monitor set to 1024x768 resolution for acceptable elbow room. \nEven with that proviso, the interface is always highly comprehensible. \nPhotoDraw&amp;#039;s ease-of-use is undeniable. It offers 300 business templates for brochures, flyers, \nletterheads, business cards, Web banners, and but-tons.\n\nWhile PhotoDraw&amp;#039;s templates look great, they concentrate on design elements and single-page documents, \nso multi-page creators must look elsewhere. I suppose you could just keep making new single-page\ndocuments that follow the design of the original, but that would probably be quite time consuming \nand tedious, not to mention contrary to PhotoDraw&amp;#039;s simplicity mandate. Sharing images with other \napplications is quite easy; just drag and drop pictures into other programs. I had no problem dropping \nimages into PaintShop Pro or Photoshop. PhotoDraw offers several unique options when working with other\nOffice applications. For example, you can launch PowerPoint (a presentation program) or \nFrontPage (a web-page design program) directly from PhotoDraw to insert images. \nAnd, in keeping with the simplicity concept, PhotoDraw shares color palettes and theme templates \nwith other Office applications. That will save you countless hours of reformatting when moving \nobjects/projects from one application to the other.\n\nWith the drawing and painting tools you can create your own objects or spice-up others. \nThere is a wide variety of artistic brush strokes, such as dry brush or charcoal, \nthat you can use to create an image or outline an existing one. While the effects are not as \nrobust as some dedicated painting programs such as Dabbler, the results are more than acceptable \nfor all but the most demanding professional. \n\nPainting is a &quot;free-hand&quot; style in that whatever effect you choose will follow the path \nyou created by dragging the pointer, regardless of how many turns or twists you may make. \nDrawing, on the other hand, allows you to create precise shapes and gives a much greater \ndegree of control. If you absolutely, positively, have to have a perfectly straight line \nin your work, use the drawing tools, but if you want a more home-spun look, then the paint \ntools are for you. Either way, the process is simple, painless, and produces excellent results.\n\nOne group of tools, the Photo Brushes, is especially neat. The brushes can outline images, \npredefined shapes, or hand drawn items with a variety of preset objects such as paper doll \nchains, alligators, or pencils. Unfortunately, you cannot define your own graphic to become \nan outline, but the ones provided seem to have enough variety.\n\nAutoshapes and Shapes are twin sons of different mothers. Let me explain. They each provide a\nway to insert shapes, as the names suggest, but each has its own unique shapes and method of \ninsertion. Autoshapes draws the actual shape from the moment you start dragging the mouse until \nyou stop. By contrast, with Shapes, you drag an empty box to the size you want and the program \nfills it in with your selection. As with everything else, they can be modified and adjusted to \nyour hearts content. In either case, placing and assembling graphics such as stars, flowchart \nsymbols, and just plain shapes is extremely quick and easy.\n\nFor text, PhotoDraw 2000 offers 200 fonts and a variety of excellent 3-D effects. \nYou can bend text around an arched or circular shape, but you can&amp;#039;t flow text along an irregular path, \nlike the edge of a waving flag. Each text and painted piece is an individual object that can be \nmanipulated at any time with a multitude of effects. A multiple undo feature lets you correct \nmodifications several steps at a time (note- the undo feature is available globally, not just for text \nmodifications). You can view all the modifications in a drop-down list and undo multiple steps at once, \nrather than continually clicking the undo icon. It saves time but I would have liked to been able to pick \neach modification individually, say numbers two and six, rather than one thru six. A minor quibble, \nI know, but I gotta complain about something! PhotoDraw also supports extra plug-ins \n(plug-ins are small &quot;helper&quot; programs that work with and rely on host pro-grams to apply their unique \neffects usually designed by third party developers) for additional content and effects. \nPhotoDraw can&amp;#039;t import text files of any kind, and I found that inserting large text blocks slowed \ndown the program&amp;#039;s performance somewhat.\n\nIf you design web pages, PhotoDraw&amp;#039;s Web Effects tools offer a wonderful gallery of predefined styles. \nYou can include hyperlinks (special strings of text that tell your browser to go to a specific web-site \nwhen clicked on), slice images, and create animated GIFs. And, PhotoDraw can even create rollover buttons \n(rollovers are effects that change the appearance of the selected object when you hover over or click it). \nWhen creating a Web page, all text is treated as a graphic. That&amp;#039;s a mixed blessing; on a positive note, \nif you resize the text-box, the text will auto-fill to an appropriate size to maintain readability; \non the negative side, you can&amp;#039;t apply an effect to just some text to make it standout. It&amp;#039;s a minor annoyance \nif you are accustomed to using desktop publishing programs like Publisher that allow such text manipulation. \nAlso, you can&amp;#039;t assign hyperlinks to a text string located within a block of text. It too must be in a \nseparate text-box. In addition to various templates for producing Web graphics, PhotoDraw provides a Web \ncolor palette, a Web wizard to help you save your file in the optimal format, and a preview option that \ndisplays different settings and download times. The Web wizard provides feedback on image quality and download \ntimes but offers only simple choices for GIF or JPEG output. If you want more control over the image settings, \nyou must use the Save As dialog box, which unfortunately has no preview.\n\nAssembling the various images you create to fashion a Web page requires a separate Web editor such as Front Page. \nHelp is available at every step with a tutorial offering sample projects, the Answer Wizard, and a dialog box that \naccompanies every icon. Microsoft&amp;#039;s attempt to provide a full-featured, yet simple-to-use integrated graphics \nprogram is a success. PhotoDraw 2000 offers neophyte graphic artists just enough creative guidance, and an abundance \nof powerful tools that are easy to use and understand, needed to design professional looking projects.\nAbove all, using PhotoDraw 2000 is simple and just plain fun! Even my nine and twelve year-old sons were working \nsolo after only a few minutes of instruction from yours truly. Regardless of how you feel about Microsoft, \nreverence or loathing, you have to give them kudos for developing a truly workable, useful, and stable (so far!) program. \n\n\n\n// Bakjoo","torrent":{"xt":"urn:btih:3a7e5bb597ff20e3a34ea82540d0160d43ec7a5c","amp;dn":"PhotoDraw+2000","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3a7e5bb597ff20e3a34ea82540d0160d43ec7a5c","infoHashBuffer":{"type":"Buffer","data":[58,126,91,181,151,255,32,227,163,78,168,37,64,208,22,13,67,236,122,92]},"announce":[],"urlList":[]}}