{"title":"Paul Ricoeur - Philosophical Works (14 books)","uid":9372913,"size":168980488,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3baee75ad3f48d4ee8fa7ba640dcd11e95b08c81&amp;dn=Paul+Ricoeur+-+Philosophical+Works+%2814+books%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"workerbee","files":-1,"time":1387562855,"description":"\nPAUL RICOEUR (1913-2005) was a French philosopher best known for combining phenomenological description with hermeneutics.  As such, his thought is situated within the same tradition as other major hermeneutic phenomenologists, Martin Heidegger and Hans-Georg Gadamer.  In 2000 he was awarded the Kyoto Prize in Arts and Philosophy for having &quot;revolutionized the methods of hermeneutic phenomenology, expanding the study of textual interpretation to include the broad yet concrete domains of mythology, biblical exegesis, psychoanalysis, theory of metaphor, and narrative theory.&quot;\n\n\nAll the following books are in PDF format:\n\n* A KEY TO EDMUND HUSSERL'S IDEAS I (Marquette University Press, 1996).  Translated by Bond Harris and Jacqueline Bouchard Spurlock.  Edited, translation revised, and with an Introduction by Pol Vandevelde.\n\n* THE COURSE OF RECOGNITION (Harvard University Press, 2005).  Translated by David Pellauer.\n\n* CRITIQUE AND CONVICTION: Conversations with Francois Azouvi and Marc de Launay (Columbia University Press, 1998).  Translated by Kathleen Blamey.\n \n* FREEDOM AND NATURE: The Voluntary and the Involuntary (Northwestern University Press, 1966).  Translated by Erazim V. Kohak.\n\n* FREUD AND PHILOSOPHY: An Essay on Interpretation (Yale University Press, 1970).  Translated by Denis Savage.\n\n* THE JUST (University of Chicago Press, 2000).  Translated by David Pellauer.\n\n* LECTURES ON IDEOLOGY AND UTOPIA (Columbia University Press, 1986).  Edited by George H. Taylor.\n\n* LIVING UP TO DEATH (University of Chicago Press, 2009).  Translated by David Pellauer.\n\n* MEMORY, HISTORY, FORGETTING (University of Chicago Press, 2004).  Translated by Kathleen Blamey and David Pellauer.\n\n* ONESELF AS ANOTHER (University of Chicago Press, 1992).  Translated by Kathleen Blamey.\n\n* THE RULE OF METAPHOR: The Creation of Meaning in Language (Routledge, 1978).  Translated by Robert Czerny with Kathleen McLaughlin and John Costello, SJ.\n\n* TIME AND NARRATIVE, 3 volumes (University of Chicago Press, 1985-88).  Translated by Kathleen McLaughlin and David Pellauer (Vols. 1 &amp; 2), Kathleen Blamey and David Pellauer (Vol. 3).\n","torrent":{"xt":"urn:btih:3baee75ad3f48d4ee8fa7ba640dcd11e95b08c81","amp;dn":"Paul+Ricoeur+-+Philosophical+Works+%2814+books%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3baee75ad3f48d4ee8fa7ba640dcd11e95b08c81","infoHashBuffer":{"type":"Buffer","data":[59,174,231,90,211,244,141,78,232,250,123,166,64,220,209,30,149,176,140,129]},"announce":[],"urlList":[]}}