{"title":"Testament - Low (1994) [EAC-FLAC]","uid":4200169,"size":350806080,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:3d6e4bb98dfdaa51c15fbdcb9eab6bef51dcfcef&amp;dn=Testament+-+Low+%281994%29+%5BEAC-FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"Sworduigi","files":7,"time":1211416427,"description":"Extractor: EAC 0.99 prebeta 4 \nRead Mode: Secure with NO C2, accurate stream, disable cache.\nCodec: Flac 1.2.1;  Level 8  \nSource: Original CD\nArtwork: Front, Back and CD (Web Found).\n\n\nGeneral Info:\n\nTracklist:\n\n   1. &quot;Low&quot; ? 3:33\n   2. &quot;Legions (In Hiding)&quot; ? 4:17\n   3. &quot;Hail Mary&quot; ? 3:32\n   4. &quot;Trail of Tears&quot; ? 6:06\n   5. &quot;Shades of War&quot; ? 4:44\n   6. &quot;P.C.&quot; ? 2:50\n   7. &quot;Dog Faced Gods&quot; ? 4:02\n   8. &quot;All I Could Bleed&quot; ? 3:37\n   9. &quot;Urotsukidoji (Instrumental)&quot; ? 3:40\n  10. &quot;Chasing Fear&quot; ? 4:56\n  11. &quot;Ride&quot; ? 3:16\n  12. &quot;Last Call&quot; ? 2:41\n\n\n\n              LINE UP:\n\n    * Chuck Billy: Vocals\n    * Eric Peterson: Rhythm/Lead Guitar\n    * James Murphy: Lead/Rhythm Guitar\n    * Greg Christian: Bass\n    * John Tempesta: Drums\n\n\nReview taken from musicianforums.com:\n\nALBUM INFORMATION\nWell what do we have here, many of you might have heard songs from some of their finest albums like &amp;#039;&amp;#039;New World Order&amp;#039;&amp;#039; or &amp;#039;&amp;#039;The Legacy&amp;#039;&amp;#039; and thought that those albums were heavy. Just wait when you hear this, this album is called &amp;#039;&amp;#039;Low&amp;#039;&amp;#039;, an album that would sound more like a death-metal album (almost). The band has made a great mix of past versus future, they have taken their &amp;#039;&amp;#039;original&amp;#039;&amp;#039; sound and mixed it with more heavier and rawer material and the result became more heavier than their older music recipe. This album is very heavy in its sound, dark vocal work and deep growling is included alongside heavier and somewhat slower song patterns.\nBAND MEMBERS\nAfter their successful thrash launch during the 80&amp;#039;s the classic line-up started to fall apart, but there has been at least two original members in the band all the time. The first member is of course the might Chuck Billy and his vocals, he does a great work on this album. He uses both his normal and powerful vocals and his new vocal style which is deeper and more evil, Chuck delivers now dense and deep growls here. Take songs like Dog Faced Dogs and Legions (In Hiding), here you can find some great vocal work were the vocals are deep and powerful. Eric Peterson is the second member who has been alongside Chuck since the beginning, Eric does the rhythm sections in this album. The guitar work is heavy, thick and still skillfully performed, there are both solid shredding in many of the songs. Though the guitar might seem a little bit less complicated if you compare them to their earlier albums but this is great stuff. James Murphy is the new lead guitarist in this album, not as skilled as Alex Skolnick but he delivers some newer sounds and guitar work and it sounds good. The solos are not as advanced and melodic as Skolnick&amp;#039;s but they sound good though, nothing lame or too complicated stuff. John Tempesta is also a new member here, a very good drummer who knows how to handle the drumsticks. Tempesta&amp;#039;s drumming has a very good variety, from slow and light ballad-drumming to furies thrash drumming. The drum patterns are very catchy and heavy at the same time, very good drummer here I must say.\nMY THOUGHTS ABOUT THIS ALBUM\nThis was definitely a good piece of entertainment, one thing I really liked was the vocal performance in this material. Chuck has a very good singing voice. He sings very calm and gently in songs like Trail Of Tears, his more neutral or normal vocals appear in songs like Hail Mary and Shades of War, and his growling appears in songs like Dog Faced Dogs. The band has done a great job when it came to the variety in the material, there are these fast and shredding songs, slow and very heavy pounding songs and at last the calm and melodic ballad. There was also an instrumental songs here that focused more on the bass, that song is called Urotsukidoji, a quite ok song but you can hear that the bass has similarities with Cliff Burton&amp;#039;s or Jason Newsted&amp;#039;s type of solo style. Some things I didn&amp;#039;t like was the last song called Last Call, also an instrumental song but this one was just repeating itslef. The structre was all the same until it ended, boring &amp;#039;&amp;#039;outro&amp;#039;&amp;#039; song. There was not so many things that I disliked about this album, the only thing I missed was the technical and melodic riffage and soloing, if there was a little bit more fire and energy in this album it would&amp;#039;ve beena nearly perfect album in my opinion.\nCONCLUSION\nThis was a nearly great album to me, it had almost all perks that I like from Testament, the only things I missed in this album was the real energy and fire that the band had in their earlier albums. The vocals were great, the overall sound was heavier than the previous albums and I enjoyed more than half of the songs. If you are a Testament fan you should check this one out, this album might not be a good start for those who are interested to get into this band. Most because of the heavy and aggressive sound and because of the death-metal vocals, but you are welcome to check it out anyway though. So now we are done for this time, I hope that you had a good time reading and you are most welcome to send me your comments.","torrent":{"xt":"urn:btih:3d6e4bb98dfdaa51c15fbdcb9eab6bef51dcfcef","amp;dn":"Testament+-+Low+%281994%29+%5BEAC-FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3d6e4bb98dfdaa51c15fbdcb9eab6bef51dcfcef","infoHashBuffer":{"type":"Buffer","data":[61,110,75,185,141,253,170,81,193,95,189,203,158,171,107,239,81,220,252,239]},"announce":[],"urlList":[]}}