{"title":"George C. Chesbro - Bone","uid":6321387,"size":1100154,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3e709805493457196a2171422ef36da866bf5537&amp;dn=George+C.+Chesbro+-+Bone&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"Eddiehjjjfcfjfc","files":-1,"time":1302949214,"description":"Epub and Mobi.\n\nChesbro's thriller focuses on New York's homeless people, specifically on Bone, an amnesiac named for the one thing he clings to, a long bone. A newcomer among the dispossessed, Bone is suspected of beheading several other vagrants as well as a psychiatrist who offered him help. But Anne Winchell, a social worker, and a giant storyteller of the streets named Zulu believe in Bone. These friends win the accuser, Detective Prettyman, to Bone's side, and he descends far underground with the three friends to battle a raving maniac. It's a scene of sheer horror, but perhaps less harrowing than civilization's slide into the ultimate barbarism that is the novel's implicit warning.\n\nBorn in Washington, D.C. on June 4, 1940, he was the son of the late George W. and Maxine (Sharpe) Chesbro. An author of over 25 novels and nearly 100 short stories, George was a recipient of an Ellery Queen Award and had served as president of the Mystery Writers Association of America. Earlier in his career, George had worked as a special education teacher at Pearl River and at the Rockland Psychiatric Center where he worked with emotionally troubled teens.","torrent":{"xt":"urn:btih:3e709805493457196a2171422ef36da866bf5537","amp;dn":"George+C.+Chesbro+-+Bone","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3e709805493457196a2171422ef36da866bf5537","infoHashBuffer":{"type":"Buffer","data":[62,112,152,5,73,52,87,25,106,33,113,66,46,243,109,168,102,191,85,55]},"announce":[],"urlList":[]}}