{"title":"Handbook of Radiosurgery in CNS Disease [PDF] [StormRG]","uid":11261674,"size":9305965,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3f89c6acc4e227e14cd4ab3b6916ae5a6d0445cb&amp;dn=Handbook+of+Radiosurgery+in+CNS+Disease+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"0xmovva","files":2,"time":1413976946,"description":"TITLE/EDITION Handbook of Radiosurgery in CNS Disease \nAuthor: Michael Lim MD (Author), Wesley Hsu MD (Author), Daniele Rigamonti MD (Author), Lawrence Kleinberg MD (Author)\nPaperback: 264 pages\nPublisher: Demos Medical; 1 edition (May 22, 2013)\nLanguage: English\nISBN-10: 1936287447\nISBN-13: 978-1936287444\nFormat: Retail PDF\nNOTE: this is the standalone ebook and may not include access codes that come packaged with the bound book\n\n___________________________________________________________________________________\n\nHandbook of Radiosurgery in CNS Disease is a concise and practical manual offering radiation oncology, neurology, and neurosurgery residents, trainees, fellows, and clinicians up-to-date information on the role of radiosurgery within the overall context of CNS disease management.\n\nThe emphasis is on decision making and the evaluation of radiosurgery as a viable option among the suite of potentially applicable treatments, including frame-based systems, non-invasive body immobilization, and image-guided targeting. The book examines radiosurgery as a treatment modality for various CNS pathologies, discussing relevant radiobiology, current technology, and the technical aspects of specific procedures. Chapters organized by pathology provide practical coverage of clinical evaluations, patient selection and management decision-making, and relevant points in radiosurgical applications for the entity under discussion. Pertinent cases are presented to demonstrate the process for each treatment paradigm.\n\nA unique collaboration of editors with an international reputation for excellence in radiation oncology, vascular neurosurgery, and neurosurgical oncology will offer insights into the role of radiosurgery in the entire central nervous system (i.e. both brain and spine).\n\nHandbook of Radiosurgery in CNS Disease features:\n\nPractical focus on key clinical issues in radiosurgery of CNS disease: patient selection, radiosurgery in context with other modalities, pitfalls\nCoverage of cranial and extracranial disease\nRelevant cases illustrate discussion of each treatment paradigm\nOutstanding editorial team\nConcise format makes for an easy review or quick reference, in contrast to large texts","torrent":{"xt":"urn:btih:3f89c6acc4e227e14cd4ab3b6916ae5a6d0445cb","amp;dn":"Handbook+of+Radiosurgery+in+CNS+Disease+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f89c6acc4e227e14cd4ab3b6916ae5a6d0445cb","infoHashBuffer":{"type":"Buffer","data":[63,137,198,172,196,226,39,225,76,212,171,59,105,22,174,90,109,4,69,203]},"announce":[],"urlList":[]}}