{"title":"Spherex - MiiiX (2014 Summer Mixtape)","uid":10724585,"size":1502114965,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:400cfa69dc3caf77ed261724bdc986fc82e8016d&amp;dn=Spherex+-+MiiiX+%282014+Summer+Mixtape%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"SPHRX","files":28,"time":1407540760,"description":"Spherex - MiiiX (2014 Summer Mixtape) [Various Artists]\n\nAll tracks 320Kbps MP3\n\n26 Individual Mashups\n1 Continuous Mix\n1 Promo Video\n\nExplore an alternate way of hearing popular music currently on most radio! The mad scientist of mashups is back with this Summer DJ mixtape, perfect for when you want a bit more push and complexity to familiar tunes. For this mix, all songs were put up against neurofunk, glitch hop, dubstep and trap beats. All individual mashup tracks are included, so you can even add these to your own mixes! The continuous mix is included, but does not contain all the tracks for this release.. Enjoy!!!\nALL CONTENT USED belongs to its creators listed, I merely matched key and tempo to these songs and edited them together for DJ use..\n\nWEB: http://spherex.midwestmassive.com/spherex-miiix-summer-2014-dj-mashup-mixtape/\n\n\nFULL TRACKLISTING:\n01 Drake,Two Fingers - Started Here (Spherex Mashup)\n02 Three Loco, Evoke - NeatOlectrique (Spherex Mashup)\n03 Lorde, Two Fingers - Royals Rhythm (Spherex Mashup)\n04 Brooke Candy, GXVM - Time To Get Dark-Everybody Does (Spherex Mashup)\n05 Pharrell, Oskilator, Frequent &amp; Evoke  - Happy (Spherex Mashup)\n06 Janelle Monae, Frequent - Tightrope-Sanctions (Spherex Mashup)\n07 YG, Lil Wayne, Nicki Minaj, Atlas - My Nigga (Spherex Mashup)\n08 Macklemore, Fiord - Smells Like R Kelly's Piss (Spherex Mashup)\n09 Die Antwoord, Kranx - Fatty Boom Boom-Fuckface (Spherex Mashup)\n10 Lorde, Ordure, Antinum - Team-Silver-Xray (Spherex Mashup)\n11 Drake, GRUFF - We're Going Home-Tinamug (Spherex Mashup)\n12 Lady Gaga, Christina Aguilera, Skope - Lady Gaguilera (Spherex Mashup)\n13 Chris Brown, Nicki Minaj, KOAN Sound - Love More-Talk Box (Spherex Mashup)\n14 Jason Derulo, Joe Ford - Talk Dirty Bass To Me (Spherex Mashup)\n15 DJ Snake, Lil Jon, Divided By Zero, Jayglo - Turndown Ferwhot (Spherex Mashup)\n16 Trinidad James, Kursa, KUI - Pop Tamale Im Sweatin (Spherex Mashup)\n17 Yelawolf, GXVM - Animal-The Kinda Bass (Spherex Mashup)\n18 Katy Perry, Juicy J, Vaetxh, Mr Bill - Dark Horse-Mass (Spherex Mashup)\n19 Ace Hood, R Kelly, Yelawolf, Lysdexic - Bugatti-Cookie-Lambo (Spherex Mashup)\n20 Die Antwoord, Kanye West, Justin Timberlake - Freeky-Mercy-TKO (Spherex Mashup)\n21 Juicy J, Dysphemic - Dabz A Make Her Dance (Spherex Mashup)\n22 Huey, T Pain, Bow Wow, LAXX - Pop Lock N Drop It (Spherex Mashup)\n23 Schoolboy Q, Mr Bill - Refraction Greens (Spherex Mashup)\n24 Robin Thicke, Two Fingers - Blurred Lines-Rock Scissors (Spherex Mashup)\n25 Lady Gaga, BREDE - Crushing Applause (Spherex Mashup)\n26 Daft Punk, Stephan Jacobs &amp; Freddy Todd - Get Lucky-Slopapotamus (Spherex Mashup)","torrent":{"xt":"urn:btih:400cfa69dc3caf77ed261724bdc986fc82e8016d","amp;dn":"Spherex+-+MiiiX+%282014+Summer+Mixtape%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"400cfa69dc3caf77ed261724bdc986fc82e8016d","infoHashBuffer":{"type":"Buffer","data":[64,12,250,105,220,60,175,119,237,38,23,36,189,201,134,252,130,232,1,109]},"announce":[],"urlList":[]}}