{"title":"Screamfree Parenting","uid":4822247,"size":37395640,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:40969cadcd9bee6af3880e762045d451cae447ed&amp;dn=Screamfree+Parenting&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":6,"time":1238806455,"description":" &lt;a href=&quot;http://www.screamfree.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.screamfree.com/&lt;/a&gt;\n\nParenting is not about kids, it's about parents. If you're not in control,\nthen you cannot be in charge....\n\n&quot;ScreamFree Parenting,&quot; by Hal Runkel, is an excellent parenting guide\nthat will help moms and dads everywhere to keep (or regain) their sanity.\nRunkel is a licensed family and marriage therapist and one of the founders\nof ScreamFree Living, Inc. The book's thesis is that parents cannot keep\ntabs on their kids 24/7, nor can they force their children to consistently\nbehave in a certain way. Therefore, mothers and fathers would be better off\nlearning to focus on how they react to their children's words and actions. \n\nParents, Runkel contends, should take stock of themselves. Are they in\ncontrol of their behavior when they interact with their children? Or are\nthey at the mercy of their &quot;emotional reactivity&quot;--their unthinking,\nknee-jerk reactions? If the latter is true, it is likely that parent-child\ninteractions will be tense, angry, and unproductive. \n\nAll of us who have struggled with parental responsibilities instinctively\nrealize that a calm and reasoned approach is far more effective than a\nhysterical and dictatorial one. However, because of fatigue, ignorance, or\ninertia, many of us instinctively lash out, saying things that we don't\nreally mean when our kids push our buttons. What to do? \n\nRunkel does not advocate a permissive parenting style. Rather, the author\nrecommends what he calls &quot;judo parenting.&quot; Judo is &quot;the art of going with\nanother's momentum.&quot; A ScreamFree parent facilitates rather than dictates;\nhe encourages his children to use their own resources to solve problems.\nBy helping kids to get in the habit of making their own decisions and\nliving with the consequences, parents will be more likely to launch\n&quot;self-directed&quot; adults. \n\nRunkel's writing style is clear, concise, humorous, and to-the-point. The\nbook is conveniently divided into easy-to-read sections and the chapters\nall conclude with thought-provoking &quot;reflection questions.&quot; The author\nprovides many practical examples to demonstrate how his principles work\nin the real world. Runkel's amusing quotations from a wide variety of\nsources add liveliness to his message. In additon, there are lengthier\nanecdotes that are taken from Runkel's experiences as a family therapist.\nMost parents will pick up many useful tips from &quot;ScreamFree Parenting.&quot;\nIt is an entertaining, intelligent, and practical approach to raising our\nkids without losing our minds.\n","torrent":{"xt":"urn:btih:40969cadcd9bee6af3880e762045d451cae447ed","amp;dn":"Screamfree+Parenting","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"40969cadcd9bee6af3880e762045d451cae447ed","infoHashBuffer":{"type":"Buffer","data":[64,150,156,173,205,155,238,106,243,136,14,118,32,69,212,81,202,228,71,237]},"announce":[],"urlList":[]}}