{"title":"Tommy Boy (DVD)-1995","uid":4554474,"size":826333566,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:40b6c294c3eb27c0ced39fbce059bf3213440573&amp;dn=Tommy+Boy+%28DVD%29-1995&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Shadymedia","files":1,"time":1228427306,"description":"Tommy Callahan Jr. is a slow-witted, clumsy guy who recently graduated college after attending for seven years. His father, Big Tom Callahan, owns an auto parts factory in Ohio. When Tommy arrives back home, he finds he has a position at the factory waiting for him. His dad also introduces Tommy to the new brake pad division of the factory and to Tommy&amp;#039;s soon-to-be stepmother, Beverly, and her son Paul. But when Big Tom dies, the factory threatens to go under unless the new brake pads are to be sold. Therefore, Tommy must go on the road to sell them, along with the assistance of Richard, Big Tom&amp;#039;s right-hand man. Will Tommy save the company, or will the factory, and the town, go under?  Written by David Landers \n\nWhen Big Tom Callahan dies, his auto parts factory passes to his family, many of whom want to sell it to a corporation which plans to close it down. Now its up to Tommy Callahan Jr. to generate enough brake pad sales to save the factory and its employees from losing their jobs. Written by Steve Derby \nThomas Callahan Jr. is kind of a dumb guy. His father gets married to woman who is actually trying to get him for his money by taking over his stocks and then put his brake pad company out of business. When Big Tom dies of a sudden stroke, it seems pretty good for Beverly and tommy&amp;#039;s &quot;brother&quot;. but Tommy and his buddy Richard are going to set out and keep Calahan auto parts in business. I have said too much.","torrent":{"xt":"urn:btih:40b6c294c3eb27c0ced39fbce059bf3213440573","amp;dn":"Tommy+Boy+%28DVD%29-1995","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"40b6c294c3eb27c0ced39fbce059bf3213440573","infoHashBuffer":{"type":"Buffer","data":[64,182,194,148,195,235,39,192,206,211,159,188,224,89,191,50,19,68,5,115]},"announce":[],"urlList":[]}}