{"title":"Shoulder and Elbow Trauma and its Complications Vol. 1 - The Sho","uid":15187431,"size":50748959,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:40d0abd5bbb623bc3576cdf1369ada444175898b&amp;dn=Shoulder+and+Elbow+Trauma+and+its+Complications+Vol.+1+-+The+Sho&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1467501937,"description":"Shoulder and Elbow Trauma and its Complications Vol. 1 - The Shoulder - R. M. Greiwe (WP, 2015).pdf\r\n\r\nISBN 978-1-78242-449-9\r\n\r\nTraumatic injuries to the shoulder remain a problem encountered by young and old alike. Trauma surgeons and shoulder and elbow specialists are called upon daily to improve the quality of life of injured individuals by restoring function, decreasing pain and returning individuals to their previous occupations and places in society. Such treatment provides both humanitarian and economic impact. Only recently have techniques and technology allowed surgeons to restore lives to such a degree following these injuries. Still, shoulder and elbow trauma remains a vexing problem for patients and surgeons alike. Many injuries result in lost work and serious debility including lack of function, post-traumatic arthritis and pain. This important textbook provides a systematic and comprehensive guide to the different types of shoulder trauma and the management of its associated complications.\r\n\r\nIn Part One, the focus is on the most common types of shoulder trauma, with chapters covering anterior instability, traumatic rotator cuff tears, fractures, joint injuries and the floating shoulder and includes sections on the most common complications befalling each injury. Part II then reviews the management of the most common complications. Chapters include detailed analyses of persistent anterior shoulder instability, several forms of nonunion and malunion, failed acromioclavicular joint reconstruction, post-traumatic arthropathy and traumatic osteonecrosis, and failed arthroplasty for fracture.\r\n\r\n\r\nReviews common types of shoulder trauma\r\nAddresses the common complications associated with each injury\r\nProvides a detailed guide to the management of common complications","torrent":{"xt":"urn:btih:40d0abd5bbb623bc3576cdf1369ada444175898b","amp;dn":"Shoulder+and+Elbow+Trauma+and+its+Complications+Vol.+1+-+The+Sho","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"40d0abd5bbb623bc3576cdf1369ada444175898b","infoHashBuffer":{"type":"Buffer","data":[64,208,171,213,187,182,35,188,53,118,205,241,54,154,218,68,65,117,137,139]},"announce":[],"urlList":[]}}