{"title":"Loveless [ADULT]","uid":5248237,"size":258999304,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:4106890aa69129e47d985908404aedf70ba4994e&amp;dn=Loveless+%5BADULT%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"brodahisou","files":-1,"time":1262236828,"description":"Loveless was an American Western comic book series for mature readers published by DC Comics as a part of that company's Vertigo imprint.  It was written by Brian Azzarello and drawn by Marcelo Frusin, Danijel Zezelj and Werther Dell'Edera.\n\nLoveless was originally about a man, Wes Cutter, who fought for the South in the Civil War and was captured.  After spending time in a prison camp he comes back to his previous home of Blackwater after the North won to find the town under Union control and his house occupied.\n\nThe comic's early issues explore the dynamic relationship between Cutter and the people of the town (most of whom hate him), the fate of Cutter's wife Ruth, and the lingering feelings of animosity between North and South after the end of the war. \n\nSince the conclusion to its earlier issues, Loveless become a comic of greater chronological and thematic narrative. The stories within Loveless, since its inception and especially in its later years center around racism and the grittier realities of American history.  The book had been stated to last about four years and Azzarello hinted to end the story in the 1940s or so, but the series was cancelled with issue 24 and has since ended its run.\n\nThe title was penciled and inked by three artists on a rotating schedule: Marcelo Frusin (#1-5, 9-10, covers), Danijel Zezelj (#6-8, 13-15, 22-24), Werther Dell'Edera (#11-12, 16-21).  Frusin previously worked with writer Brian Azzarello for three years on Hellblazer.  Zezelj also had a previous project with Azzarello: El Diablo, a western mini series, that in Azzarello's words &quot;planted the seeds for Loveless&quot;.  All three artists have clearly distinct, recognizable styles, colorist Patricia Mulviill ensured a graphic continuity throughout the series.\n\nDue to scenes of graphic violence and nudity this torrent comes with a ADULT rating.\n\n\nReleased on http://ComicPirates.info","torrent":{"xt":"urn:btih:4106890aa69129e47d985908404aedf70ba4994e","amp;dn":"Loveless+%5BADULT%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4106890aa69129e47d985908404aedf70ba4994e","infoHashBuffer":{"type":"Buffer","data":[65,6,137,10,166,145,41,228,125,152,89,8,64,74,237,247,11,164,153,78]},"announce":[],"urlList":[]}}