{"title":"The Sting (2GB 720p HD DivX from bluray)  moviesbyrizzo","uid":5962733,"size":2108164770,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:411b7f7ad141719c2516f5f84c3c49f6a27fbde6&amp;dn=The+Sting+%282GB+720p+HD+DivX+from+bluray%29++moviesbyrizzo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"moviesbyrizzo","files":-1,"time":1290009819,"description":"1280 x 696 video 256k audio from surround sound track\n\nI want to start by thanking the great Irish spirits at thepiratebay for being\nsuch great Christians in all the time we've known them and they have been\nour hosts for our torrent postings. Danke! They are in fact th nicest folks\nwe have found in this business - and I mean that in all sincerety!\n\nThis is our 2GB HD 720p version of &quot;The Sting&quot; 1973 starring the great \nMr. Robert Redford and the truly great (late) Mr Paul Newman as well.\n\nWe made this conversion from a 10GB MKV file so that it is suitable for most\nfolks that want an HD 720p file that is not too bulky to make use of -\non a cheap 20cent disc (so it would have to be under 4GB) and in a lightweight\nenough filesize so that it is practical to play on a computer that is hoked\nup to a larger screen TV perhaps. My sister who doesnt own an HD disc player\ndespite being &quot;middle class fortunate&quot; actually has her computer hooked\nup to her TV set and does her viewing of these sorts of movie files in this\nway instead. We found the 2GB mkv version already on the net (although it does\nhave embedded subtitles n several languages) does not play in practical speed on\ncompter configurations we tested it on, while our DivX avi plays normally instead\n(using the free vlc player - for instance). The DivX plus player that is free to\ndownload  has great dual monior support s that you can view on your PC as well as\nlarge screen simultanously (nice feature for karaoke use too)- however with some\nmovie files it too is too bulky to play without increasing computer speed at the\nhardware retailer.\n\nWe aim for practical application of all our avi movie files so that they are\nable to play on your computer - which can hook up to your TV, or used on a disc\nplayer without having to pay for expensive blanc discs to do your burn\nwith. Nero has a free player disc burner software download which is great\nand very competently designed in its appeal. Always burn at the minimum disc\nspeed setting that you can specify Nero to use, and then use &quot;windows task \nmanager&quot; on your PC to specify &quot;high processing priority&quot; for Nerosmart (during\nthe disc creation process). Make sure no other programs are running at the time,\nand always use &quot;disc verify&quot; feature in turned ON position in the Nero settings\ncontrol.\n\nWe have a 4GB DivX HD The Sound of Music from 1080p coming to you too, by the way.\nIt will be perfect or it wont launch.\n\nThe Sting is one of the very best movies ever made for its accomplishment\nin showing American prowess in producing culture of wide appeal.\n\nIt is a great movie in its scripting and in the clever story thats involved.\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0070735/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0070735/&lt;/a&gt;\n\nIts about ragtime era conmen and Irish mobster figures in a grand scheme\nto outdo each other at every turn while trying to keep to some level of\n&quot;integrity&quot; as it were, yet in fact showing no real mercy at the &quot;willingness\nto take all&quot; from the targets of their plot.\n\nFor me personally what makes this movie important is the glimpse it gives\nus of the affirmative action sentiments that first began to appear in such\nHollywood scripts as this important hit.\n\nSpecifically we are given the notion of a &quot;rebel wothout a real cause&quot;\nin Robert Redford's character as played in the movie.\n\nHe isnt out to &quot;take&quot; from the Irishman played by the talented Mr. Robert\nShaw (who is mob leader) just for his dough. Instead, he seeks to &quot;get even&quot;\nfor the hit on Redford's former partner (a drfiter from the ghettos). Yet the\nhit would  have seemed reasonable enough as his former partner had indeed\n&quot;stolen from the mob and kept the dough&quot;. So is his plot in fact reasonable\nenough a proposition so as to set cultural and moral standards even?\n\nI think not. I think someone is out to sell affirmative action in that\n&quot;anything goes&quot; as long it isnt an Irishman who wins. (Otherwise we are all\nsupposed to set our sights on him (without any other gainful intent)than to\nsomehow make things &quot;equal&quot; in a situation where no such claim can be made\nrationally of what are the real circumstances at play.\n\nThat said, this is one movie I wouldnt do without in my home library and\nits a great movie for the entire family in fact!\n\n\nMichael Rizzo Chessman\n\nThere are surely subtitles on the net for bluray versions of this movie, \nits 2hrs09:19 in lenght. If you have them please make them available.\nWe do have an mkv file here with Swedish and other subtitles embedded\nand we dont rule out making an SRT file for each subtitle track on that\nfile for you if need be. Thank you greatly for being such great folks \nin Sweden! Merci and grazie equally too!\n\n(Main) Soundtrack selections included in separate mp3 folder\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n","torrent":{"xt":"urn:btih:411b7f7ad141719c2516f5f84c3c49f6a27fbde6","amp;dn":"The+Sting+%282GB+720p+HD+DivX+from+bluray%29++moviesbyrizzo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"411b7f7ad141719c2516f5f84c3c49f6a27fbde6","infoHashBuffer":{"type":"Buffer","data":[65,27,127,122,209,65,113,156,37,22,245,248,76,60,73,246,162,127,189,230]},"announce":[],"urlList":[]}}