{"title":"Victoria Braithwaite - Do Fish Feel Pain? TTS","uid":7680751,"size":71682672,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:42624364751cd2f89b74efc3dbbc6858ba16d980&amp;dn=Victoria+Braithwaite+-+Do+Fish+Feel+Pain%3F+TTS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Partidge","files":1,"time":1348814401,"description":"Each year millions of fish are caught on barbed hooks or left to die by suffocation on the decks of fishing boats. But while there has been increasing interest in recent years in the welfare of mammals, fish are thought to be too different--too dim-witted, too cold-blooded, too simple--to merit our concern.\n\nHere, biologist Victoria Braithwaite explores the question of fish pain and fish suffering, explaining what science can now tell us about fish behavior, and examining the related ethical questions about how we should treat these animals. Fish have in the past been portrayed as slow, cold automata with a very simple brain that generates stereotyped behavior. But Braithwaite presents new scientific evidence that seriously challenges this view. Indeed, there is a growing body of science demonstrating that fish are far smarter and more cognitively competent than we have previously suspected. Several fish species are surprisingly intelligent and research has shown that they can have both accurate and long lasting memories, which in some cases, such as migrating salmon, can span years. Moreover, the author demonstrates that fish have more in common with other vertebrates than we think. Their overall physiology, for instance, shares many similarities with other vertebrates--even ourselves. The way that they respond to stressful situations, the so-called &quot;stress response,&quot; is strikingly similar. After experiencing a stressful event, our bodies release cortisol into the blood, and the same is true in fish. \n\nVictoria Braithwaite is one of the key scientists working on fish pain and she is also actively involved with both the fishing industry and the angling world, helping them sort through the implications of these findings. Though far from anti-fishing, she concludes that scientific evidence suggests that we should widen to fish the protection currently given to birds and animals.\n\nThis upload was made using neospeech bridget and there will be a few mistakes, but overall, I think you will agree that the quality is excellent.","torrent":{"xt":"urn:btih:42624364751cd2f89b74efc3dbbc6858ba16d980","amp;dn":"Victoria+Braithwaite+-+Do+Fish+Feel+Pain%3F+TTS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"42624364751cd2f89b74efc3dbbc6858ba16d980","infoHashBuffer":{"type":"Buffer","data":[66,98,67,100,117,28,210,248,155,116,239,195,219,188,104,88,186,22,217,128]},"announce":[],"urlList":[]}}