{"title":"David Morrell - Creepers - Unb","uid":4807405,"size":247558849,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:429e36db65bf3ddb25922d0859c68539c949a2b1&amp;dn=David+Morrell+-+Creepers+-+Unb&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"RamJamSam","files":8,"time":1238248062,"description":"David Morrell - Creepers - Unb\nRead by: Patrick Lawler\nRuntime: 8 Hours and 35 Minutes\n\n\n\n\nDavid approached me about doing the narration for Creepers in 2004 and I \ntold him that I would be glad to, however when the time came to do the book\nI was just recovering from a nodule being removed from my throat, \nso Patrick Lawler did the narration. After reading the book and hearing \nPatrick do his normal excellent job I decided that the next time i see him Im gonna\npunch him in the nose, I hate missing out on a good book and this is one \nof them. (Harlan Ellison)\n\n\nOn a chilly October night, five people gather in a run-down motel on the Jersey shore and begin preparations to break into an abandoned hotel nearby. Built during the glory days of Asbury Park by a reclusive millionaire, the magnificent structure, which foreshadowed the beauties of Art Deco architecture, is now a decrepit, boarded up edifice marked for demolition.\n\nThe five are &quot;creepers&quot;, the slang term for urban explorers - city archaeologists of sorts who go into abandoned buildings to uncover their secrets. And, on this evening they are joined by a reporter who wants to profile them - anonymously, as this is highly illegal activity - for a New York Times piece.\n\nBalenger, the sandy-haired, broad-shouldered reporter with a decided air of mystery about him, isn't looking for just a story, however. And, soon after the group sets forth into the rat-infested tunnel leading to the building, it is clear that he will get even more than he bargained for. Danger, terror and death are awaiting the creepers in a place ravaged by time and redolent of evil.\n\n\n\n\nGooD SeeDinG!\n","torrent":{"xt":"urn:btih:429e36db65bf3ddb25922d0859c68539c949a2b1","amp;dn":"David+Morrell+-+Creepers+-+Unb","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"429e36db65bf3ddb25922d0859c68539c949a2b1","infoHashBuffer":{"type":"Buffer","data":[66,158,54,219,101,191,61,219,37,146,45,8,89,198,133,57,201,73,162,177]},"announce":[],"urlList":[]}}