{"title":"I segreti di Roma [DVD5 - Ita - Sub Ita] Pack 3/4 [Tntvillage.Sc","uid":4895471,"size":3444619048,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:4392b9f59f5e976e5e07d8fd1d95556e993d560e&amp;dn=I+segreti+di+Roma+%5BDVD5+-+Ita+-+Sub+Ita%5D+Pack+3%2F4+%5BTntvillage.Sc&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"pammy_71","files":15,"time":1242259950,"description":"I segreti di Roma [DVD5 - Ita - Sub Ita] Pack 3/4 [Tntvillage.Scambioetico]\n\nVisit this link: http://www.tntvillage.scambioetico.org/?act=allreleases&amp;st=0&amp;filter=I%20segreti%20di%20Roma&amp;sb=1&amp;sd=0&amp;cat=0\n\nVisit this link: http://www.tntvillage.scambioetico.org/?act=allreleases&amp;st=0&amp;filter=Pammy71&amp;sb=1&amp;sd=0&amp;cat=0\n\n\n\nVisit this info link: http://BannerBreak.com/ http://bannerbreak.com/banners/4/190/123843758751265885.gif\n &lt;a href=&quot;\nhttp://img147.Imageshack.us/img147/8482/locandinatntdvd03.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img147.Imageshack.us/img147/8482/locandinatntdvd03.jpg&lt;/a&gt;\n\nVisit this info link: http://BannerBreak.com/  Visit this link: http://bannerbreak.com/banners/5/698/123844165347705587.gif\n\nPer chi ha letto di Corrado Augias il suo precedente e omonimo volume, l'uscita dell'opera in video, I segreti di Roma, rimarrÃƒÂ  sicuramente una sorpresa non tanto per i misteri che l'autore ci svela, quanto per la bellezza del girato sopra, dentro e sotto la cittÃƒÂ . Il racconto visivo di Augias non tiene conto nÃƒÂ© della cronologia degli avvenimenti, nÃƒÂ© di una logica geografica. La storia della CittÃƒÂ  Eterna ÃƒÂ¨ restituita tramite le suggestioni e le sensazioni di chi l'ha vissuta prima con gli occhi di bambino, poi di uomo e, infine con quelli dello scrittore. Un punto di vista assolutamente personale e autobiografico.\n\nL'opera di Augias - prodotta da Studioimmagine e realizzata con il patrocinio del Ministero dei Beni Culturali e la partecipazione del Comune di Roma - ÃƒÂ¨ tutta girata in formato in alta definizione e divisa in quattro Dvd, ciascuno della durata di un'ora e arricchito con oltre 20 minuti di contenuti speciali. \n\nIl giornalista &quot;viaggiatore&quot; ci porta per mano in luoghi trasudanti fascino e mistero fra tesori mai visti, realizzando il suo sogno di raccontare Roma dal vivo, com'ÃƒÂ¨ adesso, ripresa dall'alto e vista dal basso. CosÃƒÂ¬ in basso da avventurarsi dentro i suoi sotterranei, dove ritroveranno luce i templi dedicati al dio Mitra, nei quali si sacrificava il toro, o la basilica dedicata al culto della setta dei Neopitagorici, passando per le tombe dei patrizi sulla via Appia, rimaste intonse per oltre duemila anni. Fino ad arrivare ai colombari, enormi cimiteri che contenevano migliaia di sepolture e alle catacombe ebraiche di antichissime origini.\n\nMa l'autore, nelle oltre quattro ore dell'opera, spazia anche in tempi recenti e, avvalendosi di preziosi inediti provenienti dall'immenso archivio dell'Istituto Luce, ridÃƒÂ  nuova vita a documentari e filmati risalenti a avvenimenti dello scorso secolo. Come gli sventramenti di via della Conciliazione o quelli per l'Altare della Patria; il bombardamento di San Lorenzo nel '43 o l'arrivo degli Alleati; le immagini di Gabriele D'Annunzio vecchio e sdentato o quelle di Mussolini nei giardini di Villa Torlonia, impegnato a giocare con la sua rumorosa famiglia. Ma ogni storia, ogni pietra raccontata, fanno scoprire o riscoprire Roma, unica cittÃƒÂ  sopravvissuta al passato e mai distrutta dalla violenza della Storia.\n\nE tra i tanti misteri svelati anche quelli di sotterranei di locali tipici come ristoranti e trattorie, ma che conservano incredibili testimonianze del passato remoto e prossimo. E ancora storie che hanno avuto per protagonisti grandi imperatori, da Giulio Cesare ucciso all'interno del Teatro di Pompeo, a Nerone che incendiÃƒÂ² parte della cittÃƒÂ  per edificare una casa dalle dimensioni esagerate. Sino ad arrivare alla grande Meridiana che si estendeva da Montecitorio a Piazza San Lorenzo in Lucina e che, dalla cima dell'obelisco il giorno del compleanno del primo imperatore Augusto, proiettava un raggio di luce al centro dell'Ara Pacis.\n\nScopriremo infine la Roma delle confraternite, spesso macabre come quella dei Sacconi Rossi, che ripescava gli annegati nel Tevere. Una cittÃƒÂ  che ha fatto degli scheletri un simbolo visibile, spesso sotto il piano stradale ma a volte anche in superficie.\n\n\nVisit this info link: http://BannerBreak.com/ http://bannerbreak.com/banners/6/953/123844005237757394.gif\n\n * 1. Un gerarca dietro la porta\n     * 2. Intrighi al foro\n     * 3. Qui giace Giulio Cesare\n     * 4. La Domus Aurea\n     * 5. Sotto il Palatino\n     * 6. Il Mitreo de Circo Massimo\n     * 7. La Casa delle Vestali\n     * 8. Castel Sant'Angelo\n     * 9. La porta Magica\n     * 10. Il segreto dell'Ospedale\n     * 11. Le trecento Candele\n     * 12. CinecittÃƒÂ  \n\n\n[quote=Augias: I segreti di Roma]Visit the YouTube link:\n\nVisit this info link: http://BannerBreak.com/ http://bannerbreak.com/banners/6/492/123843904269064618.gif\n\nGenere: Documentario\nDurata: 70 min. circa\nDVD Area: PAL Area 0\nAudio: italiano 2.0\nSottotitoli: italiano - sottotitoli per non udenti\nFormato Video: 16:9\nProduzione: Studioimmagine\nExtra: La cittÃƒÂ  dei delitti e delle pene\nContenuti Speciali: &quot;Petrella Salto: scena del crimine&quot; - &quot;Un teatro a due piazze&quot;\n\nVisit this info link: http://BannerBreak.com/ http://bannerbreak.com/banners/6/432/123843644572017664.gif\n &lt;a href=&quot;\nhttp://img90.Imageshack.us/img90/9750/corradoaugias.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img90.Imageshack.us/img90/9750/corradoaugias.jpg&lt;/a&gt;\nCorrado Augias\n\nGiornalista e scrittore, Corrado Augias ÃƒÂ¨ nato a Roma nel 1935.\nHa trascorso molti anni all'estero.Parigi prima, poi New York, da dove ÃƒÂ¨ stato corrispondente del settimanale &quot;L'Espresso&quot; \ne del quotidiano &quot;La Repubblica&quot;. Attualmente risiede a Roma.\nÃƒË† stato inviato speciale per &quot;L'Espresso&quot;, &quot;Panorama&quot; e &quot;La Repubblica&quot;, quotidiano al quale attualmente collabora. \nAll'inizio degli anni '60 ha partecipato al movimento dell'avanguardia teatrale romana con il &quot;Teatro del 101&quot; diretto da Antonio Calenda, \nper il quale ha scritto Direzione Memorie e Riflessi di conoscenza, protagonista Luigi Proietti.\nAl teatro ÃƒÂ¨ tornato in anni piÃƒÂ¹ recenti con L'Onesto Jago, messo in scena dal teatro stabile di Genova (regia di Marco Sciaccaluga, con Eros Pagni nel ruolo di Jago).Per la casa editrice Rizzoli ha pubblicato una trilogia narrativa nella quale, sotto specie di spy story affidate a un protagonista unico (un fratello immaginario del dannunziano Andrea Sperelli), si racconta la storia italiana in anni fondamentali anche per la nostra vita - quelli che vanno dal 1911 (impresa di Libia) al 1921 (vigilia del fascismo). I tre titoli sono:\nQuel treno da Vienna, Il fazzoletto azzurro, L'Ultima Primavera.\nDa questi romanzi sono stati liberamente tratti tre film televisivi andati in onda nell'autunno '89 su Raidue\n(regia di Duccio Tessari, con Marisa Berenson nel ruolo della protagonista femminile)\nNel corso della sua attivitÃƒÂ  televisiva ha ideato e condotto programmi di grande rilievo anche culturale, tra i quali la serie di Telefono giallo e il programma di libri Babele. Per la Mondadori ha scritto Giornali e spie, nel quale ricostruisce un'appassionante vicenda di spionaggio realmente avvenuta nel 1917, orchestrata dai servizi segreti del Kaiser al fine di far uscire prematuramente l'Italia dalla guerra. \nInsieme a Daniela Pasti (inviata speciale di &quot;Repubblica&quot; e sua moglie) ha scritto il romanzo Tre colonne in cronaca, nel quale - con un anno di anticipo sui fatti - si racconta la scalata di un energico finanziere alla Mondadori.\nLa sua attivitÃƒÂ  di giallista ÃƒÂ¨ proseguita con &quot;Telefono giallo&quot;. &quot;Sette delitti quasi perfetti&quot;,\n&quot;Una ragazza per la notte&quot; e &quot;Quella mattina di luglio&quot;.\nSuoi anche i saggi-racconto &quot;I segreti di Parigi e Il viaggiatore alato&quot;.\n\nVisit this info link: http://BannerBreak.com/  Visit this link: http://bannerbreak.com/banners/7/233/123844353387547001.gif\n\nIn seed con 10/20KB 24 ore su 24\n\n Visit this link: http://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=164191\n\n Visit this link: http://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=166192\n\nVisit http://www.tntvillage.scambioetico.org/","torrent":{"xt":"urn:btih:4392b9f59f5e976e5e07d8fd1d95556e993d560e","amp;dn":"I+segreti+di+Roma+%5BDVD5+-+Ita+-+Sub+Ita%5D+Pack+3%2F4+%5BTntvillage.Sc","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4392b9f59f5e976e5e07d8fd1d95556e993d560e","infoHashBuffer":{"type":"Buffer","data":[67,146,185,245,159,94,151,110,94,7,216,253,29,149,85,110,153,61,86,14]},"announce":[],"urlList":[]}}