{"title":"Dire Straits - Walk Of Life","uid":4865257,"size":140705796,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:4485bacfe5b169c00cc7f602354ab4516d6ad6f6&amp;dn=Dire+Straits+-+Walk+Of+Life&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1240475584,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Walk of Life&quot; is a 1985 song by the British rock band Dire Straits. It appeared on their best-selling album Brothers in Arms. It subsequently appeared on their live album On the Night. It was released as a single in 1986 but had first been available as the b-side of &quot;So Far Away&quot; released in advance of Brothers in Arms. The track peaked at number 7 in the US charts and was their biggest commercial hit in the UK, peaking at number 2.\n\nThe song was nearly excluded from the album when the co-producer Neil Dorfsman voted against its inclusion, but the rest of the band out-voted him.\n\nA simple rock 'n' roll rhythm is used, with chord changes limited to the famous I, IV and V chords. The long introduction has become iconic, with an instantly recognizable and tuneful hammond organ line. The lyrics reference oldies, including &quot;I Got a Woman&quot;, &quot;Be-Bop-A-Lula&quot;, &quot;What'd I Say&quot; and &quot;Mack the Knife&quot;.\n\nThe music video for the song shown in the U.S. features sports bloopers intercut with footage of the band performing the song on a stage, while the UK video features a street musician wearing the same shirt as Mark Knopfler intercut with the band performing on a stage.\n\n&quot;Walk of Life&quot; was the song played during the Space Shuttle Discovery crew wake-up call on STS-114 Flight Day 7.\n\nThe walk of life was also the name of the charity walk from London to Khartoum 1985-1986, to raise money for famine relief led by John Abbey. The band donated Brothers in Arms Gold disc in recognition and support of the expedition.\n\nThe introduction to the song was also used for a time as the theme music for Test Match Special cricket in the United Kingdom.\n\nWhen the song was originally released, the band explained that a &quot;walk of life&quot; in the context of this song is a traditional journey taken by a storyteller in the countryside, in which he went from town to town telling stories, in the days before radio, television, and recording.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:4485bacfe5b169c00cc7f602354ab4516d6ad6f6","amp;dn":"Dire+Straits+-+Walk+Of+Life","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4485bacfe5b169c00cc7f602354ab4516d6ad6f6","infoHashBuffer":{"type":"Buffer","data":[68,133,186,207,229,177,105,192,12,199,246,2,53,74,180,81,109,106,214,246]},"announce":[],"urlList":[]}}