{"title":"[swelog]Wildlife_Park_3-FLT","uid":6319856,"size":1226502033,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:45736a4fe59eae9c39ff95c9fb450fa131b72e57&amp;dn=%5Bswelog%5DWildlife_Park_3-FLT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"swelogz","files":27,"time":1302915514,"description":"  \n\nNSiJEDACiD\n\nIn Their 24th Year Of Glory, FairLight Released #1003\n\nWildlife Park 3 (c) Deep Silver\n\n:  Supplied by: FAIRLIGHT            : : Release Date: 15/04/2011\nCracked by:  FAIRLIGHT              Game Type: Simulation\nPackaged by: FAIRLIGHT              Image Format: ISO\n-----\nDISCS: 1 DVD                        Protection: ProtectDisc\n\nSystem Requirements : (S)-1-phenylpropan-2-amine\n\nGame information\n=================\n\nIn Wildlife Park 3 the player becomes a  modern  animal  park  manager.  In\nCampaign mode, 20 missions take him around the globe and set  him  a  range\nof exciting and varied challenges. The player's imagination  can  run  riot\nin the ever popular &quot;free game&quot; mode: the virtual wildlife park manager has\nover 40 plant species, a range of  visitor  facilities,  numerous  building\noptions for enclosures and many more elements available to design and build\nhis own park. Of course he must also consider the needs of the 25 different\nanimal species and must hire and train animal keepers  to  look  after  the\nanimals  and  their  offspring.  Randomly  generated  quests  also  provide\nvariety nor should the &quot;cute factor&quot; be ignored in Wildlife Park 3 either\n\nA number of innovations have made Wildlife Park 3 the most  successful  and\nthrilling part of the series to date, as the management part  of  the  game\nhas been substantially  upgraded  compared  to  its  predecessor,  and  the\nnumerous park facilities  and  enclosure  types  can  now  be  individually\ndesigned. The behavior and movements of the  various  animal  species  have\nbeen faithfully reproduced and of course the  popular  animal  lexicon  has\nbeen retained, which, besides the animal species,  also  contains  lots  of\nbackground information on plant  species.  A  new  weather  system  affects\nanimals, plants and visitors alike: animals run for shelter in a  downpour,\nplants wither if it is too dry, and visitors can quickly  buy  an  umbrella\nin the park shop if it starts raining. An improved clothing system provides\na vast selection of different dress styles for the NPCs, each of whom will\nhave different requirements that must be satisfied\n\nFeatures\n\nExciting campaigns, taking the player around the world in 20 missions\nPopular &quot;Free Play&quot; mode on over 20 selectable\nmaps with additional mini quests\nUsing terraforming tools, you can create landscapes\naccording to your imagination\nA detailed tutorial to explain the features\nof the game in a playful manner\nAnimal shop for trading animals in the game\nRealistic depiction of the 25 different\nland and water animal species\nIndividual animals and animal species, colorings and patterns,\ntails, manes, tusks, horns, etc. are created randomly\nEncyclopedia with lots of interesting information\nabout the animal and plant species\nExtensive possibilities for customization with countless\ndecorative park elements, fence and enclosure types,\nplants and extendable visitor facilities\n\nInstallation Information\n=========================\n\nBurn or mount\nInstall the game\nApply the update located in the Fairlight folder\nCopy the crack from the Fairlight folder\nPlay\t\n\n  ","torrent":{"xt":"urn:btih:45736a4fe59eae9c39ff95c9fb450fa131b72e57","amp;dn":"%5Bswelog%5DWildlife_Park_3-FLT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"45736a4fe59eae9c39ff95c9fb450fa131b72e57","infoHashBuffer":{"type":"Buffer","data":[69,115,106,79,229,158,174,156,57,255,149,201,251,69,15,161,49,183,46,87]},"announce":[],"urlList":[]}}