{"title":"299B_USB_camera_drivers.rar","uid":4570607,"size":14515305,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:4603730c639f872689b3419b0c0b5c55db1867a5&amp;dn=299B_USB_camera_drivers.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pirateaddress","files":1,"time":1229041975,"description":"Here are the essential drivers for running the &amp;#039;no driver&amp;#039; flexible-necked USB camera, purchased from certain eBay sellers. As it happens, mine came with a mini-CD with autoplay installation active. There is one folder missing here which was on the CD, the accessory or optional installer with support files for &amp;#039;VP-eye version 4.0,&amp;#039; and that&amp;#039;s for two reasons. One, there was one DLL which simply refused to copy out, either because the CD is defective or because of some form of copy protection. Tried Nero to burn a copy but no go, same with a direct Explore &gt; select &gt; copy attempt. It wouldn&amp;#039;t go into the archive in WinRAR. So I gave up. The other reason is that even if it had copied out from the CD, this is not part of the software for running the camera directly, enabling use with other softwares such as (my favourite) Debut, or eCap. And as it&amp;#039;s about 10 times bigger than the essential stuff, it seemed pointless to offer the upload, especially as I&amp;#039;m hosting this torrent from my Asus 901 netbook... not exactly an always-on server for larger torrents.\n\nSo good luck if you have one of these cameras. Included in the torrent are two additional image files; a shot taken using the 299B camera of the CD these drivers came from, and a shot of the 299B taken with another camera. These are merely for identification purposes, to compare whether the model you have is the same. There is a black line covering the &amp;#039;a&amp;#039; in &amp;#039;camera&amp;#039; on the lens surround label; that&amp;#039;s my &amp;#039;up&amp;#039; mark for reference, for orienting the camera quickly to an image right side up on screen.\n\nI have done a test install to XP Home running the setup.exe file from this folder without the CD attached to the PC, and there were no problems with the install. It asked to reboot after installing, and left a shortcut on the desktop with the basic AmCap icon - I&amp;#039;m guessing it&amp;#039;s either basic AmCap or a variant. \n\nThe installer whether from CD or this folder does not offer any location options for the install, kind of unfortunate, but I&amp;#039;ll take what I can get to make this silly camera work. It&amp;#039;s a great thing when the connection is stable - having some blinky issues probably owing to USB problems, but perhaps in the hardware itself. Same regardless of which of three softwares I use to run it. Sometimes stable, other times not, regardless of direct-to-USB connection or through a 10&amp;#039; extension USB line. Hope I can get it running 100% reliably, and any help offered here in comments would be most welcome on that front. It&amp;#039;s already proving a fantastic (and CHEAP - cost me only USD$17 including shipping!) diagnostic tool for poking around inside doublebasses and cellos, assessing repairs for estimates and trying to diagnose buzzing problems. Once I run a fiber optic or perhaps just LED light source alongside it&amp;#039;ll be just about perfect for this sort of work. Imagine it would be equally great for automotive work or a host of other tasks.","torrent":{"xt":"urn:btih:4603730c639f872689b3419b0c0b5c55db1867a5","amp;dn":"299B_USB_camera_drivers.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4603730c639f872689b3419b0c0b5c55db1867a5","infoHashBuffer":{"type":"Buffer","data":[70,3,115,12,99,159,135,38,137,179,65,155,12,11,92,85,219,24,103,165]},"announce":[],"urlList":[]}}