{"title":"Revolution.2012.S02E05.mp4","uid":9359088,"size":293039986,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:46a611b8649aa12dbe513b249ea220e84b5aff17&amp;dn=Revolution.2012.S02E05.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ziggi1000","files":1,"time":1387271496,"description":"&quot;One Riot, One Ranger&quot;  October 23, 2013 \n\nIn Willoughby, Texas, Miles and Rachel discuss Ken's death, and Aaron knocks on their door to confront Miles about the situation at the rail road. Aaron says he is pretty sure he caused the men to light on fire, and Rachel thinks it might be the nanotech. Both Monroe and Charlie and a contingent of Texas Rangers arrive in town shortly after. After pointing guns at each other, the Rangers and Patriots lower their weapons. However, the Patriots make effort to hide their activities from the Rangers. Miles contacts the lead Ranger, who he tried to kill when he was in the Monroe army, as he is their best shot at starting a war with the Patriots. The lead Ranger, Fry demands proof to take back otherwise Texas will sign a treaty with the Patriots. Charlie and Monroe make contact with Miles and aid him in the capture of a Patriot soldier, the same soldier that was working with Titus. As they prepare to question him at a hidden location, Aaron and Rachel arrive due to a vision Aaron had of the location. As they hide and the Ranger arrives, Miles discovers the soldier committed suicide with a cyanide tooth. Wondering what to do about evidence, Monroe kills Ranger Fry in order to frame the Patriots as a way to start the war. In the Savannah Refugee Camp, a wagon is being mobbed by desperate people who want to board the wagon. Neville speaks with Allenford, who tells him she is being called to D.C. and he is to accompany her as her security force. Along the way, they are ambushed by Patriots who try to assassinate Allenford. Neville and Allenford escape, although Allenford got a bullet wound. When they stop to rest, Allenford reveals that the wagon was actually taking people to reprogramming centers, the same one his son is now at. She also knew that the Patriots were sent to kill her, in order to silence her for objecting to them. After Neville begins to leave her to die from her wounds, she bargains to take him there if he helps her.\n \n","torrent":{"xt":"urn:btih:46a611b8649aa12dbe513b249ea220e84b5aff17","amp;dn":"Revolution.2012.S02E05.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"46a611b8649aa12dbe513b249ea220e84b5aff17","infoHashBuffer":{"type":"Buffer","data":[70,166,17,184,100,154,161,45,190,81,59,36,158,162,32,232,75,90,255,23]},"announce":[],"urlList":[]}}