{"title":"Bellydance - The Next Level: Transitions, Turns &amp; Layers wit","uid":8346856,"size":873105408,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:47759f41683af53d72c813e017092604857601cf&amp;dn=Bellydance+-+The+Next+Level%3A+Transitions%2C+Turns+%26amp%3B+Layers+wit&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sara_melika","files":1,"time":1365231192,"description":"Bellydance - The Next Level is Jenna's latest DVD for World Dance New York. It offers complete dances to perform, and much more: By learning detailed sequences your body will become accustomed to the transitions used in bellydance, enabling you to shift smoothly from one move to the next. As these become second nature, you will find yourself bringing new movements and increased confidence to your dance improvisation as well. \nJenna's program begins with a warm-up, and continues with the Hipwork and Upper Body Layering sections, each of which flows through variations of isolations and undulations, adding layers like shimmies and level changes to increase your control and range of motion.\n\nNext, Jenna breaks down dynamic and complex turns in an easy-to-follow manner. The turns are then arranged so that, with practice, you will feel completely comfortable adding them to your repertoire.\n\nJenna's two original choreographies allow you to put together many of the layers, turns, and transitions into beautiful dances you can make your own. Add your personal style, express yourself, and have fun!\n\nThe first choreography, set to an upbeat saiidi-style piece with a short drum solo section, features percussive accents and shimmy layering. The second choreography is a solo oriental piece rich in musicality and filled with delicious details. Jenna performs each dance for you, then breaks down each combination step-by-step with periodic repetitions, finally demonstrating the entire choreography facing the mirror so you can follow along as if you are right there in the studio!\n\n","torrent":{"xt":"urn:btih:47759f41683af53d72c813e017092604857601cf","amp;dn":"Bellydance+-+The+Next+Level%3A+Transitions%2C+Turns+%26amp%3B+Layers+wit","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"47759f41683af53d72c813e017092604857601cf","infoHashBuffer":{"type":"Buffer","data":[71,117,159,65,104,58,245,61,114,200,19,224,23,9,38,4,133,118,1,207]},"announce":[],"urlList":[]}}