{"title":"Under The Dome Episode 10 (720p)","uid":10726375,"size":1186807213,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:48b7244e8752841257e0c9bc294533bcd3e04ccc&amp;dn=Under+The+Dome+Episode+10+%28720p%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"shareregi","files":2,"time":1407568089,"description":"Linda takes Julia to help investigate Duke's involvement with previous criminal activity in Chester's Mill. During their investigation, Linda finds a note from Duke saying that after his son died from a drug addiction, he vowed to get drugs out of the town by making a deal with Maxine; he and others bought the propane she needed, and she would keep drugs out of the town; Reverend Lester then laundered the proceeds and Big Jim bought the propane. Julia then finds out that her husband Peter filed a five-year life insurance policy on himself. She later finds out that Barbie killed him, but she interprets it as Peter wanting to die due to his overwhelming debt. Maxine proves to Barbie that she intends to take over the town after she shows him an underground black market fight club. She then blackmails Barbie into fighting Victor, an old rival of his. He begins to win, but then throws the match, something Maxine expected him to do. Later, Maxine tries to seduce Barbie and threaten to reveal his secrets, but Barbie leaves saying that he is done with her. Big Jim finds a house on a nearby island that Maxine is supposedly hiding at, and finds the house's caretaker Agatha. Jim begins to look through the house, with Agatha eventually pulling a gun and revealing she is Maxine's mother, having given birth to her at age 16 and dropping out of high school. She then tells Jim that she knows as much as Maxine does about the town, especially about his and Barbie's secrets. Big Jim then intimidates her, saying that she doesn't have the courage to kill. He then grabs the gun from her and takes her to his boat. While on the boat, Agatha falls into the water, and cannot swim as her hands are tied up. She pleads for Jim to pull her up, but he leaves her to drown. That night, he heads home to find Linda waiting for him, telling him to meet her at the police station the next day for questioning. Joe, Angie, and Norrie touch the mini-dome in their barn simultaneously with the egg in the middle beginning to glow. The dome then reveals a fourth handprint, implying that a fourth hand is required to touch the dome. The three promise not to tell anyone as they search for the fourth person. Dodee then sneaks into the barn and touches the mini-dome. She is then shocked and knocked out. The three kids then take her to the hospital and tell her that she electrocuted herself while fixing her generator. Angie then asks Nurse Adams if any people have recently had seizures, and she replies saying not since her Grade 10 dance. Angie later tells Joe and Norrie that Junior had a seizure during that dance. She then tells them that she was kidnapped by Junior. Joe vows to get revenge on Junior, but not before Angie takes the two to Junior's house to show them a painting Junior's mother made of a dream she had, depicting Junior and &quot;pink stars falling in lines.&quot; Junior then finds them in the basement, and Joe runs toward him, but is put in a choke hold. Angie demands Junior let Joe go, and he does. The three then take Junior to the barn as the &quot;fourth hand.&quot; After the four of them touch the dome, the egg in the middle releases pink stars all over the barn walls. The four are astonished, though Junior looks confused, asking them what it means.","torrent":{"xt":"urn:btih:48b7244e8752841257e0c9bc294533bcd3e04ccc","amp;dn":"Under+The+Dome+Episode+10+%28720p%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"48b7244e8752841257e0c9bc294533bcd3e04ccc","infoHashBuffer":{"type":"Buffer","data":[72,183,36,78,135,82,132,18,87,224,201,188,41,69,51,188,211,224,76,204]},"announce":[],"urlList":[]}}