{"title":"Dream Theater - Systematic Chaos (FLAC)","uid":3740397,"size":590619182,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:48d3a26b16540f179e852d15217144c39eb6c06b&amp;dn=Dream+Theater+-+Systematic+Chaos+%28FLAC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"neonblack77","files":13,"time":1184308473,"description":"Dream Theater - Systematic Chaos\n\nFull-length, Roadrunner Records\nJune 4th, 2007 \t\n\n\n1.\tIn the Presence of Enemies, Pt. 1\t09:00\t\n2.\tForsaken\t05:36\t\n3.\tConstant Motion\t06:55\t\n4.\tThe Dark Eternal Night\t08:51\t\n5.\tRepentance\t10:43\t\n6.\tProphets of War\t06:01\t\n7.\tThe Ministry of Lost Souls\t14:57\t\n8.\tIn the Presence of Enemies, Pt. 2\t16:38\t\n\nTotal playing time\t01:18:41\n\n\n\nWritten by MadassAlex  on June 25th, 2007\n\nSystematic Chaos is an eight track album and much like Dream Theater&amp;#039;s other works is a musical progression in it&amp;#039;s entirety - that is, the songs aren&amp;#039;t only progressive as individual peices, but the whole album uses recurring themes to bring the album together. The nature of the vocals and each song&amp;#039;s individual theme leave the intent and interperatation of the album quite open. For example, the 6th track, &quot;Prophets Of War&quot; explores the futility and pointlessness of modern warfare, however on the demo, the spelling was &quot;Profits Of War&quot; which is much more in line with the lyrics, but one can&amp;#039;t help but wonder as to the intention of such a change.\n\nThe musicianship is nothing less than brilliant, and Dream Theater&amp;#039;s seamless musical progressions continue to earn praise. The melodic content in the performances of LaBrie and Petrucci leave little, if anything, to be desired. Many would catagorise John Petrucci as a player who prizes technique over expression, but this reviewer would happily use Systematic Chaos against that argument - there&amp;#039;s plenty of material there for the shred-heads, but for those who like a more restrained style of soloing there is some brilliant work. See track seven, &quot;The Ministry Of Lost Souls&quot; in particular for such a performance. As usual, LaBrie can move from Hetfield-esque rhythmic vocals to hyper-melodic wailing in an instant. Myung and Portnoy bring up the rhythm section skillfully as usual, although their work is rather overshadowed during softer moments in the album.\n\nRecurring melodic and rhythmic themes have always been a part of the sound of Dream Theater and Systematic Chaos displays this quite well. The first, seventh and eighth tracks make the best use of this, leaving the other five tracks as relative freeform performances. Track five, &quot;Repentance&quot;, is possibly one of the best songs released during the year from any metal band and features a guest performance from Steve Vai. The final words of the song linger with the listener and lend themselves thematically to the next track. The next track, &quot;Prophets Of War&quot;, includes a rap interlude that hasn&amp;#039;t gone down well with some fans, although given the context of the song, they are quite appropriate. Irrespective, the song closes in a way that is sympathetic to the beginning of &quot;The Ministry Of Lost Souls&quot;, thus signalling the beginning of the end for the album. &quot;Forsaken&quot;, &quot;Consant Motion&quot; and &quot;The Dark Eternal Night&quot; act more like precursors to the other tracks than anything, but it would be incorrect to label them as &quot;filler&quot;. From &quot;Repentance&quot; onward, there is a continuous fluxuation of tension, whereas from &quot;Forsaken&quot; to &quot;The Dark Eternal Night&quot; there isn&amp;#039;t such a large shift, giving a sense of continuity in comparison to the highs and lows of the later track. Summarised, the album begins straightforward (that is, for a Dream Theater album) and continuously gets more progressive.\n\nSystematic Chaos, in a word, DELIVERS. With a combination of brilliantly planned progressions, top-notch musicianship and new musical ideas while holding onto the sounds that make Dream Theater so unqiue and interesting, I would highly reccomend this album to any fan of progressive metal, metal or progressive music in general. Even if you&amp;#039;re a casual listener, the melodic vocals of LaBrie will keep you interested, and for those more interested in the building blocks of the songs and the instrumental parts, there&amp;#039;s a wealth of sound to explore.","torrent":{"xt":"urn:btih:48d3a26b16540f179e852d15217144c39eb6c06b","amp;dn":"Dream+Theater+-+Systematic+Chaos+%28FLAC%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"48d3a26b16540f179e852d15217144c39eb6c06b","infoHashBuffer":{"type":"Buffer","data":[72,211,162,107,22,84,15,23,158,133,45,21,33,113,68,195,158,182,192,107]},"announce":[],"urlList":[]}}