{"title":"Revelations - All Episodes DvDrip [Eng] P091","uid":3824615,"size":4330094080,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:49c8c1a38de1e434ea0e54a13b032f0ea14a76f3&amp;dn=Revelations+-+All+Episodes+DvDrip+%5BEng%5D+P091&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"Pogiest","files":6,"time":1191146666,"description":"This is a high quality DVD rip using WMV advanced Codec. I had a hard time finding these and thought I would share when I did find them.  Please Seed! I am only using a fast cable connection.\n\nPlot(taken from IMDB):\nSet just before the start of Armageddon, the series will follow two central characters, a physicist and a nun, who are racing against the clock to see if the end of the world apocalypse can be averted. Bill Pullman plays Dr. Richard Massey, a Harvard professor whose daughter is murdered by satanists while McElhone stars as a nun who recruits Massey to help investigate whether what&amp;#039;s told in the Book of Revelations is starting to come true. Seltzer and Polone with executive produce the project along with Pariah Television&amp;#039;s Vivian Cannon and Jessika Borsiczky. \n\nThe Armageddon is about to arrive and we follow two central characters, a physicist and a nun, who are racing to see if the end of the world apocalypse can be averted. Bill Pullman fills the role of Dr. Richard Massey, a Harvard professor and father mourning the murder of his daughter by a Satanist. McElhone stars as a nun who appeals to Massey to help investigate whether what&amp;#039;s told in the Book of Revelations is starting to come true. ","torrent":{"xt":"urn:btih:49c8c1a38de1e434ea0e54a13b032f0ea14a76f3","amp;dn":"Revelations+-+All+Episodes+DvDrip+%5BEng%5D+P091","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"49c8c1a38de1e434ea0e54a13b032f0ea14a76f3","infoHashBuffer":{"type":"Buffer","data":[73,200,193,163,141,225,228,52,234,14,84,161,59,3,47,14,161,74,118,243]},"announce":[],"urlList":[]}}