{"title":"Jaga Jazzist - Live With Britten Sinfonia (2013) [EAC-FLAC]","uid":14746863,"size":474582956,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:4a4678c1f1e1c2969501f8d59d27fe7b25840f8d&amp;dn=Jaga+Jazzist+-+Live+With+Britten+Sinfonia+%282013%29+%5BEAC-FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pucholoco","files":21,"time":1464733900,"description":"Jaga Jazzist - Live With Britten Sinfonia (2013)\r\n            EAC rip (secure mode) | FLAC (tracks)+CUE+LOG -&gt; 418 Mb\r\n                      Full Artwork @ 300 dpi (png) -&gt; 57 Mb\r\n\r\n\r\nGiven the depth of Jaga Jazzist's sophistication and their wide-ranging musical vision that encompasses everything from free jazz to hip-hop, from techno to funk, from rock to modern composition, this Norwegian ensemble is a natural partner for a collaboration with the internationally renowned Britten Sinfonia under the direction of Christian Eggen. \r\n\r\nThe material was chosen from JJ's catalog (particularly from the One-Armed Bandit album, which they were touring in support of), and is beautifully arranged, performed, and recorded. While the lengthy treatment of &quot;One-Armed Bandit&quot; opens with strings, brass, and winds playing something that resembles a cadenza from one of the Sinfonia's namesake's symphonies, it quickly quiets down into the nearly pastoral for a few minutes before JJ enters with a persistent beat-head pulse, and the piece morphs into a symphonic, progressive jazz workout with a fantastic array of colors.\r\n\r\nThe plucked strings and bass clarinet that introduce &quot;Kitty Wu&quot; set up a compelling juxtaposition that expands to include synths, loops, breaks, and a contrapuntal dialogue between electric guitars, brass, organic and synthetic rhythms, striding strings, and expansive winds. Not all of this gig works, however. At nearly 11 minutes, &quot;Bananfluer Overalt&quot; reveals surprisingly little in terms of contrast, dynamic, or adventure – even with its killer rock guitar solo – and &quot;Toccata&quot; says more about the Sinfonia than it does JJ; the winds shine brighter than the brass-heavy, Euro-big-band chart. \r\n\r\nNeither of these pieces is dull, it's just that the earlier part of the album creates great expectations. Thankfully, those are met on the set's last two pieces, the formidable rock and sonic effects fireworks that color the orchestra's pulsing energy on &quot;Music! Dance! Drama!,&quot; and the beautifully articulated tonal and textural journey that transforms this reading of &quot;Oslo Skyline.&quot; While Live with the Britten Sinfonia may be too formal to provide the wild, free-ranging ride that one might expect from this adventurous lot, it is dazzling in its own right and in almost all the right ways.\r\n\r\n\r\n------------------------------------------------------------------------------\r\nTracklist:\r\n------------------------------------------------------------------------------\r\n\r\n01 - One Armed Bandit\r\n02 - Kitty Wu\r\n03 - Prungen\r\n04 - Bananfluer Overalt\r\n05 - For All You Happy People\r\n06 - Toccata\r\n07 - Music! Dance! Drama!\r\n08 - Oslo Skyline\r\n\r\n© 2013 Ninja Tune / Beat Records Japan | BRC-372\r\n\r\n\r\n\r\nEnjoy and Sharing, Thanks!","torrent":{"xt":"urn:btih:4a4678c1f1e1c2969501f8d59d27fe7b25840f8d","amp;dn":"Jaga+Jazzist+-+Live+With+Britten+Sinfonia+%282013%29+%5BEAC-FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4a4678c1f1e1c2969501f8d59d27fe7b25840f8d","infoHashBuffer":{"type":"Buffer","data":[74,70,120,193,241,225,194,150,149,1,248,213,157,39,254,123,37,132,15,141]},"announce":[],"urlList":[]}}