{"title":"the cosby show season 6 dvdrip","uid":4548332,"size":4658632751,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:4a4ec9959f6563bbee077d3c11aa46daaca68c41&amp;dn=the+cosby+show+season+6+dvdrip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"alexmill","files":27,"time":1228216875,"description":"this is the cosby show season 6 dvdrip \n\nThe sixth season of one of television history's most famous and ground breaking sitcoms is compiled in this collection THE COSBY SHOW, which went on to become one of the most popular shows on television. Even in its very first year, THE COSBY SHOW was the third highest rated show in America. On the program, Cosby played Dr. Heathcliff Huxtable, who along with his wife Claire, an attorney, struggled to balance the challenges of their successful careers with the demands of their five children. The five kids all varied greatly in age and each had their own problems, which lead to a variety of plotlines for the sitcom to utilize. Cosby's goal with the show was to present a positive view of a regular, middle-class, and successful African-American family.\n\nThe older the kids get, the tougher life seems for Cliff (Bill Cosby) and Clair (Phylicia Rashad) in the sixth season of this hit series. Just when they think they've got the household under control, Denise (Lisa Bonet) returns from Africa still unsure of what to do with her life -- and with 4-year-old stepdaughter Olivia in tow. Malcolm-Jamal Warner, Tempestt Bledsoe, Keshia Knight Pulliam and Sabrina Le Beauf co-star. \n\n","torrent":{"xt":"urn:btih:4a4ec9959f6563bbee077d3c11aa46daaca68c41","amp;dn":"the+cosby+show+season+6+dvdrip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4a4ec9959f6563bbee077d3c11aa46daaca68c41","infoHashBuffer":{"type":"Buffer","data":[74,78,201,149,159,101,99,187,238,7,125,60,17,170,70,218,172,166,140,65]},"announce":[],"urlList":[]}}