{"title":"Maximo Vs Army Of Zin [PS2 DVD English]","uid":6710768,"size":668258168,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:4a54f6c52f8fe6375cfd633d7fd17ab6ff527e41&amp;dn=Maximo+Vs+Army+Of+Zin+%5BPS2+DVD+English%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"razalgul1979","files":17,"time":1317347633,"description":"*******************************************************************************\nMaximo Vs Army Of Zin [PS2 DVD English]\n*******************************************************************************\n\n-------------------------------------------------------------------------------\nGeneral Information\n-------------------------------------------------------------------------------\nType.................: Game\nPlatform.............: PS2\nPart Size............: 50,000,000 bytes\nNumber of Parts......: 14\nCompression Format...: RAR\nFile Validation......: SFV\nImage Format.........: .iso\nImage Created with...: ImgBurn\n\n\n\n\n-------------------------------------------------------------------------------\nPost Information\n-------------------------------------------------------------------------------\nPosted by............: Capcom\nPosted on............: 20/01/2004\n\n-------------------------------------------------------------------------------\nRelease Notes\n-------------------------------------------------------------------------------\nCapcom\n3D Platformer\nRelease: Jan 20, 2004 Ã‚Â»\nESRB: Teen\n\nMaximo vs Army of Zin Review\n\nIt's not for the faint of heart, but if you're looking for complex and rewarding\naction-platforming, Maximo vs. Army of Zin really satisfies.\n\nThe sadists who brought you 2001's Maximo: Ghosts to Glory are back for another\nhellish go with a new sequel, Maximo vs. Army of Zin. These games are noteworthy\nfor two reasons. First, they're successors in spirit to the venerable Ghosts 'n\nGoblins platformers of yore, and second (following the first point), they're\nhard as all hell. Like its predecessor, Maximo vs. Army of Zin eschews modern\ngaming conveniences, like ample save points and unlimited lives, opting instead\nto make you sweat it out with only a handful of lives and lots of enemies and\npitfalls to overcome. If you can grit your teeth and get past the daunting\nfrustration factor, you'll find in Army of Zin a surprisingly deep and involved\nhack-and-slash platformer with a quirky, endearing style and a lot of heart.\n\nMaximo takes time off from searching for Sophia to battle evil robots in Maximo\nvs. Army of Zin.\n\nThe story picks up some time after the end of the first game, with Maximo and\nhis pal Grim (y'know, the grim reaper) searching the wilds for Maximo's lost and\npresumed-dead love Sophia. After coming to the aid of a village under attack by\nghastly, shuffling automatons, Maximo realizes that the Army of Zin, a mythical\nlegion of soul-powered robots, is again on the loose, though it was imprisoned\nin a vault 500 years earlier by the Baron of Hawkmoor. So Maximo, the hero that\nhe is, sets out to protect the land from this new menace and to find out just\nhow the heck the robots escaped their tomb in the first place. The story evolves\nthrough real-time cutscenes--and the occasional prerendered movie--throughout\nthe game's five major areas. The story's actually compelling enough to keep you\ngoing, so even if the game wasn't any fun, the story would still likely keep you\ninvolved.\n\nFortunately, the game is fun. If you played the original Maximo: Ghosts to\nGlory, then Army of Zin will look pretty similar to you on the surface. Don't be\nfooled, though, because Capcom has made a startling number of fixes and upgrades\nunder the hood. The fundamental mechanics are, of course, still the same. You\nstill run through a level, double-jump over obstacles, and swing your sword at\nevery malevolent being that crosses your path. Now, however, there's a lot more\nmeat to controlling Maximo's heroics because this time you can purchase a number\nof upgrades from wandering merchants for your sword, shield, and even boxer\nshorts. You'll also pick up a massive combat hammer early on, and then later\nyou'll receive elemental replacements for both this hammer and your trusty\nsword. The weapon upgrades give you new melee powers, like a spin attack or a\ndashing stab, which makes it easier to get out of tight spots in combat. Your\nshield powers give you the ability to actually throw the shield, or you can use\nit to suck up treasure. Finally, the various pairs of underwear help you to gain\nadditional armor or attack power, among other things. (Interestingly, they may\neven help you find hidden treasure chests.)\n\nThere's a slew of new items and abilities at your disposal this time around.\n\nThe more you play Army of Zin, the more you'll discover how rewarding and just\nplain entertaining the combat can be. Maximo can execute a basic horizontal and\noverhead attack with his weapon, and these can be combined in different ways to\nproduce some really long combo strings. In fact, the game even adds a combo\ncounter to keep track of your hits, and the more you can get in one combo, the\nmore treasure you'll be rewarded with when the enemies are defeated. It's good\nthat Maximo is such a capable fighter this time around, since he deals with a\ntruly awful number of evil robots and other enemies. Once you get a handle on\nthe combat, it's pretty exhilarating to go buck wild with your sword combos to\nclear an entire room's worth of the clockwork bastards in just a few seconds.\n\nIn terms of volume, Maximo vs. Army of Zin isn't the longest game. However, that\ndoesn't take into account the many inevitable times you'll have to retry a given\nlevel until you make it through, so the game will definitely take you a while to\nfinish. As mentioned, the game's levels are split into five distinct areas, each\nwith a rampaging boss at the end. Each level is really pretty long, and they're\nall densely packed with enemies, obstacles, and nicely varied scenery. You're\nrated at the end of each level based on how many enemies you killed, how many\nvillagers you saved, and how many secrets you found. Once you've done it all,\nthe level is stamped with a &quot;mastered&quot; seal. The more levels you master, the\nmore trinkets you can unlock from an in-game art gallery. Finishing the game\nwill take you a decent amount of time, unless you have machinelike precision.\nHowever, the sheer fun of the gameplay and the unlockables should keep you\ncoming back for a while afterward.\n\nIf all this talk of white-knuckled difficulty makes you squeamish, or skeptical,\nperhaps an explanation is in order. What makes Maximo vs. Army of Zin so hard is\nthe way the game handles your lives and saving your progress. You start out with\nthree lives at the beginning of the game, and that's it. There are no continues.\nThere's no nothin'. You can gain extra lives by collecting lots of souls from\nenemies (which is time-consuming) or by buying them from merchants (which is\nexpensive). Basically, though, you'll have to be very, very careful, and you'll\nhave to prevent yourself from dying too often if you want to make it to the end.\nThe game is just punishing in a lot of its little gameplay touches. For\ninstance, you never, ever get your health and armor restored between levels. So\nif you're down to your underwear and only a sliver of life left when you finish\na level and move on to the boss, too bad--that's how you're fighting him. As\nanother example, if you collect important items (like extra armor) in one area\nand then die, when you respawn at a checkpoint and go through the area again,\nthese items will be gone. Pretty hardcore. If you like your action games\nunforgiving, this is about as hard as it gets these days.\n\nIf you like your action hatefully difficult, Army of Zin is the game for you.\n\nArmy of Zin's presentation is a little mixed, but its endearing humor and style\nshine through the occasional murk. The graphics are improved over the previous\ngame but are still not quite on par with the very best the PlayStation 2 has to\noffer. The character models are reasonably detailed, and they animate quite\nexpressively. Additionally, the environments are diverse but could use a little\nmore geometry in places. Any technical shortcomings are made up for by the\ngame's quirky style, though, which is led by the great design for the Zin. The\nrobots have a really cool clockwork look, and their gaping metal maws and beady\nglowing eyes make them appear downright evil. The other enemies and bosses have\na lot of personality too, as does the steely and heroic Maximo, who once again\ncan be stripped of his armor and forced to run around in his undergarments.\nAmusingly, the underwear upgrade you currently have equipped is the one that\nwill show on your character model when you're in the buff. These kinds of\nhumorous stylistic touches really make Army of Zin a pleasure to look at while\nyou're playing.\n\nMaximo's sound design is generally quite good as well, with plenty of\nappropriate sounds scattered all over the place to enhance the feel and\natmosphere of the action. There's all manner of clanging and crashing sounds\nassociated with the Zin robots, and they make a great screeching sound when they\ncome hurtling from the sky to attack you. Thankfully, the voice acting is quite\nappropriate for the game and doesn't grate at all. The music is pretty moody or\nepic or what have you, depending on the level--which is to say that it generally\nfits in and doesn't clash with the goings-on. Alas, it's not all that memorable.\nThe only real quibble we have with the game's sound involves the fact that it\nsometimes seems a little low-fi, for lack of a better description. It's as if\nthe sounds were sampled at a lower rate than usual and are a little muddier for\nit.\n\nArmy of Zin proves that big rampaging robots are a menace to all eras.\n\nBy definition, Maximo vs. Army of Zin is a great sequel. It identifies flaws in\nthe first game and fixes them, and it also adds a healthy smattering of new and\nimproved gameplay as well. Yeah, it can be a maddeningly difficult game (just\ntry it and see!) but it's also a naggingly addictive one. Army of Zin is\nexpertly paced--the even distribution of new items and abilities keeps the game\nfresh all the way to the end--so even when you're ready to hurl your controller\n(and various expletives) at the screen, you just can't help but keep playing.\nIt's not for the faint of heart, but if you're looking for complex and rewarding\naction-platforming, Maximo vs. Army of Zin really satisfies.\n\nBy Brad Shoemaker, GameSpotPosted Jan 19, 2004 12:00 am PT\n\n-------------------------------------------------------------------------------\nInstall Notes\n-------------------------------------------------------------------------------\nSource: DVD 5\nBurn the ISO with your favorite program and do not forget to seed Ratio 1.1 ","torrent":{"xt":"urn:btih:4a54f6c52f8fe6375cfd633d7fd17ab6ff527e41","amp;dn":"Maximo+Vs+Army+Of+Zin+%5BPS2+DVD+English%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4a54f6c52f8fe6375cfd633d7fd17ab6ff527e41","infoHashBuffer":{"type":"Buffer","data":[74,84,246,197,47,143,230,55,92,253,99,61,127,209,122,182,255,82,126,65]},"announce":[],"urlList":[]}}