{"title":"Nutrition in Public Health Principles, Policies, and Practice","uid":6466798,"size":6157409,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4a55f92452c3571f675ac9656fb2c0ae379ce022&amp;dn=Nutrition+in+Public+Health+Principles%2C+Policies%2C+and+Practice&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"lionzbay","files":1,"time":1307987114,"description":"Author(s): Arlene Spark\nPublisher: CRC Press\nDate:2007-05-11\nFormat: pdf\nLanguage: English\nISBN10:0849314739\nPages: 576\nISBN13:9780849314735\n\nProduct Description: Nutrition plays a key role in many areas of public health such as pre-term delivery, cancer, obesity, diabetes, and cardiovascular and renal diseases. Government nutrition policy, therefore, bears a huge influence on the nation's biggest health concerns. There is a clear need for information on this topic that unarguably holds the key to the primary and secondary prevention of some of the major causes of premature death in the US.\n\nNutrition in Public Health: Principles, Policies, and Practice provides an overview of the field and focuses on the role of the Federal Government in determining nutrition policy and practice. Beginning with a review of the definition and principles of public health, the book examines trends in the US population and nutritional epidemiology. It considers programs to help reduce disparities in the prevalence of diet-related chronic diseases among various populations, as well as a detailed chapter on obesity with discussions on global impact and cost, pediatric obesity, and the impact of socioeconomic status and ethnicity. Specific information is included on breastfeeding mothers, HIV/AIDS, and prison inmates. The book offers a look at the current nutritional status and guidelines in the US before providing a set of tools for the responsible practice of public health nutrition such as conducting nutrition assessments, designing and carrying out social marketing campaigns, writing grant proposals, and enacting programs to promote food security and ensure food supply and safety.\n\nFocusing on nutrition issues in the urban setting, Nutrition in Public Health: Principles, Policies, and Practice provides an integrated view of nutrition needs and the policies and political mechanisms that affect the delivery of quality food and nutrition services.","torrent":{"xt":"urn:btih:4a55f92452c3571f675ac9656fb2c0ae379ce022","amp;dn":"Nutrition+in+Public+Health+Principles%2C+Policies%2C+and+Practice","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4a55f92452c3571f675ac9656fb2c0ae379ce022","infoHashBuffer":{"type":"Buffer","data":[74,85,249,36,82,195,87,31,103,90,201,101,111,178,192,174,55,156,224,34]},"announce":[],"urlList":[]}}