{"title":"(PSX-PSP) Bust-A-Move 2: Arcade Edition converted properly [Reso","uid":5027048,"size":298620574,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:4b310775514d2556f8db55e3bd91d5b266ac359c&amp;dn=%28PSX-PSP%29+Bust-A-Move+2%3A+Arcade+Edition+converted+properly+%5BReso&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"toxicjuggalo","files":2,"time":1248740962,"description":"BUST A MOVE 2 - ARCADE EDITION:\n\nIn BUST-A-MOVE 2: Arcade Edition a cute, green dinosaur is under attack from colored bubbles. Armed only with a bubble-shooting machine, the dinosaur must eliminate all of the bubbles before they come crashing down around him. This is fairly simple to do, since any time three bubbles of the same color come into contact with each other they pop; they also destroy any other bubbles they were touching. The major complication is that the bubbles are steadily falling towards our little green friend. Jumping into the game is fairly easy; putting it down is much harder. Will the green dinosaur be able to destroy the bubble menace? Play BUST-A-MOVE 2 and find out.\n\nLet me know what ya think of my new boot screen ;) Tested and working on all CFW's 5.00 m33 and above using the 500 popsloader pack set on 3.72 POPS... Like my work?? Please read the NFO and support me ;)\n\n\nHave you been looking for that classic PSX game but just can't seem to find it anywhere? How about those &quot;rare&quot; titles that were only released in certain regions? Better yet, would you like to be able to have those games playable on your PSP so you can play them anywhere you want? Want to get those conversions directly from the source instead of through &quot;unsafe&quot; torrent browsers? Come and request them at\n\n                         www.reputation-resource.com.","torrent":{"xt":"urn:btih:4b310775514d2556f8db55e3bd91d5b266ac359c","amp;dn":"%28PSX-PSP%29+Bust-A-Move+2%3A+Arcade+Edition+converted+properly+%5BReso","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4b310775514d2556f8db55e3bd91d5b266ac359c","infoHashBuffer":{"type":"Buffer","data":[75,49,7,117,81,77,37,86,248,219,85,227,189,145,213,178,102,172,53,156]},"announce":[],"urlList":[]}}