{"title":"The Brooklyn Tabernacle Choir- I'll say yes","uid":4084459,"size":102214781,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:4b33b3f95f65c9bb28161194560cbe2bc06001d0&amp;dn=The+Brooklyn+Tabernacle+Choir-+I%5C%27ll+say+yes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"doomgiver36","files":13,"time":1205725835,"description":"I&amp;#039;ll Say Yes\n* Your heart&amp;#039;s response to worshiping with the live and alive Brooklyn Tabernacle Choir will be a resounding &quot;Yes!&quot; Includes &quot;Holy Is the Lord,&quot; &quot;Worthy Is the Lamb,&quot; &quot;I Adore You,&quot;  &quot;We Fill the Sanctuary,&quot; &quot;I Will Bless Your Name,&quot; &quot;King of Glory,&quot; &quot;Spirit Fall Down,&quot; &quot;Holy Spirit Come,&quot; the title track, and more.\n\nSounds like ?  choral gospel-pop like only the Brooklyn Tabernacle Choir can deliver, plus the church styling of Kurt Carr, Andrae Crouch, Larnelle Harris.\n\nAt a glance ? Several ballads overstay their welcome, but I&amp;#039;ll Say Yes continues to offer exactly what congregates have come to expect from the acclaimed 300-member choir.\n\nTrack Listing\n1. Holy Is the Lord\n2. O How I Love the Name\n3. Hallelujah You&amp;#039;re Worthy\n4. I Never Lost My Praise\n5. We Fill the Sanctuary\n6. The Lord Thy God\n7. I Adore You\n8. I&amp;#039;ll Say Yes\n9. Spirit Fall Down\n10. I Need You Once Again\n11. Hallelujah to the King\n12. Bless Your Name Forevermore\n13. Worthy Is the Lamb\n\nThe Brooklyn Tabernacle Choir&amp;#039;s list of accomplishments reads like a publicist&amp;#039;s dream. With 26 albums, 6 Grammys, 7 Dove Awards, and more than 4 million discs sold, they&amp;#039;re not only one of the most decorated choirs in Christian and gospel music?and one of the most decorated artists, period.\n\nTwo key elements to the choir&amp;#039;s success are their multi ethnic makeup and pop inclinations. At its core, it&amp;#039;s a gospel choir, but its cosmopolitan membership, polished sound, orchestral elements, and easy-to-learn worship lyrics have made it a favorite among listeners who aren&amp;#039;t drawn to more raw and charismatic traditional gospel.\n\nI&amp;#039;ll Say Yes, the Brooklyn Tab&amp;#039;s first for Integrity music, keeps all of these ingredients intact and unfolds as expected to churchgoers familiar with their past work. Choir director Carol Cymbala is a church-music purist, so she makes sure to keep the songs as grand, repetitive, and straightforward as possible?no surprises whatsoever, including covers of Chris Tomlin&amp;#039;s &quot;Holy Is the Lord&quot; and Darlene Zschech&amp;#039;s &quot;Worthy Is the Lamb.&quot;\n\nThe choir&amp;#039;s duties have always been split between special music ensemble (&quot;I Need You Once Again,&quot; the Kurt Carr original &quot;I Never Lost My Praise&quot;) and straightforward worship leading (&quot;O How I Love the Name,&quot; &quot;Hallelujah You&amp;#039;re Worthy&quot;). Both facets have a place within the church, but it&amp;#039;s when the choir leads the worshipers that the singers truly shine, particularly the Latinized &quot;We Fill the Sanctuary&quot; and the Larnelle-styled &quot;Hallelujah to the King.&quot;\n\nThis explosiveness offsets the more expansive, drawn-out arrangements. At 13 songs and 71 minutes, I&amp;#039;ll Say Yes tends to overstay its welcome, particularly during the ballads. It&amp;#039;s still an opulent, well-performed collection, even if best enjoyed in small doses.\n &lt;a href=&quot;\nhttp://store.brooklyntabernacle.org/bookstore/product.cfm?SKU=CD-24&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://store.brooklyntabernacle.org/bookstore/product.cfm?SKU=CD-24&lt;/a&gt;","torrent":{"xt":"urn:btih:4b33b3f95f65c9bb28161194560cbe2bc06001d0","amp;dn":"The+Brooklyn+Tabernacle+Choir-+I%5C%27ll+say+yes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4b33b3f95f65c9bb28161194560cbe2bc06001d0","infoHashBuffer":{"type":"Buffer","data":[75,51,179,249,95,101,201,187,40,22,17,148,86,12,190,43,192,96,1,208]},"announce":[],"urlList":[]}}