{"title":"Cell Phone Software","uid":3503856,"size":70093377,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:4bc0c422ac127539b013d00699adc3922c9b652f&amp;dn=Cell+Phone+Software&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Arjun143","files":14,"time":1153011894,"description":"This torrent has all the Cell Phone Software you&amp;#039;re going to need to hook up your Cell Phone to you Computer. I originally started searching for software like this when I bought a Motorola V3c Razr from Telus Mobility. It took me a while to find all the files I needed to properly attach my V3c to my PC. This torrent has the drivers for the Razr phone. It has all the software you&amp;#039;re going to need to do various things with your phone on your PC. I also included AudaCity (an audio editing program) because I&amp;#039;ve heard that this is the most popular program that people use to edit their songs before uploading them to their phone. There is a LAME MP3 encoder which you&amp;#039;re going to need for AudaCity to encode MP3 files.\n\nThe software included in this torrent are:\n\n-Motorola Phone Tools (after installing make sure you update it to the latest version)\n-BitPim\n-MotoKit\n-Motorola PST Phone Programmer (might be illegal to have this one, just letting you know ;) )\n-P2K\n -P2KCommander\n -P2KMan\n -P2KSeem\n -P2KTools\n-Razr V3c USB Driver (VenomXt from ossn.net)\n-AudaCity with LAME MP3 Encoder\n\nThat seems to be about it. I think there&amp;#039;s probably a few little tools that I may have missed in there.\n\nAnyways, I hope this torrent is the answer to all that searching you&amp;#039;ve been doing. Why didn&amp;#039;t someone make this before I started looking :P.\n\nTo all the people who has completed the download, PLEASE seed as my Azureus program crashes in the middle of the night, hence I can&amp;#039;t seed 24/7.\n\n\nLeave a comment if you&amp;#039;re happy with the software. Enjoy!","torrent":{"xt":"urn:btih:4bc0c422ac127539b013d00699adc3922c9b652f","amp;dn":"Cell+Phone+Software","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4bc0c422ac127539b013d00699adc3922c9b652f","infoHashBuffer":{"type":"Buffer","data":[75,192,196,34,172,18,117,57,176,19,208,6,153,173,195,146,44,155,101,47]},"announce":[],"urlList":[]}}