{"title":"Markets Not Capitalism: Individualist Anarchism Against Bosses,","uid":7994093,"size":2439096,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4c1970e6110b1224006d7d767b8f02e5df001be7&amp;dn=Markets+Not+Capitalism%3A+Individualist+Anarchism+Against+Bosses%2C+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"imarion","files":-1,"time":1357567380,"description":"Markets Not Capitalism: Individualist Anarchism Against Bosses, Inequality, Corporate Power, and Structural Poverty By Gary Chartier, Charles W. Johnson\n2011 | 440 Pages | ISBN: 1570272425 | PDF | 2 MB\n\n\n\n\nMarkets Not Capitalism: Individualist Anarchism Against Bosses, Inequality, Corporate Power, and Structural Poverty is a new collection of left-wing pro-market, anticapitalist anarchist writing, edited by Gary Chartier &amp; Charles W. Johnson. Individualist anarchists believe in mutual exchange, not economic privilege. They believe in freed markets, not capitalism. They defend a distinctive response to the challenges of ending global capitalism and achieving social justice: eliminate the political privileges that prop up capitalists. Massive concentrations of wealth, rigid economic hierarchies, and unsustainable modes of production are not the results of the market form, but of markets deformed and rigged by a network of state-secured controls and privileges to the business class. Markets Not Capitalism explores the gap between radically freed markets and the capitalist-controlled markets that prevail today. It explains how liberating market exchange from state capitalist privilege can abolish structural poverty, help working people take control over the conditions of their labor, and redistribute wealth and social power. Featuring discussions of socialism, capitalism, markets, ownership, labor struggle, grassroots privatization, intellectual property, health care, racism, sexism, and environmental issues, this unique collection brings together classic essays by leading figures in the anarchist tradition, including Proudhon and Voltairine de Cleyre, and such contemporary innovators as Kevin Carson and Roderick Long. It introduces an eye-opening approach to radical social thought, rooted equally in libertarian socialism and market anarchism. ","torrent":{"xt":"urn:btih:4c1970e6110b1224006d7d767b8f02e5df001be7","amp;dn":"Markets+Not+Capitalism%3A+Individualist+Anarchism+Against+Bosses%2C+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4c1970e6110b1224006d7d767b8f02e5df001be7","infoHashBuffer":{"type":"Buffer","data":[76,25,112,230,17,11,18,36,0,109,125,118,123,143,2,229,223,0,27,231]},"announce":[],"urlList":[]}}