{"title":"Brain Bullet Install.exe","uid":3422957,"size":748659,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:4cb17cc6dba337562377819a89f5649113c9f1b5&amp;dn=Brain+Bullet+Install.exe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"xenofiber","files":1,"time":1135145508,"description":"Do you ever get spam mail about some program that seems interesting? I don't mean interesting enough that you want to pay the $39.97 they want for it. Yet interesting enough to check it out.\n\nHere is one for you. Brain Bullet. I just got spammed about it tonight. I swear I'm not going to pay a spammer a penny for a product, and neither should anyone else.\n\nI can not tell you if the program lives up to it's claims, just downloaded it.\n\nThis is my first torrent upload. Spam pisses me off, so think of this and most likely future torrents from me, as the revenge on software spammers seriers.\n\nSoftware Description below:\n\n\n\nNew 'Performance Technology' Zaps Your Mind With Powerful Commands... Helping You Achieve Almost Anything You Desire, Automatically!\n\nBrand NEW software automatically motivates, empowers, and re-educates your mind to develop &quot;super-human&quot;-like powers... FAST!\n\nEvery minute you spend at your PC, will &quot;tune&quot; your brain into automatically achieving MORE\nThe Technology They Tried To Ban... The Secret They Kept From You...\n\n\n\n\n\n\nWell, you get the idea of what they are getting at. You can google &quot;brain bullet&quot; and find lots of info about it. I refuse to give them a link to their selling page.","torrent":{"xt":"urn:btih:4cb17cc6dba337562377819a89f5649113c9f1b5","amp;dn":"Brain+Bullet+Install.exe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4cb17cc6dba337562377819a89f5649113c9f1b5","infoHashBuffer":{"type":"Buffer","data":[76,177,124,198,219,163,55,86,35,119,129,154,137,245,100,145,19,201,241,181]},"announce":[],"urlList":[]}}