{"title":"Rod Stewart - Atlantic Crossing 2cd Limited Ed 2009 (EAC~FLAC)","uid":5024493,"size":689288911,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:4ccd107e0531d1843b7bca23952aaa6df97a0fbe&amp;dn=Rod+Stewart+-+Atlantic+Crossing+2cd+Limited+Ed+2009+%28EAC%7EFLAC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"miona45","files":-1,"time":1248629736,"description":"When Rod Stewart signed to Warner Bros. in 1975, the deal coincided with his move to the States, and his coming into his own as a reigning global superstar. Stewart's debut for the label, ATLANTIC CROSSING, was his sixth solo LP and his first without any of his mates from the Faces, who disbanded in '75. Produced by the legendary Tom Dowd, it made Billboard's Top 10, and charted with the now-classic hits 'Sailing' and 'This Old Heart Of Mine.' A NIGHT ON THE TOWN followed in 1976-Stewart's first platinum release, it delivered the #1 smash 'Tonight's The Night.' Both albums mixed covers and originals split between fast and slow sides, and both were recorded in Muscle Shoals and Los Angeles with session luminaries including the MG's. The pleasure of each title is now doubled with 2-CD COLLECTOR'S EDITIONS, and a wealth of previously unreleased tracks.\n\nRod Stewart's sixth album was called Atlantic Crossing because the singer was literally crossing the Atlantic, making America his new home for reasons of the heart (he was fully enamored with actress Britt Ekland at the time) and the wallet (he was eager to escape Britain's restrictive tax rates). As it happens, 1975 was a perfect time for a new beginning for Stewart: the Faces were falling apart, his last LP, Smiler, wasn't roundly loved, and he had wrapped up his contract with Mercury and signed with Warner, so he completely rebooted, hiring legendary producer Tom Dowd to steer him through a slick, streamlined revamping of his signature sound. The first thing to be ditched were any traces of the ragged folkie who had popped up on all his first five solo albums, including on his career-making hit &quot;Maggie May,&quot; a move that may partially have been due to Stewart's longtime writing partner Martin Quittenton deciding to sever ties with him. Without those ringing acoustic guitars, Dowd and Stewart ratcheted up the rock &amp; roll, soul, and whiskey-soaked ballads, first taking a stab at recording the album with the MG's (outtakes of which popped up on Warner's 2009 double-disc Collector's Edition of the album), then expanding this core group with other studio pros who could easily settle into a smooth, polished groove. The results were splashy without being glitzy, soulful without being gritty, an impressive big-budget revamp of Stewart that benefited enormously from a clutch of great songs, both originals and covers. Tellingly, all the great originals arrive on the first side dubbed &quot;The Fast Half,&quot; with Rod writing blistering, funny rockers about being laid up three times with VD (&quot;Three Time Loser&quot;) and suffering through an unwanted sobriety (&quot;Stone Cold Sober&quot;), then easing back for a quick romance on the Jesse Ed Davis co-written &quot;Alright for an Hour&quot; -- all good indications that his heart was still at a party. But the &quot;Slow Half&quot; did reveal that Stewart had lost none of his fine, nuanced interpretive skills, as he tore into Danny Whitten's &quot;I Don't Want to Talk About It,&quot; took his first stab at &quot;This Old Heart of Mine,&quot; and kept &quot;Sailing&quot; from drifting away into sentimentality. When taken together, the two halves might have showcased a somewhat slicker Stewart, but he was still the same old Rod with a big, oversized heart and an irresistible bad boy smirk. He may have crossed the Atlantic, but he was none worse for the wear for his journey, at least not yet. \n\n\nArtist...............: Rod Stewart\nAlbum................: Atlantic Crossing 2 cd Limited Edition\nGenre................: Pop\nSource...............: CD\nYear.................: 2009\nRipper...............: EAC (Secure mode) / LAME 3.92 &amp; Hl-Dt-St CD-RW GCE-8160B\nCodec................: Free Lossless Audio Codec (FLAC)\nVersion..............: reference libFLAC 1.2.1 20070917\nQuality..............: Lossless, (avg. compression: 60 %)\nChannels.............: Stereo / 44100 HZ / 16 Bit\nTags.................: VorbisComment\n\n\n\n\n\nTracklisting cd 1\n\n\n1. Three Time Loser\n2. Alright For An Hour\n3. All In The Name Of Rock 'N' Roll\n4. Drift Away\n5. Stone Cold Sober\n6. I Don't Want To Talk About It\n7. It's Not The Spotlight\n8. This Old Heart Of Mine\n9. Still Love You\n10. Sailing\n11. Skye Boat Song (The Atlantic Crossing Drum &amp; Pipe Band)\n\n\n\nTracklisting cd 2 ( All Previously Unissued )\n\n\n1. To Love Somebody (&amp; The MG's)\n2. Holy Cow (&amp; The MG's)\n3. Return To Sender (&amp; The MG's)\n4. Three Time Loser (Alternate Version)\n5. Alright For An Hour (Alternate Version)\n6. All In The Name Of Rock 'N' Roll (Alternate Version)\n7. Drift Away (Alternate Version)\n8. Too Much Noise (Early Version Of Stone Cold Sober)\n9. I Don't Want To Talk About It (Alternate Version)\n10. It's Not The Spotlight (Alternate Version)\n11.This Old Heart Of Mine (&amp; The MG's)\n12. Still Love You (Alternate Version)\n13. Sailing (Alternate Version)\n14. Skye Boat Song (The Atlantic Crossing Drum &amp; Pipe Band)\n15. Niet Genoemd\n\n\n\nIncluded.............: MD5, M3U, LOG, CUE\nCovers...............: Front Back CD's\nenjoy!","torrent":{"xt":"urn:btih:4ccd107e0531d1843b7bca23952aaa6df97a0fbe","amp;dn":"Rod+Stewart+-+Atlantic+Crossing+2cd+Limited+Ed+2009+%28EAC%7EFLAC%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ccd107e0531d1843b7bca23952aaa6df97a0fbe","infoHashBuffer":{"type":"Buffer","data":[76,205,16,126,5,49,209,132,59,123,202,35,149,42,170,109,249,122,15,190]},"announce":[],"urlList":[]}}