{"title":"Moseley-UFO Crash Secrets at Wright Patterson Air Force Base(199","uid":5015019,"size":17494469,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4d282399bc1348df93e7cfe79e5a70e3c817ef92&amp;dn=Moseley-UFO+Crash+Secrets+at+Wright+Patterson+Air+Force+Base%28199&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"red_gonzo","files":1,"time":1248184632,"description":"This is James W. Moseley's amazing book UFO Crash Secrets at Wright Patterson Air Force Base (1991) which is an examination of the evidence and varied reports surrounding the retrieval and preservation of bodies from crashed UFOs. When a UFO supposedly crashed outside the town of Roswell, New Mexico in July, 1947, rumor quickly spread that the wreckage - as well as the remains of several alien beings who had been onboard the ill-fated craft - was quickly gathered up by the military, put on the back of a flatbed truck and hauled away. Within hours - at the most several days - the ship and the badly-burned aliens - were then supposedly flown to Wright-Patterson Air Force Base for scientific analysis and research purposes. Speculation that a mysterious building known as &quot;Hangar 18&quot; might contain the remains of these small, gray-colored, extraterrestrials and their vehicle has remained constant over the years. Supposedly, there have been other crash landings in addition to the one at Roswell, and whatever was found - wreckage and bodies - ended up stored in this facility near Dayton, Ohio. Such accounts have been fueled by the fact that the Air Force's various UFO projects (including its most famous Project Blue Book) have been headquartered at this base. In addition, there have been many bizarre tales told by various retired military personnel who, while stationed at Wright-Patterson insist they &quot;stumbled&quot; upon the &quot;truth&quot; when they saw with their own eyes what they couldn't at first believe, and which they were later told to shut up about by their superior officers. Way back in 1954, the author also tried to get onto Wright-Patterson Air Force Base and was turned away. Over the years, he would drop in periodically at the Pentagon in Washington to interview whoever was in charge of releasing UFO information to the public. Were pictures of aliens inside the book really taken inside Wright-Patterson Air Force Base's notorious &quot;Hangar 18&quot; that has been off limits for over 40 years? Why is it that even Senator Barry Goldwater - who holds a Top Secret security clearance - has been unable to enter the mysterious &quot;Blue Room&quot; where the bodies of several space aliens are believed to be preserved in a specially built chamber? UFO Crash Secrets is a personal account of an investigation into UFOs by the author and the bizarre stories he stumbled upon. 100 pages, many pictures. A must read for everyone.\n","torrent":{"xt":"urn:btih:4d282399bc1348df93e7cfe79e5a70e3c817ef92","amp;dn":"Moseley-UFO+Crash+Secrets+at+Wright+Patterson+Air+Force+Base%28199","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4d282399bc1348df93e7cfe79e5a70e3c817ef92","infoHashBuffer":{"type":"Buffer","data":[77,40,35,153,188,19,72,223,147,231,207,231,158,90,112,227,200,23,239,146]},"announce":[],"urlList":[]}}