{"title":"FiM Complete Season 1 ISOs","uid":8305133,"size":29463151830,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:4daac56c83f8d9d2d626d2ab10fc86141d1f9367&amp;dn=FiM+Complete+Season+1+ISOs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":5,"time":1364349637,"description":"This is the complete Season 1 of My Little Pony: Friendship is Magic.  The official one, with audio commentaries and everything.\n\nI promised myself that once Hasbro/Shout Factory released an official box set for the seasons that I wouldn't put the torrents up anymore, because I feel like people should support the show by buying it.\n\nUnfortunately, the official box sets are still region and DRM locked (currently Region 1 only), so until Shout Factory releases a DVD box set that is region-free, I will have these up for you.\n\nI burned the ISO images of each disc (there are 4 of them) to my computer with a program that automatically removes the DRM and region locks without compromising quality.\n\nWhat this means is that you can take the ISO images from this torrent and either burn them to a dual layer DVD yourself, or download a program like Virtual Clone Drive, that will allow you to mount these images as if they were physical DVDs.\n\nThese are direct 1-to-1 copies of the DVDs, so all the features, including the menus, commentaries, etc. are there.\n\nEnjoy, and please, if you can get the show legally and not through torrenting it, please do so.  I can't stop you of course, but if you can, please support the show.","torrent":{"xt":"urn:btih:4daac56c83f8d9d2d626d2ab10fc86141d1f9367","amp;dn":"FiM+Complete+Season+1+ISOs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4daac56c83f8d9d2d626d2ab10fc86141d1f9367","infoHashBuffer":{"type":"Buffer","data":[77,170,197,108,131,248,217,210,214,38,210,171,16,252,134,20,29,31,147,103]},"announce":[],"urlList":[]}}