{"title":"Asia - Then and Now (Greatest Hits) 1990 [FLAC] - Kitlope","uid":4901097,"size":303602964,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:4db2f63bc595508ace8639028f86aa41d2ccdb3b&amp;dn=Asia+-+Then+and+Now+%28Greatest+Hits%29+1990+%5BFLAC%5D+-+Kitlope&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Kitlope","files":14,"time":1242628724,"description":"File Type: FLAC Compression 6\nCd recorder: Plextor PX-716SA\nCd Ripper: Exact Audio Copy V0.99 prebeta 4\nEAC Log: Yes\nEAC Cue Sheet: Yes\nTracker(s):http://tpb.tracker.thepiratebay.se:80/announce;\nTorrent Hash: 4DB2F63BC595508ACE8639028F86AA41D2CCDB3B\nFile Size: 289.53 Mb\nYear: 1990\nLabel: Geffen\nCatalog #: M2G-24298\n\n\nPlease help seed these FLACs! \n\n\n\n\nFrom Wiki:\n\n\nAsia is a rock group formed in 1981. The band was labelled a supergroup and included former members of veteran progressive rock bands Yes, King Crimson, Emerson, Lake &amp; Palmer, Uriah Heep, U.K., Roxy Music, Wishbone Ash and The Buggles. As of 2008, there are two distinct groups using the Asia name: a reunion of the band's original line-up performing as Asia, and Asia Featuring John Payne featuring three members from later incarnations of Asia.\n\n\nAsia began with the apparent demise of Yes and Emerson, Lake &amp; Palmer, two of the flagship bands of British progressive rock. After the break-up of King Crimson in 1974, various plans for a super group involving bassist John Wetton had been mooted, including the abortive British Bulldog project with Bill Bruford and Rick Wakeman in 1976. In 1977, Bruford and Wetton were reunited in UK, along with guitarist Allan Holdsworth and keyboardist/violinist Eddie Jobson. Their eponymous debut was released in 1978. By 1980, after UK's demise, a new super group project was suggested involving Wetton, Wakeman, drummer Carl Palmer and (then little known) guitarist Trevor Rabin, but Wakeman walked out of the project shortly before they were due to sign to Geffen and before they had ever played together. Rabin, in a filmed interview from 1984 and included in the recently released and updated DVD 9012Live, said that his involvement with this project never went anywhere because &quot;there was no chemistry&quot; among the participants.\n\nIn early 1981, Wetton and Yes guitarist Steve Howe were brought together by A&amp;R man John Kalodner and Geffen Records to start working and writing. They were eventually joined by Carl Palmer, and finally by Howe's recent Yes cohort, keyboardist Geoff Downes. The band's early offerings, under the auspices of Geffen record label head David Geffen and Kalodner, were considered disappointing by music critics[1] and fans of traditional progressive rock, who found the music closer to radio-friendly AOR pop-rock. However, Asia clicked with fans of arena acts such as Journey, Boston, and Styx. Rolling Stone gave Asia an indifferent review[2], while still acknowledging the band's musicianship was a cut above the usual AOR expectations.\n\n\n\nThen and Now 1990\n\n\nThen &amp; Now is an album by the progressive rock band Asia [1]. It was released in 1990 by Geffen Records[2]. Tracks 6-9 are new recordings (&quot;Now&quot;), while the first five tracks and the last one are from earlier releases (&quot;Then&quot;). It dÃƒÂ©buted at number 114 in the United States, and number 24 in Japan. Then &amp; Now was certified Gold by the RIAA on July 23, 1998.\n\n\n\nTracks: \n\n1.\tOnly Time Will Tell (from Asia) \n2.\tHeat of the Moment (from Asia) \n3.\tWildest Dreams (from Asia) \n4.\tDon't Cry (from Alpha) \n5.\tThe Smile Has Left Your Eyes (from Alpha) \n6.\tDays Like These \n7.\tPrayin' 4 a Miracle \n8.\tAm I in Love? \n9.\tSummer (Can't Last Too Long) \n10.\tVoice of America (from Astra) \n\n\nEnjoy :)\n","torrent":{"xt":"urn:btih:4db2f63bc595508ace8639028f86aa41d2ccdb3b","amp;dn":"Asia+-+Then+and+Now+%28Greatest+Hits%29+1990+%5BFLAC%5D+-+Kitlope","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4db2f63bc595508ace8639028f86aa41d2ccdb3b","infoHashBuffer":{"type":"Buffer","data":[77,178,246,59,197,149,80,138,206,134,57,2,143,134,170,65,210,204,219,59]},"announce":[],"urlList":[]}}