{"title":"Michael Martin Murphey - Geronimo's Cadillac (1972) MP3@320","uid":10480880,"size":107642082,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:4de49abe312be7e57384e3d60a5c73c6be73ff21&amp;dn=Michael+Martin+Murphey+-+Geronimo%27s+Cadillac+%281972%29+MP3%40320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"AaronVincent","files":13,"time":1404402383,"description":"Great country-rock/AM-pop from 1972.\n\n\n&quot;Geronimo's Cadillac is the debut album of American singer-songwriter Michael Martin Murphey, released on May 25, 1972 by A&amp;M Records (4358). Recorded at Columbia Recording Studios in Nashville, Tennessee and London, England, the album is considered one of his finest albums. The title track was Murphey's first Top 40 hit, and was also recorded by Cher and Hoyt Axton. The Monkees recorded &quot;What Am I Doing Hangin' 'Round?&quot; in June 1967 for their album Pisces, Aquarius, Capricorn &amp; Jones Ltd.. John Denver recorded &quot;Boy from the Country&quot; in 1980 for his album Some Days Are Diamonds. Geronimo's Cadillac peaked at number 160 on the Billboard 200.&quot;\n\n/Wikipedia\n\n&quot;After all of Michael Martin Murphey's material is taken into consideration, Geronimo's Cadillac comes out on top as one of his finest albums, even though his &quot;cosmic cowboy&quot; persona was yet to be developed. The title track was Murphey's first Top 40 hit, later covered by Cher and Hoyt Axton, while the Monkees eventually sang their own version of &quot;What Am I Doing Hangin' 'Round?&quot; But the most relevant aspect of Geronimo's Cadillac is the fact that it merges Murphey's slight left of center country sound with a little bit of gospel in a few places, giving his material greater depth and a genuine &quot;reflective&quot; quality that was often absent from commonplace country music. Tracks like &quot;Backslider's Wine,&quot; &quot;Calico Silver,&quot; and &quot;Boy From the Country&quot; all contain a unique musical complexion inspired by Murphey's voice and by the simplicity of the harmonica and mandolin. Later albums expose more of Murphey's penchant for being pensive and openly contemplative but, as a debut, Geronimo's Cadillac, with its three parts country to one part AM rock, is an enjoyable album as well as a worthy indication as to what kind of artist Michael Martin Murphey would soon become.&quot;\n\n/Allmusic","torrent":{"xt":"urn:btih:4de49abe312be7e57384e3d60a5c73c6be73ff21","amp;dn":"Michael+Martin+Murphey+-+Geronimo%27s+Cadillac+%281972%29+MP3%40320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4de49abe312be7e57384e3d60a5c73c6be73ff21","infoHashBuffer":{"type":"Buffer","data":[77,228,154,190,49,43,231,229,115,132,227,214,10,92,115,198,190,115,255,33]},"announce":[],"urlList":[]}}