{"title":"Dr Mulholland 2001 (NLsubs)(BlackAnchor) TBS","uid":6043377,"size":4695869006,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:4ebddfea40d7e77efcc090970e45fa2168491b46&amp;dn=Dr+Mulholland+2001+%28NLsubs%29%28BlackAnchor%29+TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Black-Anchor","files":-1,"time":1292456707,"description":"\n\nMulholland Dr. (2001)       \n\nFrankrijk / Verenigde Staten\nMystery / Thriller\n147 minuten\n\ngeregisseerd door David Lynch\nmet Naomi Watts, Laura Harring en Justin Theroux\n\nNederlands:\n\nLiefhebbers van een avondje film, vergeet niet dat er nog tig andere films zijn en die om u aandacht schreeuwen. Kleine pareltjes die veel te goed zijn om in de anonimiteit te verzwelgen.\nDeze film geregisseerd door David Lynch ging in premiÃƒÂ¨re op het Filmfestival in Cannes en werd daar zeer lovend ontvangen. Lynch werd tijdens het festival genomineerd voor Beste Regie, en kreeg later ook een Oscar-nominatie, eveneens voor Beste Regie. \nOm maar meteen met de deur in huis te vallen, Mulholland Drive is een geweldige film. Het is heel fijn dat deze film niet verloren is gegaan, ook al was de film als serie waarschijnlijk nog beter geweest, maar zo was Mulholland Drive per slot van rekening ook oorspronkelijk bedoeld.\nMulholland Drive kent een hyperbolische spanningsboog. De prachtige intrigerende beelden, het sterke spel, en de bizarre gebeurtenissen. De film is als een vuurpijl die heel langzaam stijgt om vervolgens in onverwacht veel kleuren uiteen te spatten. \nAlle personages die overtuigend en sterk worden neergezet, lijken zo uit een andere wereld te zijn gestapt. Ze zijn stuk voor stuk vondsten waarvan je denkt &quot;Hoe heeft Lynch het zo kunnen bedenken?&quot; Hetzelfde geldt voor alle scÃƒÂ¨nes. Elke scÃƒÂ¨ne is bijna een film op zich en elke nieuwe scÃƒÂ¨ne is weer een traktatie voor de kijker. \nGeniet van dit prachtige mysterie dat je 147 minuten lang wordt voorgeschoteld.\nEen stijlvolle brunette wordt aangereden in een limo op het moment dat de bestuurder haar wil ombrengen. \nZij overleeft het ongeluk en strompelt door de Hollywood Hills naar een appartementencomplex waar de naÃƒÂ¯eve wannabe actrice Betty net haar intrek heeft genomen. \nBetty vindt de vrouw die niet meer weet wie zij is op haar bed en helpt haar haar identiteit terug te vinden. Het spoor leidt naar het huis van de verdwenen Diane Selwyn. \nDe twee vrouwen vinden haar onherkenbare lijk in de woning en vanaf dat moment vindt er een wisseling van identiteiten plaats. \n\nEngels:\n\nA bright-eyed young actress travels to Hollywood, only to be ensnared in a dark conspiracy involving a woman who was nearly murdered, and now has amnesia because of a car crash. \nEventually, both women are pulled into a psychotic illusion involving a dangerous blue box, a director named Adam Kesher, and the mysterious night club Silencio.\n\nFrans:\n\nUne jeune femme devient amnÃƒÂ©sique ÃƒÂ  la suite d'un accident de voiture sur Mulholland Drive, la cÃƒÂ©lÃƒÂ¨bre route qui traverse Hollywood. \nElle rencontre une jeune Australienne, et celle-ci va l'aider ÃƒÂ  retrouver son identitÃƒÂ©.\n\n\n\n\n\nSpotinformatie\n \nCategorie    : Beeld \nFormaat      : DVD5 \nBron         : Retail\nAudio        : Engels DD 5.1\nOndertitels  : Nederlands (instelbaar)\nCover        : Ja\nLabel        : Ja\nGenre        : Drama/Mysterie/Thriller\n\n\n\n\n\n  &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0166924/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0166924/&lt;/a&gt; \n &lt;a href=&quot;\nhttp://www.premiere.fr/film/Mulholland-Drive&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.premiere.fr/film/Mulholland-Drive&lt;/a&gt;\n  &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/1011&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/1011&lt;/a&gt;\n\n\n\n\nAangeboden door Jolly Roger  TBS  Black-Sam \n\nBrought to you by Jolly Roger  TBS  Black-Sam\n\nApportÃƒÂ© ÃƒÂ  vous par le Jolie Rouge  TBS  Black-Sam\n","torrent":{"xt":"urn:btih:4ebddfea40d7e77efcc090970e45fa2168491b46","amp;dn":"Dr+Mulholland+2001+%28NLsubs%29%28BlackAnchor%29+TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ebddfea40d7e77efcc090970e45fa2168491b46","infoHashBuffer":{"type":"Buffer","data":[78,189,223,234,64,215,231,126,252,192,144,151,14,69,250,33,104,73,27,70]},"announce":[],"urlList":[]}}