{"title":"Moscow on the Hudson Dvdrip H264 Bookerdog.mp4","uid":4992233,"size":832046791,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4f069c1d87bad58e0d5bf42c32d1ec0b79e556ac&amp;dn=Moscow+on+the+Hudson+Dvdrip+H264+Bookerdog.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bookerdog","files":-1,"time":1247101727,"description":"Category\tComedies, Love Story, Self-Discovery\nStarring\tRobin Williams, Maria Conchita Alonso, Alejandro Rey, Elya Baskin, Cleavant Derricks\nDirector\tPaul Mazursky\nA saxophone player with the Moscow Circus defects in Bloomingdale's while on tour in New York. What follows are a series of serio-comic misadventures of a man's attempt to adjust to his new life in America.\nMOSCOW ON THE HUDSON is a warm and funny story about a Russian defector who sees both the good and bad aspects of his new home in New York City, finding that things are very different from what he expected.\n\nVladimir Ivanoff (Robin Williams) is a Russian saxophone player for the Moscow circus. Life in Russia is difficult and unrewarding, but he silently accepts the corruption of the Communist party and the constant threat of KGB spies because he enjoys his job, has a steady girlfriend, and loves his family. However, his friend Anatoly (Elya Baskin) dreams of freedom in America and makes plans to defect when the circus announces an American tour to New York. Their trip to the Big Apple is thrilling, full of exciting revelations, and on their last day in New York they are allowed 30 minutes to shop in Bloomingdale's, surrounded by tempting American merchandise. While Anatoly loses his nerve, Vladimir is awakened with the desire to defect and manages to outrun the KGB. Suddenly Vladimir is a free man with no family or friends and no chance of ever returning to his homeland. With the help of a Bloomingdale's security guard (Cleavant Derricks) and a pretty Italian makeup counter saleswoman (Maria Conchita Alonso), Vladimir finds a place to stay and a wide variety of odd jobs to start out his new life in the United States. As Vladimir struggles to make it in America, he longs for his family and his homeland, wrestling with the magnitude of his choice. Williams gives an honest and heartfelt performance in this touching and witty comedy by Paul Mazursky.","torrent":{"xt":"urn:btih:4f069c1d87bad58e0d5bf42c32d1ec0b79e556ac","amp;dn":"Moscow+on+the+Hudson+Dvdrip+H264+Bookerdog.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f069c1d87bad58e0d5bf42c32d1ec0b79e556ac","infoHashBuffer":{"type":"Buffer","data":[79,6,156,29,135,186,213,142,13,91,244,44,50,209,236,11,121,229,86,172]},"announce":[],"urlList":[]}}