{"title":"Weekend - Jinx (2013) [FLAC]","uid":8805613,"size":333144768,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:4f300acc2830a8abacce0498966401bdb0303453&amp;dn=Weekend+-+Jinx+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"politux","files":-1,"time":1376323141,"description":"\n  Weekend - Jinx (2013) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Noise Pop, Indie Rock, Alternative\n  Source: CD (log + cue)\n  Codec: FLAC\n  Bit Rate: ~ 1,000 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  01 Mirror\n  02 July\n  03 Oubliette\n  04 Celebration, FL\n  05 Sirens\n  06 Adelaide\n  07 It's Alright\n  08 Rosaries\n  09 Scream Queen\n  10 Just Drive\n\n  The San Francisco trio Weekend's first album, Sports, was a moody blast of noise rock goodness that they followed up with a more nuanced EP, Red, that showed the band had some pop songwriting skills to go with the squalls of guitar overload. Their second full-length, Jinx, does a fine job of combining the noise and pop aspects of their sound while adding a nice amount of post-punk-inspired gloom and shoegaze-fueled energy to the mix to create something that's kinda exciting, kinda bummer, but always thoroughly listenable. Split between songs that have claustrophobic atmosphere with propulsive rhythms and songs with slightly less claustrophobic atmosphere and not quite as propulsive rhythms, the record casts a shadow over the listener that doesn't fully drift away until quite a while after the album is over. With lyrics dealing with sick hearts, lost love, saving girls from the world, fading away, and bowing down, there aren't a lot of chuckles to be found on Jinx. \n\n  The despair and desperation are heightened by the drama of the dynamic tension created by the charging bass, cascading layers of guitars fed through a variety of pedals, and pounding, slightly overloaded drums all crashing together like waves. Against this backdrop, it would be foolish for the vocals to try rising above the surf, so Shaun Durkan does the smart thing and keeps his vocals vague and semi-buried most of the time, only occasionally reaching the surface. All the dark atmosphere, interlocking levels of noise, and bleakly drawn drama might be overpowering if it weren't for the melodies that shine like bands of light breaking through a wall of clouds. Not super-poppy melodies, but definitely strong enough to keep hearts from being crushed and keeping the album out of the uneasy listening category. Songs like &quot;Oubliette,&quot; with its snaky post-punk guitar lines and hooky background vocals, and &quot;It's Alright,&quot; with its stately, almost Cure-feeling pace and swooning chorus, wouldn't sound out of place on a modern indie rock playlist. You could plug any two songs from the record into that sentence and it would work, since the album is so consistent and connected. It's very easy to get lost in the sound and give in to the mood of Jinx, and that's a testament to how good the group has become. You'd have to look hard to find another band making dark and noisy pop as sonically engaging and emotionally satisfying as Weekend do on Jinx. Good luck!","torrent":{"xt":"urn:btih:4f300acc2830a8abacce0498966401bdb0303453","amp;dn":"Weekend+-+Jinx+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f300acc2830a8abacce0498966401bdb0303453","infoHashBuffer":{"type":"Buffer","data":[79,48,10,204,40,48,168,171,172,206,4,152,150,100,1,189,176,48,52,83]},"announce":[],"urlList":[]}}