{"title":"Pino Daniele - Un uomo in blues TQMP","uid":4763117,"size":257484564,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:4fbde3a37514c1eb841c18b9c63b0289d8644a3c&amp;dn=Pino+Daniele+-+Un+uomo+in+blues+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zootallure","files":23,"time":1236772439,"description":"Daniele nasce in una famiglia di gente normale, lavoratrice (suo padre lavorava nel porto di Napoli).\nChitarrista autodidatta, comincio a suonare per e con gli altri artisti nei anni '70, per poi intraprendere la sua strada, confermata dal successo del' album Terra Mia, nel '79. Terra Mia fu un mix tra la tradizione musicale napoletana e blues. Fu da lui definito come &quot;taramblu&quot; una mescola di tarantella, blus e rumba. Non solo la sua inconfondibile voce e il suono della sua chitarra fecero un impatto sul publico, ma anche i testi delle canzoni, scritti e cantati in napoletano con inserzioni in inglese, erano un po' una pillola amara per tutti, parlando delle ingiustizie sociali di Napoli e della societa Italiana in generale.\nSpinto dal successo del primo album, no si fermo, per fortuna, e ancora oggi, 30 anni dopo, ci fa sognare.\nEro presente a un suo concerto a Trieste, saranno 15 anni fa, e devo dire che sono rimasto colpito dalla sua straordinaria personalita e dalle sue canzoni (che gia conoscevo), eseguite dal vivo.\nPino, sei grande!\n\nScaricate gente, scaricate!\n\nDaniele was born in a family of normal, working people (his father worked in the port of Naples).\nA self-taught, guitar player he started to play for and with other artists in 70's, in order then to step on his road, a step confirmed by the success of the album Terra Mia, in the '79. Terra Mia was a mix between the Neapolitan musical tradition and blues. It was defined by him as &quot; taramblu&quot;, a stir of tarantella, blues and rumba. Not only his unmistakable voice and the sound of its guitar made an impact on the public, but also the lyrics, written and sung in Neapolitan with insertions in English, were a bitter pill for all, speaking about the social unjustices of Naples and the Italian society in general.\nEncourgaed from the success of the first album, he continued on his path, fortunately, and still today, 30 years after, he is making us dream.\nI was present at his concert in Trieste, that wasl 15 years ago, and I must say that remained hit from its extraordinary personality and from his songs performed live.\nPino, you are great!\n\nBrought to you by TQMP. (The Quality Music Project)\n\nIn this project we, fellow pirates share only quality items out of our CD collections in lossless FLAC and include covers, especially for those who like to burn and print and put it in a nice and shiny jewelcase. Well, you all know the drill :)\n\nRipped by Exact Audio Copy V0.99 from 01-23-2008, encoded to FLAC\nGet Your Free Copy of the EAC and FLAC suite at:\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/\n\nPlease feel free to join the TQMP project!\nThe &quot;rules&quot; are simple: Rip your CD (no 1980's cassettetapes or vinylrips please!) in lossless format AND include artwork. Include cue- and logfiles for the purists and the TQMP searchtag in your title, so it can easily be found. (Yes, on Google as well..)\n\n\nSay Ã‚Â»thank youÃ‚Â« by seeding... just seed, it is not harmful to your health","torrent":{"xt":"urn:btih:4fbde3a37514c1eb841c18b9c63b0289d8644a3c","amp;dn":"Pino+Daniele+-+Un+uomo+in+blues+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4fbde3a37514c1eb841c18b9c63b0289d8644a3c","infoHashBuffer":{"type":"Buffer","data":[79,189,227,163,117,20,193,235,132,28,24,185,198,59,2,137,216,100,74,60]},"announce":[],"urlList":[]}}