{"title":"Dungeoncorp - DOCR - Apr 03, 2016 - Jayden Jaymes","uid":15040745,"size":441453333,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:504c4dd3d18bad5a87dcd3ef7f7af4857e24c523&amp;dn=Dungeoncorp+-+DOCR+-+Apr+03%2C+2016+-+Jayden+Jaymes&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"merzedes","files":281,"time":1466618080,"description":"&quot;Tied and Used by Reno&quot; \r\n Dungeon of Cum : Redux\r\n Kayla Paige\r\n\r\n Mp4 480p + Pics \r\n\r\n This week we bring Kayla Paige to The Dungeon. Kayla has been around the business for a while and has been featured on our other DungeonCorpÃ‚Â© sites. But, it's been awhile since we've seen her and she's never been on Fucking Dungeon, so we were really excited to have her. Ms. Paige is a brown haired beauty with a fantastic body and she enjoys bondage. This weeks Master is Reno so we knew we were in for a great shoot... As we witness Kayla bound in heavy rope to the steel bench, Master Reno enters with the flogger and begins to flail away at Kayla's milky white ass and smooth pussy. After he works her into a foaming frenzy, he grabs the magic wand and vibes her to a whimpering orgasm. With her guard down, she is then mounted and fucked by her Master before he walks away... Now Kayla hangs delicately from the ceiling. Her legs above her head in wooden stocks. Reno enters and immediately fills Kayla's cunt again with his cock before he fills her mouth with his as he eats her pussy. Not quite sure which hole he prefers, Reno samples between Kayla's cunt and mouth until he has had enough for the moment and leaves her to struggle and dangle midair... Next, Kayla is gagged and hogtied to a wooden cube. As Master Reno mounts her from behind, Kayla gasps loudly through her gag. Her gag is then removed and her mouth muffled by her Master's cock briefly before he re-enters her from behind and pounds her into another orgasm just before he force feeds her his massive load\r\n\r\n Screens\r\n \nhttp://www.dungeoncorp.com/u...s16/DRE/KAY_110707/index.php\r\n\r\n Uploaded by Merzedes and Shallow2\r\n\r\n 21 000 Femdom/BDSM/Fetish torrentuploads since 2004, including almost everything from Kink/Intersect.\r\n\r\n Just keep on leaving us nice comments below and we are happy for the next 20k:)\r\n\r\n Also, a huge thanks to Kink.com for making the videos we all love (and Intersect and all the others too ofcourse). Keep up the awesome work!!!\r\n\r\n Any Questions ?? Read our FAQ!!\r\n \nhttps://yuq.me/users/23/079/W2kwa6hEeP.png\r\n \nhttps://s16.postimg.org/rxyfm...llow2_FAQ_The_Pirate_Bay.jpg\r\n\r\n Cheers :-)","torrent":{"xt":"urn:btih:504c4dd3d18bad5a87dcd3ef7f7af4857e24c523","amp;dn":"Dungeoncorp+-+DOCR+-+Apr+03%2C+2016+-+Jayden+Jaymes","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"504c4dd3d18bad5a87dcd3ef7f7af4857e24c523","infoHashBuffer":{"type":"Buffer","data":[80,76,77,211,209,139,173,90,135,220,211,239,127,122,244,133,126,36,197,35]},"announce":[],"urlList":[]}}