{"title":"Sexually Broken--Exotic Mahina Zaltana mercilessly dicked Matt W","uid":8989675,"size":690688421,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:508ceb04544c1711172b35f96d3b0111d9d6765c&amp;dn=Sexually+Broken--Exotic+Mahina+Zaltana+mercilessly+dicked+Matt+W&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"merzedes","files":-1,"time":1380756793,"description":"\nExotic Mahina Zaltana is mercilessly dicked down, massive squirting orgasms &amp; ruthless blow jobs!! | Mahina Zaltana | Matt Williams\n\nOctober 2, 2013 \n\n\nMP4 only. \n\n \nMahina Zaltana comes across as quiet when you first meet her, but once you get some rope on her lush curves and throw some dick into her, she transforms into an out of control sexual beast. We like out of control sexual beasts around here on the Sexuallybroken stage and know exactly what to do with them.\n\nMahina is bound on our well-used bed in a classic &quot;fuck me&quot; position with a twist-her mouthpussy is wedged between the iron bars of the railing so that she can not turn her head away or escape from what is coming her way. And what is coming her way is massive amounts of cock. A neck rope holds her firmly in place and provides just the right amount of simulation. We just walk up and thrust down balls deep into her wide open mouth. Just to make it challenging we bring the world's most powerful vibrator with us. The Celebrator focuses all of its intense simulation directly on the clit, and the results are instant, epic and undeniable-Mahina helplessly squirts puddles all over herself. There is nothing she can do to stop the orgasms flowing out of her over-simulated pussy.\n\nHer moans of pleasure inspire us and now that she is properly warmed up we swiftly get onto the bed to use her other end. Her squirt provides endless amounts of natural lube and we simply slide in. The deeper the dick goes in, the more she moans in pleasure. Mahina is a fun little fucktoy to have around. We fuck her until her teeth are rattling in her head and her eyes are misted over.\n\nBack and forth, we go, performing a merciless rampage on her holes, as Mahina drops deeper and deeper into sexual subspace. Just to really drive the point home, we bring another vibrator onto the stage and throw that at her as well. She completely checks out. By the time we are done with her, we don't even need the bondage to hold her in place. Mahina is a glassy-eyed lump of well-fucked flesh lying in a puddle of her own squirt. She couldn't move if her life depended on it. Sexuallybroken 1, Porn Star 0. \n\nScreens &lt;a href=&quot;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/10_02mzaltana2/SexuallyBroken-Mahina-Zaltana-Matt-Williams-Exotic-Mahina-Zaltana-is-mercilessly-dicked-down-massive-squirting-orgasms--ruthless-blow-jobs.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/10_02mzaltana2/SexuallyBroken-Mahina-Zaltana-Matt-Williams-Exotic-Mahina-Zaltana-is-mercilessly-dicked-down-massive-squirting-orgasms--ruthless-blow-jobs.php&lt;/a&gt;\n\n12 000 uploads and counting, 13k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n\n","torrent":{"xt":"urn:btih:508ceb04544c1711172b35f96d3b0111d9d6765c","amp;dn":"Sexually+Broken--Exotic+Mahina+Zaltana+mercilessly+dicked+Matt+W","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"508ceb04544c1711172b35f96d3b0111d9d6765c","infoHashBuffer":{"type":"Buffer","data":[80,140,235,4,84,76,23,17,23,43,53,249,109,59,1,17,217,214,118,92]},"announce":[],"urlList":[]}}