{"title":"Belladonnas Buttface 3 (NEW 2014 Evil Angel) [DVDRip]","uid":9595632,"size":2175260595,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:51979feb1c0c27051d17c50c533b85d5c0ad65b5&amp;dn=Belladonnas+Buttface+3+%28NEW+2014+Evil+Angel%29+%5BDVDRip%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":8,"uploader":"chkm8te","files":2,"time":1392005999,"description":"Belladonnas Buttface 3 (NEW 2014 Evil Angel) [DVDRip]\n\nDana DeArmond, London Keyes, April O'Neil, Vicki Chase, Lia Lor, Sovereign Syre, Gabriella Paltrova, Phoenix Askani\n\nMy butt, your face! That's the rallying cry of the ass-obsessed lesbian sweethearts in director Aiden Riley's newest celebration of rimming, face sitting, smothering, fingering and girl-girl anal intimacy, Belladonna's Butt Face Three. Running well over six hours, this epic adventure in backdoor kink is unladylike in the extreme. The eight gorgeous girls Aiden has paired up for various perversions are eager and experienced with the complexities of same-sex anal lust. Dressed in skin-tight metallic Lycra, stunning Gabriella Paltrova and leggy Dana DeArmond enjoy every variety of sphincter worship, fart chasing and foot play. Brunette beauty April O'Neil removes her sweater and knee socks to seduce the camera with her sheer panty-clad ass and big natural tits; blonde babe Lia Lor spreads her firm buttocks to stroke her anus, emitting queefs of excitement. The lovely ladies afternoon of lesbian passion leaves them thoroughly satisfied. Petite American-Latina cutie Vicki Chase squeezes a butt plug from her anus using only her talented ass muscles, then joins curvaceous Asian bombshell London Keyes for kissing and wanton probing of sensitive orifices. Vicki and London grind together, even going ass-to-ass with a double-ended glass toy! Pale, thick-assed Sovereign Syre and slender Phoenix Askani go into action: pussy licking, analingus, ass smothering and scissor-style grinding are a few of their favorite things. Loaded with tons of behind-the-scenes conversation and revealing interviews, Belladonna's Butt Face Three is a truly breathtaking look at eight butt-blessed babes.\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=vynsp9h6s5tms0ymszp6.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=vynsp9h6s5tms0ymszp6.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=afkdicxff0g0nl58lihj.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=afkdicxff0g0nl58lihj.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:51979feb1c0c27051d17c50c533b85d5c0ad65b5","amp;dn":"Belladonnas+Buttface+3+%28NEW+2014+Evil+Angel%29+%5BDVDRip%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"51979feb1c0c27051d17c50c533b85d5c0ad65b5","infoHashBuffer":{"type":"Buffer","data":[81,151,159,235,28,12,39,5,29,23,197,12,83,59,133,213,192,173,101,181]},"announce":[],"urlList":[]}}