{"title":"Six-Legged Soldiers: Using Insects as Weapons of War {BBS}","uid":6783469,"size":6056032,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:522c0413ea82f8710e44120e19d5b25ad930bdf9&amp;dn=Six-Legged+Soldiers%3A+Using+Insects+as+Weapons+of+War+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1319999353,"description":"In Six-Legged Soldiers, Jeffrey A. Lockwood paints a brilliant portrait of the many weirdly creative, truly frightening, and ultimately powerful ways in which insects have been used as weapons of war, terror, and torture. He concludes with a critical analysis of today's defenses--and homeland security's dangerous shortcomings--with respect to entomological attacks.\nBeginning in prehistoric times and building toward a near and disturbing future, the reader is taken on a journey of innovation and depravity. Lockwood, an award-winning science writer, begins with the use of &quot;bee bombs&quot; in the ancient world and explores the role of insect-borne disease in changing the course of major battles, from Napoleon's military campaigns to the trenches of World War I. He explores the horrific programs of insect weaponization during World War II: airplanes designed to drop plague-infested fleas, facilities rearing tens of millions of crop-devouring beetles, and prison camps where doctors tested disease-carrying lice on inmates. The Cold War saw secret government operations involving the mass release of specially developed strains of mosquitoes on an unsuspecting American public--along with the alleged use of disease-carrying and crop-eating pests against North Korea and Cuba. Lockwood reveals how easy it would be to use insects in warfare and terrorism today, pointing to how domestic eco-terrorists in 1989 extorted government officials and wreaked economic and political havoc by threatening to release the notorious Medfly into California's crops.\nA remarkable story of human ingenuity--and brutality--Six-Legged Soldiers is the first comprehensive look at the use of insects as weapons of war, from ancient times to the present day.\n\n400 Pages\n\nOxford 2009","torrent":{"xt":"urn:btih:522c0413ea82f8710e44120e19d5b25ad930bdf9","amp;dn":"Six-Legged+Soldiers%3A+Using+Insects+as+Weapons+of+War+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"522c0413ea82f8710e44120e19d5b25ad930bdf9","infoHashBuffer":{"type":"Buffer","data":[82,44,4,19,234,130,248,113,14,68,18,14,25,213,178,90,217,48,189,249]},"announce":[],"urlList":[]}}