{"title":"The Sex Education Show 2009 Season2","uid":4825066,"size":1452514240,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:527f263214cc26bf1abdeacd10af0624270e08b7&amp;dn=The+Sex+Education+Show+2009+Season2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"eXoflow","files":5,"time":1238915585,"description":"NOTE: This is NOT porn, it is a sex education show broadcasted by Channel 4.\n----------------------------------------------------------------------------\n\nThe Sex Education Show, Season 2 (complete: 4 episodes)\nChannel 4, 2009\n\nEpisode Summary: Series 2, Episode 1\nAnna Richardson and a team of sexual health experts visit secondary schools, beginning in Norfolk, to provide pupils with sex education lessons and explore the access that young people have to pornography on computers and mobiles. She also meets 21-year-old adult-film actor Damian Duke, who talks about the reality of the industry. Continues tomorrow.\n\nEpisode Summary: Series 2, Episode 2\nAnna Richardson gives Bristol schoolchildren a live anatomy lesson focusing on the male body. Later, she discovers whether easy access to risque material has led to the ÃƒÂ¶pornificationÃƒÂ¶ of the high street. Plus, erotic actor Damian Duke exposes some of the more unsavoury practices of the adult film industry.\n\nEpisode Summary: Series 2, Episode 3\nAnna Richardson and a team of sexual health experts travel to an inner-city London school to teach students about male and female arousal and using condoms. They discuss the pressures of having sex before a person is emotionally ready, and investigate how pornography in its many guises is influencing fashion and beauty. Plus, porn actor Damian Duke reveals how he struggles to make a living and is prepared to act gay for pay .\n\nEpisode Summary: Series 2, Episode 4\nGrammar school students witness male and female STI screening in anatomy lessons, learn how to protect themselves from infection and are given information about sex and the law. Plus, Anna Richardson meets women who have chosen careers in pornography, and reveals the unsafe sexual practices that have left porn actor Damian Duke and his girlfriend Donna Derriere with a host of problems.","torrent":{"xt":"urn:btih:527f263214cc26bf1abdeacd10af0624270e08b7","amp;dn":"The+Sex+Education+Show+2009+Season2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"527f263214cc26bf1abdeacd10af0624270e08b7","infoHashBuffer":{"type":"Buffer","data":[82,127,38,50,20,204,38,191,26,189,234,205,16,175,6,36,39,14,8,183]},"announce":[],"urlList":[]}}