{"title":"Cohen-Decadence of Shamans-Secrets of Communism(1992)","uid":5978865,"size":5544872,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:52ee90dd361769017e42df542f4dbd9c2790fddf&amp;dn=Cohen-Decadence+of+Shamans-Secrets+of+Communism%281992%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"red_gonzo","files":1,"time":1290533026,"description":"This is Alan Cohen's amazing booklet Decadence of the Shamans Or Shamanism as a Key to the Secrets of Communism (1992) which questions the assumption that the present social order has completed the mapping of reality as it used to be understood by the ancients. Originally written for an academic conference held in Helsinki in May 1990: the International Association for the History of Religion regional conference on northern and circumpolary religions. Yet the author didn't write it exclusively for an academic audience as those who were interested in the text at the conference were precisely those who, for one reason or another, find themselves on the margins of mainstream university thinking. This was no surprise. The text is written essentially for those who, in the manner the manner of the shamans, 'walk between worlds' - for those who question the assumption that the present social order has completed the mapping of reality; those who may have had fleeting glimpses of other realities, but who are dissatisfied with or downright hostile to the woolly speculations of New Age philosophies; those who have understood that the revolution of tomorrow will create a new poetry; those who seek a convergence of hidden truths. Decadence of the Shamans will provide such explorers with a starting point, a framework for discussion. 45 pages, few pictures. A must read for everyone.\n","torrent":{"xt":"urn:btih:52ee90dd361769017e42df542f4dbd9c2790fddf","amp;dn":"Cohen-Decadence+of+Shamans-Secrets+of+Communism%281992%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"52ee90dd361769017e42df542f4dbd9c2790fddf","infoHashBuffer":{"type":"Buffer","data":[82,238,144,221,54,23,105,1,126,66,223,84,47,77,189,156,39,144,253,223]},"announce":[],"urlList":[]}}