{"title":"Alan Moore &amp; Alan Davis - Captain Britain [CBR]","uid":4906731,"size":34600864,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:552bcafc6fe647f78874ea96173d2ffd1b369104&amp;dn=Alan+Moore+%26+Alan+Davis+-+Captain+Britain+%5BCBR%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ill88eagle","files":-1,"time":1242933822,"description":"Alan Moore &amp; Alan Davis - Captain Britain [CBR]\n\n&quot;As Author Alan Moore states in his introduction, the stories in this book are from VERY early on in the careers of himself and Artist Alan Davis, but they hold up remarkably well. The basic story will be familiar to longtime comic fans: Hero is thrown into an alternate reality, must face a megomaniacal madman, etc.; What's so cool about Captain Britain is that this story was published over TWENTY YEARS AGO, so all of the similar stories we're more familiar with (Crisis on Infinite Earths, X-Men's Days of Future Past, even Moore's &amp; Davis'own Miracleman)had their genesis here.\nThe book gets off to a head-scratching start; We're thrown into the closing chapters of a long-running story-arc that Moore &amp; Davis had the misfortune of inheriting, but they do an amazing job of not only making the complex story and characters accessible, but actually making them interesting. Moore starts by killing Captain Britain, and rebuilding him from the ground up, as he would later do with DC's Swamp Thing. By the third or fourth chapter, Moore &amp; Davis have hit their stride, and are beginning to impart their own voices on the book. Part of the fun is seeing how fast Moore and Davis grow as creators; Moore learns that sometimes silence can be just as powerful as words, and Davis becomes a confident, masterful storyteller in his own right. By the time I finished the book, I felt like I had just discovered a long-hidden masterpiece.&quot;\n\n- Daniel V. Reilly @ http://www.amazon.com/Captain-Britain-TPB-Alan-Moore/dp/0785108556","torrent":{"xt":"urn:btih:552bcafc6fe647f78874ea96173d2ffd1b369104","amp;dn":"Alan+Moore+%26+Alan+Davis+-+Captain+Britain+%5BCBR%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"552bcafc6fe647f78874ea96173d2ffd1b369104","infoHashBuffer":{"type":"Buffer","data":[85,43,202,252,111,230,71,247,136,116,234,150,23,61,47,253,27,54,145,4]},"announce":[],"urlList":[]}}