{"title":"Remcom XFDTD 7.3.0.3 (XF7) [Re-Upload]","uid":9796079,"size":295564980,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:55de084a51608d5d5c4b25f3d7a8c367fd352b24&amp;dn=Remcom+XFDTD+7.3.0.3+%28XF7%29+%5BRe-Upload%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"LS187","files":-1,"time":1395321514,"description":"Re-upload since the previous ones were messed up. \n\n\nDecompress .7z file . . install software and licensing. run program ... select license from  License folder that is in the install directory .. license.lic ...  select for that window to not pop up every time software is executed. enjoy. \n\n\n\n\n\nPower, Speed, and Usability: Remcom's Market-leading EM Solver\n\nXFdtd Release 7 (XF7) is the market's most modern 3D electromagnetic simulation software for FDTD-based modeling and simulation. ItÎ“Ã‡Ã–s tremendously fast by leveraging NVIDIAÎ“Ã‡Ã–s most advanced CUDA-enabled GPUs. And itÎ“Ã‡Ã–s easy to use and engineered to replicate real-world processes.\n\nKey benefits of XF7 3D Electromagnetic Simulation Software include:\n\n    XStream GPU Acceleration for CPUs and GPU clusters enables calculations to finish in minutes as compared to hours. Use XStream with the GPUs in a single computer or link multiple GPU clusters in parallel via MPI + GPU technology for massive EM calculations.\n    Unlimited Memory support for problems exceeding 60 GB and billions of cells.\n    External Queue Integration (EQI) allows XFdtd users in HPC environments to submit/queue their simulations directly to the compute cluster through the user interface.\n    XACT Accurate Cell Technology resolves the most intricate designs with fewer computational resources.\n    CAD Merge seamlessly integrates new versions of CAD and PCB designs into existing projects.\n    XTend Script Library automates modeling and design with pre-loaded, customizable scripts for creating custom features.\n    First 3D EM solver in the industry to run natively on Windows, Mac OS X, and Linux\n    Guided modeling processes, editable modeling history, ability to edit imported CAD files\n    Intelligent, ultra-fast meshing expedites previewing of finished meshes prior to simulation.\n    Dynamic and interactive graphing allows results to be viewed and automatically updated as data changes.\n    Customizable Results Browser with filtering and search tools\n","torrent":{"xt":"urn:btih:55de084a51608d5d5c4b25f3d7a8c367fd352b24","amp;dn":"Remcom+XFDTD+7.3.0.3+%28XF7%29+%5BRe-Upload%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"55de084a51608d5d5c4b25f3d7a8c367fd352b24","infoHashBuffer":{"type":"Buffer","data":[85,222,8,74,81,96,141,93,92,75,37,243,215,168,195,103,253,53,43,36]},"announce":[],"urlList":[]}}