{"title":"Motorhead - Iron Fist (2nafish)","uid":5812460,"size":99127300,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:563d52542294a483a301696b85b7c3ce91653aa4&amp;dn=Motorhead+-+Iron+Fist+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1283697646,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Iron Fist&quot; is a song by the heavy metal band MotÃƒÂ¶rhead. It was released as a single in 1982, in 7&quot; pressings in blue, black and translucent red vinyl.\n\nThe title track on the single is covered with (B-side's) &quot;Remember Me, I'm Gone&quot;, which appears on CD re-issues of the Iron Fist album. In Spain, the title track was put on the B-side of &quot;Go to Hell&quot; and was issued with a picture sleeve of the band dressed as warriors in skull masks.\n\nThis is the last single featuring the classic MotÃƒÂ¶rhead line-up of Lemmy, &quot;Fast&quot; Eddie Clarke and &quot;Philthy Animal&quot; Taylor, as Clarke left following the recording of the Stand By Your Man EP.\n\nOn March 27, 1982, Lemmy, Clarke and Taylor were interviewed by Tommy Vance on BBC Radio 1's 'Rock On Saturday' show, &quot;Iron Fist&quot;, &quot;Loser&quot;, and &quot;Speed Freak&quot; were played.\n\nIron Fist is the fifth album by the British band MotÃƒÂ¶rhead. Released on 17 April 1982, it peaked at #6 on the UK album charts. It was preceded by the release of the title track &quot;Iron Fist&quot; as a single on 3 April, which peaked in the UK singles chart at #29. It was the final album to be recorded by the Lemmy, Eddie Clarke and Phil Taylor line-up.\n\nMotÃƒÂ¶rhead is a British rock band formed in 1975 by bassist, singer and songwriter Ian Fraser Kilmister, known mostly by his stage name Lemmy, who has remained the sole constant member. The band pre-dated, but are sometimes regarded as part of, the New Wave of British Heavy Metal, which re-energised heavy metal in the late 1970s and early 1980s. Usually a power trio, MotÃƒÂ¶rhead had particular success in the early 1980s with several successful singles in the UK Top 40 chart. The albums Overkill, Bomber, Ace of Spades, and particularly No Sleep 'til Hammersmith, cemented MotÃƒÂ¶rhead's reputation as one of Britain's foremost rock bands.\n\nMotÃƒÂ¶rhead are typically classified as heavy metal, and their fusion of punk rock into the genre helped to pioneer speed metal and thrash metal. Lemmy dislikes such labels, preferring to describe the band's music simply as &quot;rock n' roll&quot; and usually opening live shows with the line &quot;We are MotÃƒÂ¶rhead. We play rock and roll.&quot;. MotÃƒÂ¶rhead's approach has remained the same over the band's career, preferring to play what they enjoy and do best; their appreciation of early rock and roll is reflected in some of their occasional cover songs. MotÃƒÂ¶rhead's lyrics typically cover such topics as war, good versus evil, abuse of power, promiscuous sex, substance abuse, and &quot;life on the road&quot;. The band's distinctive fanged-face logo, with its oversized boar's horns, chains, and spikes, was created by artist Joe Petagno in 1977 for the cover of the MotÃƒÂ¶rhead album and has appeared in many variations on covers of ensuing albums. The fanged face has been referred to variously as &quot;War-Pig&quot; and &quot;Snaggletooth&quot;. The band is ranked number 26 on VH1's 100 Greatest Artists of Hard Rock.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:563d52542294a483a301696b85b7c3ce91653aa4","amp;dn":"Motorhead+-+Iron+Fist+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"563d52542294a483a301696b85b7c3ce91653aa4","infoHashBuffer":{"type":"Buffer","data":[86,61,82,84,34,148,164,131,163,1,105,107,133,183,195,206,145,101,58,164]},"announce":[],"urlList":[]}}