{"title":"[FemaleAgent] Tracy Delicious &amp; Daphne (f1291 / 03.03.2015)","uid":11732712,"size":794577234,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:56a5eab7c52ea625fa489755e8f7c05edb72b188&amp;dn=%5BFemaleAgent%5D+Tracy+Delicious+%26amp%3B+Daphne+%28f1291+%2F+03.03.2015%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"chkm8te","files":1,"time":1425446230,"description":"[FemaleAgent] Tracy Delicious &amp; Daphne (f1291 / 03.03.2015)\n\nDaphne (36 mins). I was just finishing up for the day when there was a knock on my door and a very pretty woman came in and asked if she could clean my office. I had never met this cleaning lady before and she was so horny looking that I could feel my panties begin to moisten. As I watched her bend over to clean the shelves I decided to see if I could get this beautiful woman naked on my couch. I asked her how much she money she earned cleaning, then got her to sit down as I wanted to offer her modelling work. She had been to a casting before and funnily enough it was to do solo erotic modelling, but she had got no work from it. I told her I could get her plenty of work but I needed to see her naked. She stripped off her clothes revealing an amazing pair of pert breasts and an ass that was firm and squeezable. I had to have this woman, she was sending me into lust fever sitting there half naked. She told me that she had in the previous casting done some solo masturbation and I asked her if I could see it too. However she was quite stubborn at this point, saying she had been paid to do it last time so she would not just do it for free. This sexy woman had me, I would have to pay her also, I could not let her leave now without getting a taste of her. I told her I would match the offer and she agreed to do it, but said she would struggle to get an orgasm. I walked over to her and offered to help her with my fingers and tongue. She seemed slightly nervous but she a had a wicked glimmer in the corner of her eye and we were soon kissing and stroking each other as out tongues locked in an embrace. I slid down her body and began to lick her slick, sweet tasting pussy before I sunk some digits deep inside her. It wasn't long before her orgasm hit her as my talented tongue did its work. I then offered her even more money if she would make me orgasm also. She kissed me on my neck, then her my breasts, over my stomach and down to my damp pussy. With a little coaching she soon had her tongue and fingers working my pussy beautifully and my own orgasm hit me like a firework, all of my nerve cells in my body were tingling. I may have to work late some more and see what the other cleaning staff are like around here.\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=mqheotdno9q0ib01y77a.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=mqheotdno9q0ib01y77a.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=5o3dhp6elihjfuzi9wv8.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=5o3dhp6elihjfuzi9wv8.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:56a5eab7c52ea625fa489755e8f7c05edb72b188","amp;dn":"%5BFemaleAgent%5D+Tracy+Delicious+%26amp%3B+Daphne+%28f1291+%2F+03.03.2015%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"56a5eab7c52ea625fa489755e8f7c05edb72b188","infoHashBuffer":{"type":"Buffer","data":[86,165,234,183,197,46,166,37,250,72,151,85,232,247,192,94,219,114,177,136]},"announce":[],"urlList":[]}}