{"title":"Tess of the D'Urbervilles (1998) TV","uid":4701936,"size":947249940,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:56d00cfd0302a77cd83c79ef0408b5d5f459efa7&amp;dn=Tess+of+the+D%5C%27Urbervilles+%281998%29+TV&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"jgordon20904","files":2,"time":1233747726,"description":"Young country girl Tess Durbyfield goes to work for her aristocratic relatives, the D'Urbervilles, in an attempt at helping her family to raise some money. Her cousin Alec falls in love with her and seduces/rapes her. Written by Anonymous \n\nThis made-for-T.V. movie is based very closely on Thomas Hardy's novel. The film stars Teresa &quot;Tess&quot; Derbeyfield, the sinister Alec D'Urbervilles, and the handsome Angel Clair, with the bleak background of rural Victorian England. Follow Tess through her life, starting as a young and naive sixteen-year-old who knows nothing of the world outside her own home. Follow her as she meets people in her search for job that will change her life forever. When she goes to work for a distant relative, Alec, he falls in love with her and seduces her. When she flees to work as a farmhand, she thought she would escape her troubles and have a chance at happiness. There she falls in love with Angel, and he with her. Watch as a dark love story unfolds between an unlikely couple and how poor Tess deals with the tragic events of her life, trying desperately to deal with fragility of her happiness.\n\nMy earlier upload of this movie is not wowrking well. Trying again.\n\njgordon20904\n\n","torrent":{"xt":"urn:btih:56d00cfd0302a77cd83c79ef0408b5d5f459efa7","amp;dn":"Tess+of+the+D%5C%27Urbervilles+%281998%29+TV","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"56d00cfd0302a77cd83c79ef0408b5d5f459efa7","infoHashBuffer":{"type":"Buffer","data":[86,208,12,253,3,2,167,124,216,60,121,239,4,8,181,213,244,89,239,167]},"announce":[],"urlList":[]}}