{"title":"Mega Shark Vs. Giant Octopus (2009)","uid":5200874,"size":731496448,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:56ed821db0917feae208f50d2002f6de663f8bf8&amp;dn=Mega+Shark+Vs.+Giant+Octopus+%282009%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"InternetNinjacy","files":-1,"time":1260154667,"description":"Mega Shark versus Giant Octopus is a disaster film by The Asylum, released on May 19, 2009, in the United States and on August 7, 2009, in the United Kingdom. The theatrical trailer released in mid-May 2009 became a viral hit, scoring over a million hits on MTV.com and another million more onupon launch, prompting brisk pre-orders of the DVD.\n\n\nIt all begins when two scientists accidentally discover a mega shark and giant octopus buried in ice under sea.Now the ice obviously breaks due to a whale collapsing incident which our doctors were in right time to witness by the way on an experimental submarine which they had stolen for exploration. Anyway, soon after these prehistoric creatures are at loose once again, they start hunting for food and bizarre incidents start happening all around the globe like tearing up of an oil rig by our friend octopus and disappearance of an airplane flying at 15000 feet in air at around 200 nautical miles per hour: Courtesy Mega shark.\n\nBefore you download this, you should know. It really is a terrible movie. Worse than most Sci-fi channel movies. Yet, the title alone makes me have to repost it. It's exactly what you think it is. B-list monster movie trash.","torrent":{"xt":"urn:btih:56ed821db0917feae208f50d2002f6de663f8bf8","amp;dn":"Mega+Shark+Vs.+Giant+Octopus+%282009%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"56ed821db0917feae208f50d2002f6de663f8bf8","infoHashBuffer":{"type":"Buffer","data":[86,237,130,29,176,145,127,234,226,8,245,13,32,2,246,222,102,63,139,248]},"announce":[],"urlList":[]}}