{"title":"What We Owe to Each Other - T M Scanlon.pdf","uid":8974825,"size":4380004,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:572dbd54b673182bbe5f5fc5efbc5374852e6d99&amp;dn=What+We+Owe+to+Each+Other+-+T+M+Scanlon.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Agricola","files":-1,"time":1380410628,"description":"What We Owe to Each Other \n\nAuthor - T.M. Scanlon\n\nFormat - pdf\n\nRequested\n\nHow do we judge whether an action is morally right or wrong? If an action is wrong, what reason does that give us not to do it? Why should we give such reasons priority over our other concerns and values? In this book, T. M. Scanlon offers new answers to these questions, as they apply to the central part of morality that concerns what we owe to each other. According to his contractualist view, thinking about right and wrong is thinking about what we do in terms that could be justified to others and that they could not reasonably reject. He shows how the special authority of conclusions about right and wrong arises from the value of being related to others in this way, and he shows how familiar moral ideas such as fairness and responsibility can be understood through their role in this process of mutual justification and criticism.\n\nScanlon bases his contractualism on a broader account of reasons, value, and individual well-being that challenges standard views about these crucial notions. He argues that desires do not provide us with reasons, that states of affairs are not the primary bearers of value, and that well-being is not as important for rational decision-making as it is commonly held to be. Scanlon is a pluralist about both moral and non-moral values. He argues that, taking this plurality of values into account, contractualism allows for most of the variability in moral requirements that relativists have claimed, while still accounting for the full force of our judgments of right and wrong.","torrent":{"xt":"urn:btih:572dbd54b673182bbe5f5fc5efbc5374852e6d99","amp;dn":"What+We+Owe+to+Each+Other+-+T+M+Scanlon.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"572dbd54b673182bbe5f5fc5efbc5374852e6d99","infoHashBuffer":{"type":"Buffer","data":[87,45,189,84,182,115,24,43,190,95,95,197,239,188,83,116,133,46,109,153]},"announce":[],"urlList":[]}}