{"title":"Humble Pie - Fillmore-Complete Recordings [320k MP3]","uid":11262187,"size":590622364,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:57e95358a2dc1aacbfef9b86bab9df05f5506136&amp;dn=Humble+Pie+-+Fillmore-Complete+Recordings+%5B320k+MP3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"smbdownload","files":-1,"time":1413939046,"description":"Performance Rockin' the Fillmore is the 1971 live double-LP/single-CD by English blues-rock group Humble Pie. It reached #21 on the Billboard 200, and hit the UK Top 40.\n\nThis hour-long set boasted only one original song and a handful of cover tunes, beefed up and presented Humble Pie-style. Peter Frampton's guitar playing was at its most melodic and Steve Marriott's vocals are captured here in essence and preserved.\n\n&quot;I Don't Need No Doctor&quot; was the biggest airplay hit from the album (having been issued as a single in edited version, and reaching #73 on the Billboard Hot 100 in October 1971). But some consider the biggest highlight to be the Doctor John cover &quot;I Walk On Gilded Splinters&quot;. It stretches out over almost 25 minutes; one can even hear a bottle drop in the menacing intro.\n\nThe song listed as &quot;Four Day Creep&quot;, and attributed to classic blues singer Ida Cox, bears no melodic or lyrical resemblance to her self-recorded composition of that title. The single version of &quot;I Don't Need No Doctor&quot; was backed with &quot;A Song for Jenny&quot; from the Rock On album, which Marriott wrote for his first wife, Jenny Rylance.\n\nThere is a story that, during the mixing of the album, the band presented what they thought to be the finished product to their manager, Dee Anthony. Upon listening to it, he made one comment: &quot;Great, but where's the audience?&quot; It turned out that Marriott and drummer Jerry Shirley were stoned and had forgotten to include the sound of the audience in the mix - so it was back to the mixing desk.\n\nShortly before the album's release, guitarist Peter Frampton left due to growing friction between Marriott and him. His departure hurt Marriott greatly, though he would never admit it to the other band members.\n\nThe album's steady sales helped Performance: Rockin' the Fillmore to become the band's first RIAA gold record, and its popularity helped the band's previous album, Rock On, to reach gold album status as well.\n\nOn October 29, 2013, Omnivore Recordings released all four sets recorded that weekend as in a four CD set &quot;Performance: Rockin' the Fillmore-Complete Recordings&quot;.\n\nTrack Listing [320k MP3]\n\nDisc 1\n\n1. Four Day Creep (Live At Fillmore East / 5/28/71 1st Show)\t4:36\t\n2. I'm Ready (Live At Fillmore East / 5/28/71 1st Show)\t8:31\t$1.29\t \n3. I Walk On Gilded Splinters (Live Fillmore East / 5/28/71 1st Show)\t26:57\t\n4. Hallelujah (I Love Her So) (Live Fillmore East / 5/28/71 1st Show)\t6:27\t\n5. I Don't Need No Doctor (Live At Fillmore East / 5/28/71 1st Show)\t8:49\n\nDisc 2\n\n1. Four Day Creep (Live At Fillmore East / 5/28/71 2nd Show)\t4:27\t\n2. I'm Ready (Live At Fillmore East / 5/28/71 2nd Show)\t8:57\t$1.29\t\n3. I Walk On Gilded Splinters (Live Fillmore East / 5/28/71 2nd Show)\t26:59\t\n4. Hallelujah (I Love Her So) (Live Fillmore East / 5/28/71 2nd Show)\t5:42\t\n5. Rollin' Stone (Live At Fillmore East / 5/28/71 2nd Show)\t16:47\t\n6. I Don't Need No Doctor (Live At Fillmore East / 5/28/71 2nd Show)\t9:13\n\nDisc 3\n\n1. Four Day Creep (Live At Fillmore East / 5/29/71 1st Show)\t3:54\t\n2. I'm Ready (Live At Fillmore East / 5/29/71 1st Show)\t8:50\t\n3. I Walk On Gilded Splinters (Live Fillmore East / 5/29/71 1st Show)\t26:05\t\n4. Hallelujah (I Love Her So) (Live Fillmore East / 5/29/71 1st Show)\t5:58\t\n5. Stone Cold Fever (Live At Fillmore East / 5/29/71 1st Show)\t6:05\n\nDisc 4\n\n1. Four Day Creep (Live At Fillmore East / 5/29/71 2nd Show)\t3:47\t\n2. I'm Ready (Live At Fillmore East / 5/29/71 2nd Show)\t8:59\t\n3. I Walk On Gilded Splinters (Live Fillmore East / 5/29/71 2nd Show)\t27:33\t\n4. Hallelujah (I Love Her So) (Live Fillmore East / 5/29/71 2nd Show)\t5:43\t\n5. Rollin' Stone (Live At Fillmore East / 5/29/71 2nd show)\t12:20\t\n6. I Don't Need No Doctor (Live At Fillmore East / 5/29/71 2nd Show)\t7:33\n\nReview: One of the world's greatest live albums is now four times greater!\n\nWhen Steve Marriott left the Small Faces (Rock and Roll Hall Of Fame Class of 2012) to launch a new band in 1968, expectations were high. Marriott teamed with 18-year-old guitarist Peter Frampton, already a U.K. star through his work with The Herd, along with bassist Greg Ridley from Spooky Tooth, and 17-year-old drummer Jerry Shirley, who Steve Marriott had used as a session player for Andrew Loog Oldham s Immediate Record Label.\n\nHumble Pie recorded four albums and several singles before achieving its U.S. breakthrough with their 1971 the double-live set Performance: Rockin' The Fillmore. Drawn from four shows played over two consecutive nights at Bill Graham's legendary Fillmore East, Performance captured a red-hot band firing on all cylinders, distilling the crowd-pleasing heavy blues-rock style that had come to dominate the Brit foursome's repertoire, and which would help to lay the foundation for the sound that would soon become known as heavy metal. Performance caught on in a big way with American listeners, hitting #21 on the U.S. album chart and becoming the Pie s first Gold album.\n\nNow, for the first time, Omnivore Recordings has gathered all four shows from Humble Pie's historic Fillmore East stand in this lovingly packaged four-CD box set. No editing or resequencing just the four sets as they were played on May 28 and 29, 1971. The seven tracks that comprised the original album are joined here by 15 previously unissued performances including the never-before-heard complete first set from May 28!\n\nYou may not need no doctor, but you do need Humble Pie's Performance: Rockin' The Fillmore The Complete Recordings","torrent":{"xt":"urn:btih:57e95358a2dc1aacbfef9b86bab9df05f5506136","amp;dn":"Humble+Pie+-+Fillmore-Complete+Recordings+%5B320k+MP3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"57e95358a2dc1aacbfef9b86bab9df05f5506136","infoHashBuffer":{"type":"Buffer","data":[87,233,83,88,162,220,26,172,191,239,155,134,186,185,223,5,245,80,97,54]},"announce":[],"urlList":[]}}