{"title":"[FSX/P3D] ORBX CNK4 parry sound","uid":12055278,"size":162517191,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:5836c27b65940f551a441dd0b165db37626a5739&amp;dn=%5BFSX%2FP3D%5D+ORBX+CNK4+parry+sound&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"kandoit","files":2,"time":1435105606,"description":"\nCNK4 Parry Sound Area Muni happy flying\n\nRelax in heart of the Toronto cottage country! Parry Sound lies on beautiful Georgian Bay, formed when glaciers receded over the mighty Canadian Shield. \n\nWith a moderate climate, thanks to a relatively sheltered sound, the Big Bay can be easily reached and is, daily, by unobtrusive tour boats. A quick \n\nexploration of the town reveals full medical facilities and distinguished schools among other necessary business services, making this town an \n\nattractive place to live and work. Parry Sound, the largest natural harbour on Georgian Bay, was named by &quot;Captain Henry Bayfield&quot; after Sir William \n\nEdward Parry, the Arctic explorer. Bayfield surveyed the 30,000 islands in the early 19th Century. This is a staging point for trips not only to your \n\ncottage near by, but also for countless exploration possibilities of the beautiful French River and Muskoka areas. The Parry Sound Area Municipal \n\nAirport (PSAMA) is located in Seguin Township in the District of Parry Sound. The PSAMA's runway is 4,000' with a 290' by 320' apron and medium-\n\nintensity airfield lighting. The airport has a float plane base located on the 4,000' long Robert's Lake connected to the airport via a private access \n\nroad. The PSAMA is a popular re-fuelling destination for Air Ambulance, Hydro One Helicopters, Ontario Provincial Police, and Search &amp; Rescue. So get \n\nthere by plane or by car, set sail and go!\n\n    Photo real imagery of the airport area\n    Fully custom modeled airport and objects\n    FSX GMAX poly runway and aprons\n    Custom modeled static aircraft\n    Includes most ORBX &quot;Flow&quot; technologies\n    Bonus - CRL8 Roberts Lake Water Aerodrome (Requires FTX Vector for lake features)\n    Located 3 hours drive from Toronto, Ontario, Canada\n    By Vlad Maly\n    Please note  Due to the lack of default vector data in the area, it is recommended that FTX Global Vector is installed to experience CNK4 as it was  \n\n   designed","torrent":{"xt":"urn:btih:5836c27b65940f551a441dd0b165db37626a5739","amp;dn":"%5BFSX%2FP3D%5D+ORBX+CNK4+parry+sound","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5836c27b65940f551a441dd0b165db37626a5739","infoHashBuffer":{"type":"Buffer","data":[88,54,194,123,101,148,15,85,26,68,29,208,177,101,219,55,98,106,87,57]},"announce":[],"urlList":[]}}