{"title":"Yugoslavia - The avoidable war part 1&amp;2","uid":4014830,"size":1219132018,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:588c2cd21416fb85aeb868553696c5dae4e52085&amp;dn=Yugoslavia+-+The+avoidable+war+part+1%262&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Maksimus12031984","files":4,"time":1202304221,"description":"If anyone doubts that it is time for a clear and critical look at Western intervention in the Balkans, consider this: The forces that the US supported in Bosnia and Kosovo were and are closely allied with Osama Bin Laden\\\\\\\\\\\\\\&amp;#039;s al-Qaeda network. Bin Laden, himself, was a regular visitor in the office of Bosnia\\\\\\\\\\\\\\&amp;#039;s President Alija Izetbegovic in early 1993, when the US government was touting his commitment to moderation and multi-ethnic cooperation.\n\n`Yugoslavia: The Avoidable War\\\\\\\\\\\\\\&amp;#039; makes a compelling case that Western backing of separatist forces led directly to the outbreak of war. `The intelligence agencies were unanimous in stating that if you recognize Bosnia, it will blow up,\\\\\\\\\\\\\\&amp;#039; George Kenney of the State Department reveals. Why then did the US proceed to do so sparking four years of savage warfare? How did we end up on the same side as Osama-Bin Laden in Bosnia and Kosovo? Newscasters and columnists continue to refer to Kosovo as a victory for the US, but this documentary shows that the region is infinitely more divided and dangerous than it was when NATO bombing commenced in March of 1999. The region is more unstable and US troops are likely to be stuck in harm\\\\\\\\\\\\\\&amp;#039;s way much longer than originally anticipated. \n\nCould the violent break up of Yugoslavia have been avoided? What role did Western intervention play in the tragedy that consumed the multi-ethnic country? \\\\\\\\\\\\\\&quot;Yugoslavia - The Avoidable War,\\\\\\\\\\\\\\&quot; a 2h 45 min minute film, addresses these questions in a well documented, powerful indictment of misguided intervention in the region. The documentary which took four years to produce, and which was updated following NATO intervention in Kosovo, investigates how serious errors and misjudgements made by Western powers particularly Germany and the United States helped spark the violent break up of the former Yugoslavia in 1991 and continue to destabilize the region in the new millennium.\n\n\\\\\\\\\\\\\\&quot;Yugoslavia the Avoidable War\\\\\\\\\\\\\\&quot; documents the role of Western Intelligence agencies in providing aid to armed separatists and reveals how Western governments supported different sides in an ethnic conflict while portraying themselves as peacemakers. Most compelling are the candid statements of the decision-makers themselves, including former EC Mediator Lord Peter Carrington, former US Secretaries of State James Baker and Lawrence Eagleburger, as well as Germany\\\\\\\\\\\\\\&amp;#039;s former foreign minister, Hans Dietrich Genscher. \\\\\\\\\\\\\\&quot;What the international community(the Europeans), the Americans and UN did, made it sure there was going to be conflict,\\\\\\\\\\\\\\&quot; states Lord Peter Carrington, the EC mediator, who along with UN envoy Cyrus Vance warned against diplomatic recognition of separatists states such as Croatia and Bosnia, before a political settlement could be achieved. \\\\\\\\\\\\\\&quot;US intelligence agencies were unanimous in saying that if we recognize Bosnia it will blow up,\\\\\\\\\\\\\\&quot; says former State Department official George Kenney. Yet, according to former acting US Secretary of State Lawrence Eagleburger, domestic political considerations- the 1992 election campaign between William Clinton and George Bush? led to the tragic decision to recognize Bosnia without a political settlement between the Muslims, Serbs and Croats.\n\nThe film makes a powerful argument that the US drew the wrong lesson of from the Bosnian conflict to justify intervention in the civil war that simmered in Kosovo. The manipulation of news coverage by the warring sides is explored in compelling footage and in interviews with veteran journalists such as David Binder of the New York Times and John MacArthur, columnist and publisher of Harper\\\\\\\\\\\\\\&amp;#039;s Magazine, as well as authors Susan Woodward and Ted Galen Carpenter. The documentary offers powerful evidence of US involvement in \\\\\\\\\\\\\\&quot;Operation Storm\\\\\\\\\\\\\\&quot; the Croatian army\\\\\\\\\\\\\\&amp;#039;s violent expulsion of the ethnic Serbian minority in 1995, an action which offered an eerie parallel with the expulsion of Albanian refugees in Kosovo by Serbian forces following NATO intervention on the side of the Kosovo Liberation Army (KLA).\n\nCompelling, candid interviews from military officers including UN Commanders Sir Michael Rose, Lewis MacKenzie and former Pentagon Chief of Staff General Colin Powell elucidate how Western policymakers blundered by taking sides and by relying on military means to settle political problems. Co-producers of \\\\\\\\\\\\\\&quot;Yugoslavia: The Avoidable War\\\\\\\\\\\\\\&quot; are George Bogdanich New York based documentary film maker and Martin Lettmayer a German television producer based in Munich, who is currently working on a documentary in Central America. An earlier version of the film, completed prior to the Conclusion of NATO\\\\\\\\\\\\\\&amp;#039;s intervention against Kosovo, was named the \\\\\\\\\\\\\\&quot;Best Social Documentary\\\\\\\\\\\\\\&quot; by the New York International Independent Film and Video Festival in September of 1999. In April, the LA Weekly called the film \\\\\\\\\\\\\\&quot;truly accomplished,\\\\\\\\\\\\\\&quot; adding: \\\\\\\\\\\\\\&quot;The numerous Strategic missteps by the West and the endless political doublespeak Are carefully detailed. The tragedy of the situation seems to multiply Before your eyes as the film clearly proves that so much of the Bloodshed could have easily been prevented.\\\\\\\\\\\\\\&quot; ","torrent":{"xt":"urn:btih:588c2cd21416fb85aeb868553696c5dae4e52085","amp;dn":"Yugoslavia+-+The+avoidable+war+part+1%262","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"588c2cd21416fb85aeb868553696c5dae4e52085","infoHashBuffer":{"type":"Buffer","data":[88,140,44,210,20,22,251,133,174,184,104,85,54,150,197,218,228,229,32,133]},"announce":[],"urlList":[]}}