{"title":"Neanderthal Seeks Human (Book #1, Knitting in The City Series)- ","uid":10189801,"size":480182,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5987be13aab861b9a26c63c21bdaf9aa602e261f&amp;dn=Neanderthal+Seeks+Human+%28Book+%231%2C+Knitting+in+The+City+Series%29-+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1400621828,"description":"This is a full-length, 115k word novel and is the first book in the Knitting in the City series.\n\nThere are three things you need to know about Janie Morris: 1) She is incapable of engaging in a conversation without volunteering TMTI (Too Much Trivial Information), especially when she is unnerved, 2) No one unnerves her more than Quinn Sullivan, and 3) She doesn't know how to knit.\n\nAfter losing her boyfriend, apartment, and job in the same day, Janie Morris can't help wondering what new torment fate has in store. To her utter mortification, Quinn Sullivan- aka Sir McHotpants- witnesses it all then keeps turning up like a pair of shoes you lust after but can't afford. The last thing she expects is for Quinn- the focus of her slightly, albeit harmless, stalkerish tendencies- to make her an offer she can't refuse.\n\n**\n\nReview\n\n&quot;It's about time that smart became sexy in the fiction world!&quot; Page Trotter Book Review\n\n&quot;I'm so glad that I picked this book up- it really made my day.&quot; SmexyBooks smexybooks.com\n\n&quot;I laughed out loud constantly while reading this book.&quot; Sexy Book Times sexybooktimes.com\n\n&quot;Why did it have to end!?&quot; Under The Covers Book Blog underthecoversbookblog.com\n\nAbout the Author\n\nABOUT PENNY: \nPenny Reid is a part time author of romantic fiction and completed her first full-length novel (at 115k words...!) in March 2013. When she is not immersed in penning romantic fiction she works full time in the biotech industry as a researcher. She's also a full time mom to two diminutive adults (boy-6 and girl-3), wife, daughter, knitter, crocheter, sewer, general crafter, and thought hijacker.","torrent":{"xt":"urn:btih:5987be13aab861b9a26c63c21bdaf9aa602e261f","amp;dn":"Neanderthal+Seeks+Human+%28Book+%231%2C+Knitting+in+The+City+Series%29-+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5987be13aab861b9a26c63c21bdaf9aa602e261f","infoHashBuffer":{"type":"Buffer","data":[89,135,190,19,170,184,97,185,162,108,99,194,27,218,249,170,96,46,38,31]},"announce":[],"urlList":[]}}