{"title":"Eric Hargett Trio - Steppin' Up (featuring Joey DeFrancesco)","uid":15352302,"size":140158187,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:59bddfa31c1d0acb0b699252658edc90b98045d4&amp;dn=Eric+Hargett+Trio+-+Steppin%27+Up+%28featuring+Joey+DeFrancesco%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"L_Hammond","files":13,"time":1468951614,"description":"Eric Hargett Trio - Steppin' Up (Feat. Joey DeFrancesco &amp; Gerry Gibbs)\r\n\r\nHargett delivers a smoking sax date augmented by jazz organ virtuoso Joey DeFrancesco at the Hammond B-3.\r\n\r\nTrack listing:\r\n01. Steppin' Up (3:59)\r\n02. West (6:02)\r\n03. Hackensack (Feat. Hamilton Price) (3:39)\r\n04. Woody's Dream (4:13)\r\n05. Baretta (6:12)\r\n06. You Don't Know What Love Is (7:18)\r\n07. Brunswick Avenue (5:04)\r\n08. Pacific Voyage (5:43)\r\n09. Myra's Song (6:39)\r\n10. Sunday Fog (8:02)\r\n\r\nTotal Time: 57:16\r\n\r\nPersonnel:\r\n- Eric Hargett, tenor and baritone sax, Moog bass, Fender Rhodes \r\n- Joey DeFrancesco, Hammond B-3 organ, piano\r\n- Gerry Gibbs, drums\r\n\r\n\r\nLabel: Whaling City Sound\r\nReleased: 2016\r\n\r\nMP3 format. 320 kbit/s. All songs are tagged by the book.\r\n\r\n----------\r\n\r\nReview by MWR Blog\r\nOn his debut as a leader, young Eric is really killing it. Strong enough to attract Joey DeFrancesco and Gerry Gibbs as the other 2/3s of his trio, this is a smoking sax date augmented by a smoking B-3 date that comes on like a clash of the titans. With killer jazz flying in all directions, it's like everyone here is playing like they are the Jimi Hendrixes of jazz. Smoking stuff that'll lower your cholesterol and get your blood flowing. Listen to it before your next A1C test if you've been cheating on your carbs. If not, listen to it any way. Hot stuff throughout. \r\n\r\n\r\nReview by Republic Of Jazz\r\nThere's certainly something about the baritone sax that gets your attention. The sounds are commanding; they grab and don't let go. They can throttle. They can lurk. They can dominate the soundscape. In the right hands, it's devastating. Eric Hargett has just those hands.\r\n\r\nOn Steppin' Up, Hargett's remarkable debut as a bandleader, the upstart leader manages to avoid opening night jitters, thanks to a diverse and tasty ten-spot of tunes and the incredible support of Joey DeFrancesco on the B3 and piano, and drummer Gerry Gibbs. Of course, when you've got that kind of seasoned experience behind you, one can only imagine how it'd soothe the nerves.\r\n\r\nRight out of the gate, Hargett, DeFrancesco and Gibbs really bring it. There's the raw and sizzling funk of the title track that kicks things off. There's the hard bop of &quot;Woody's Dream, &quot; which starts in high gear and then shifts into overdrive, led by Hargett's charging bari, and the nifty interplay of his rhythm-mates lifting things to a higher elevation. &quot;Baretta&quot; is an homage to '70s TV theme song funk, with Hargett doing some seriously heavy lifting. There is even a handful of tunes—&quot;West, &quot; &quot;Hackensack, &quot; and &quot;Pacific Voyage, &quot; in particular—in which Hargett puts down the bari and picks up the tenor, with excellent results.\r\n\r\nOn the flip side (not literally), Hargett is not averse to taking it down a notch, smoothing the edges, as he does on his super-tender cover of &quot;You Don't Know What Love Is, &quot; with the B3 laying down a comfortable bed of chord changes and Gibbs urging Hargett with nothing more than sexy brushes. The result is heart-felt, deeply moving … and just the kind of break listeners need in order to jump back into the dirty bari that Hargett serves up for much of the session. The same poignance emerges on the lovely &quot;Myra.&quot; Lucky girl, that Myra, to have such a sweet ode written to her. But lest you start thinking Hargett is hopelessly romantic, check out the closer, &quot;Sunday Fog, &quot; a nasty, virtuosic, locomotive of a piece that will leave you breathless and satisfied.\r\n\r\nHargett hails from Houston, got schooled in Austin, and has since moved to LA. He met up with Gibbs after an invite to play in his Thrasher Big Band back in 2006. Hargett later teamed up with Gibbs' father, the vibist and composer Terry Gibbs, in the master's own Terry Gibbs Dream Band. He has clearly gained some savvy and some sophistication along the way, and it shows up grandly on Steppin' Up. From ballads to burning funk, Hargett proves he can do it all, and this, his first real crack at leadership. He's had some good apprenticeships during his brief career thus far, and he's got A-list support to bring it all home, which is why Steppin' Up is an incredible step in the right direction. \r\n\r\n----------\r\n\r\nL Hammond, The Pirate Bay, where you'll find more jazz organ","torrent":{"xt":"urn:btih:59bddfa31c1d0acb0b699252658edc90b98045d4","amp;dn":"Eric+Hargett+Trio+-+Steppin%27+Up+%28featuring+Joey+DeFrancesco%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"59bddfa31c1d0acb0b699252658edc90b98045d4","infoHashBuffer":{"type":"Buffer","data":[89,189,223,163,28,29,10,203,11,105,146,82,101,142,220,144,185,128,69,212]},"announce":[],"urlList":[]}}