{"title":"Miles Davis - The Legendary Prestige Quintet Sessions CD 4 of 4","uid":4985328,"size":94863848,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:5a19fb581b4f2c03a237f83ef8f2e726eb362890&amp;dn=Miles+Davis+-+The+Legendary+Prestige+Quintet+Sessions+CD+4+of+4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"schon55","files":19,"time":1246636500,"description":"Miles Davis - The Legendary Prestige Quintet Sessions CD 4 of 4\nAudio CD: May 23, 2006 \nOriginal Release Date: May 23, 2006 \nNumber of Discs: 4 \nFormat: Box set, Enhanced, Original recording remastered \nLabel: Prestige\nBitrate: 320 kbps \n\nWhat you get on Legendary Prestige Quintet Sessions is a rather unwieldy four-disc box set (in a longbox; remember those?) containing the complete recordings of the Miles Davis Quintet with Red Garland, Paul Chambers, John Coltrane, and Philly Joe Jones recorded for Prestige, and remastered and repackaged according to chronology rather than release dates from the albums Miles, Workin', Relaxin', Steamin', Miles Davis and the Modern Jazz Giants, and Cookin'.  The fourth disc contains radio and television appearances which have never been released before.  The first four tracks are from the Tonight Show in 1955, with Steve Allen as he gives two different spoken intros that are fine to hear once, but a drag after that (and one wonders what Miles must have thought of them), and result in two quintet performances, &quot;Max Is Making Wax (Chance It)&quot; by Oscar Pettiford and the standard &quot;It Never Entered My Mind. &quot; The six cuts are from different live shows from radio broadcasts of live gigs at the Blue Note in Philadelphia in 1956 and the CafÃƒÂ© Bohemia in New York in 1958.  There are two performances of &quot;Walkin,&quot; one each of &quot;Four,&quot; &quot;Bye Bye Blackbird,&quot; and Dizzy Gillespie's &quot;Two Bass Hit. &quot; In addition, the second portion of disc four is enhanced and contains Miles solo transcriptions that are suitable for printing, two of &quot;Tune Up&quot; (the original version and the one from the Blue Note gig), and &quot;Four&quot; (both the original studio version and one from CafÃƒÂ© Bohemia).  There is also a transcription of the solo played during &quot;Max Is Making Wax (Chance It)&quot; from the Tonight Show.  There is a longbox booklet with a solid essay by Bob Blumenthal and it's full of groovy black-and-white photos.  Miles freaks -- and trumpet players, perhaps -- will have to have this, one supposes.  But as real bonus material designed to get you to buy the original recordings over again, or unless you're an an audiophile, it's rather difficult to discern the upgraded quality of sound, and seems rather pointless.  The high marks are for the music, not the box set itself.  ~ Thom Jurek, All Music Guide\n\nLet me start by saying that I own a few Prestige sets already: Dexter, Sonny, Coltrane, etc.  So when my birthday started coming up, I began researching the Miles set.  I was hesitant about asking people to shell out $125 for the 8-disc &quot;Chronicle&quot; set, or to spend a bunch of time looking for a used copy that looked new.  Imagine my surprise to find this 4-disc set for a fraction of the price! And I only wanted the &quot;good&quot; stuff anyway, right? Perfect! \nFirst impressions after taking it from the Fed Ex guy: the fold-out design like Blue Note used on the Dexter and Herbie sets is waay easier to use one handed when you're changing discs.  It's simple, functional, slim on the shelf, and is something you want to show off - thanks to the elegant cover painting by Miles.  There is the usual overflowing booklet (40 pages) that I've come to expect from Prestige.  It slips nicely inside a holder right in the middle, so it doesn't get all creased to hell when you go to thumb it out as in some previous Prestige sets.  \nNow for the music.  I hate to be the one to say this, but even if you own &quot;Chronicle&quot;, you're going to want/need to pick this set up as well.  The reason is this: only the first 3 discs are the studio recordings.  All tracks on disc 4 are previously UNISSUED!! Tracks 1-4 are from the Tonight Show w/ Steve Allen in '55, 5 &amp; 6 are from the Blue Note in '56, 7-10 are from Cafe Bohemia in '58.  So not only are they &quot;live &amp; rare&quot;, but you get to hear some development as well.  The icing on the cake is that if you pop disc 4 into your pc, you can access Pete Estabrook's transcriptions of 5 Miles solos.  I haven't had a chance to verify this yet, but Prestige claims these are suitable for printing.  \nSo, to recap - excellent packaging, excellent sound, unexpected special features.  If I could give more than 5 stars I would! ~ Benjamin J. Walters\n\nWith this 4CD boxed set, Prestige falls right in line with the outstanding series of Columbia-era Miles Davis boxed sets.  In this case, the label's recordings by what many regard as Miles' first great small group gets freshly remastered and packaged.  Yes, with the exception of the bonus tracks this material has been -- and still is -- available in a number of configurations.  This just happens to be the best attempt yet to organize all of the quintet material (1955-1956) into a one-size-fits-all set.  Furthermore, although the cover artwork could have gone either way -- classic or contemporary -- to good effect, I like the choice to use 1980s-era artwork by Miles himself, which sort of symbolizes the timelessness of the music.  \n\nPutting aside the details of the music itself for a moment, I've always been fascinated by the fact that the majority of the tracks included here were rush-recorded in two marathon sessions, solely aimed at fulfilling Davis' contract with Prestige after he had signed and already begun recording for Columbia (which is why most of the music here was recorded AFTER the earliest sessions on the Sony boxed set THE COMPLETE COLUMBIA RECORDINGS 1955-1961).  For the 1956 dates, Miles basically decided to take his current working group into the studio and in effect play two concerts (sans audience), with one-take run-throughs of his live repetoire.  As happened so often during Miles' career, his unconventional approach resulted in music with an electricity and level of inspiration that stays fresh no matter how many times one listens to it, or how much time has passed since the recording dates.  \n\nAlthough the result is that for the most part no new compositions are performed, that loss is not felt because the focus is less on the songs -- as great as the mix of tunes is here -- than on the personnel.  At the time some questioned Miles' choice of sidemen (reedman John Coltrane, pianist Red Garland, bassist Paul Chambers, and drummer Philly Joe Jones).  Yet what is obvious from every track here is how well the parts quickly came together to produce a greater sum than what might have been predicted beforehand.  The tunes generally fall into two categories: 1) pop standards (including some ballads associated with Frank Sinatra), and updated versions of classic bebop-era compositions.  Lastly, the studio cuts comprise the first three discs, while the fourth CD presents several tv and radio airchecks that are officially released for the first time (more great music, but not quite-as-good sound quality as the brilliantly-recorded studio cuts).  There's some interesting ECD material as well.  Overall this set is a must for first-time buyers and a great way to upgrade for those who already own some or all of this material. ~ J. Lund &quot;jazzbrat&quot;\n\nMiles Davis - The Legendary Prestige Quintet Sessions CD 4 of 4 Tracks:\n01  Steve Allen Intro (11-17-55 The Tonight Show with Steve Allen)\n02  Max Is Making Wax aka: Chance It (11-17-55 The Tonight Show with Steve Allen)\n03  Steve Allen Intro 2 (11-17-55 The Tonight Show with Steve Allen)\n04  It Never Entered My Mind (11-17-55 The Tonight Show with Steve Allen)\n05  Tune Up (12-08-56 The Blue Note, Philadelphia, PA)\n06  Walkin' (12-08-56 The Blue Note, Philadelphia, PA)\n07  Four (5-17-58 Cafe Bohemia, New York, NY)\n08  Bye Bye Blackbird (5-17-58 Cafe Bohemia, New York, NY)\n09  Walkin' (5-17-58 Cafe Bohemia, New York, NY)\n10  Two Bass Hit (5-17-58 Cafe Bohemia, New York, NY)\n","torrent":{"xt":"urn:btih:5a19fb581b4f2c03a237f83ef8f2e726eb362890","amp;dn":"Miles+Davis+-+The+Legendary+Prestige+Quintet+Sessions+CD+4+of+4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5a19fb581b4f2c03a237f83ef8f2e726eb362890","infoHashBuffer":{"type":"Buffer","data":[90,25,251,88,27,79,44,3,162,55,248,62,248,242,231,38,235,54,40,144]},"announce":[],"urlList":[]}}