{"title":"The Hobbit &amp; The Lord Of The Rings (National Public Radio Audio)","uid":4795889,"size":827691373,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:5a9a51de754172fdaf6a0416268ae8566008e606&amp;dn=The+Hobbit+%26+The+Lord+Of+The+Rings+%28National+Public+Radio+Audio%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"ChaoticEvil","files":39,"time":1237878183,"description":"The Hobbit &amp; The Lord of the Rings\nAdapted for radio by Bernard Mayes\nProduced by The Mind's Eye (c)1979\n\nBernard Mayes, founding chairman of National Public Radio in the U.S., apparently wrote adaptations of both The Lord of the Rings and The Hobbit for Mind's Eye. The Lord of the Rings production is said to have been recorded in a bathroom with a microphone taped to a rubber duck. The cast, drawn from local theater performers in Virginia, struggled with the pronuciation of many names and words in the story. Of course, in 1979, most people would have been hard pressed to say Tolkien's names correctly.\n\nThese mythical tales of Middle-earth were bestsellers when they appeared in the 1950s and '60s and are now enjoying a revival of interest including the popular movie LORD OF THE RINGS. These recordings are not readings of Tolkien's novels, but are adaptations of both works for full-cast radio production. If you want all of Tolkien's words, this is not the choice. If you want a full-scale production with sound effects and music, this is a very good choice. While it's difficult to say what a dwarf, an orc, or a wizard should sound like, all of the voices in this production seem entirely appropriate to the characters being portrayed. Some of the sound effects, such as horses endlessly clomping, are repetitive, but in general the sounds add to the sense of atmosphere.\n\nThis version is often confused with the later BBC production in 1981, but is distinguished by the fact that the most widely circulated US edition comes in a wooden box, whether on compact discs or cassette tapes [these tracks are all from cassette tapes]. Because the Mind's Eye cast recorded their tracks separately (unlike the BBC production which, like most British radio serials, assembled the cast to record their dialogue together) this adaptation is often criticised as being inferior to the BBC version in areas such as pronunciation and voice types.\n\nThe story is abridged but includes the portion of the story involving Tom Bombadil. The Battle of the Pelennor Fields is reduced in length. But the lack of sophistication compared to modern computer game and movie soundtracks is probably the most unappealing aspect of the production. It was deliberately constructed to emulate the old style radio dramas of the 1930s through 1950s -- a period which is as remote to most of the Peter Jackson fans today as Middle-earth is supposed to seem to everyone reading Tolkien's book.\n\nThe intended effect is largely lost on a jaded, semi-educated adult audience, but children may still appreciate the simplicity enough to see the story with their minds' eyes.\n\n(Partial) Cast for The Hobbit 1979*\n\nBilbo: Ray Reinhardt\nGandalf: Bernard Mayes\nThorin: Tom Luce\n\nCast for The Lord of the Rings Mind's Eye 1979\n\nBilbo: Ray Reinhardt\nFrodo: James Arrington\nMerry: Pat Franklyn\nPippin: Mac McCaddon\nSam: Lou Bliss\nGandalf: Bernard Mayes\nNarrator: Gail Chugg\nTom Bombadil: Bernard Mayes\nStrider/Aragorn: Tom Luce\n\nAdditional voices provided by Pat Franklyn, Mac McCaddon, Bob Lewis, Gail Chugg, John Vickery, Erik Bauersfeld, Ray Reinhardt, &amp; Carl Hague\n\n*The performers in general are uncredited in The Hobbit, as the sections of the story were not broken down into distinct episodes. Track titles for The Hobbit in this archive were culled from the book's chapters. The recordings do not have chapter titles or cast listings as the LotR section of the archive does.","torrent":{"xt":"urn:btih:5a9a51de754172fdaf6a0416268ae8566008e606","amp;dn":"The+Hobbit+%26+The+Lord+Of+The+Rings+%28National+Public+Radio+Audio%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5a9a51de754172fdaf6a0416268ae8566008e606","infoHashBuffer":{"type":"Buffer","data":[90,154,81,222,117,65,114,253,175,106,4,22,38,138,232,86,96,8,230,6]},"announce":[],"urlList":[]}}