{"title":"Blue Bloods - Temp.1 [HDTV][Cap.104][Spanish][www.nolesvotes.com","uid":6336489,"size":365434880,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:5b5c76c7a2db0f558ad574f2a221ae3ca5965aaf&amp;dn=Blue+Bloods+-+Temp.1+%5BHDTV%5D%5BCap.104%5D%5BSpanish%5D%5Bwww.nolesvotes.com&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"IBM00","files":1,"time":1303486356,"description":"DescripciÃƒÂ³n: Blue Bloods es un drama familiar sobre los miembros de una familia de policÃƒÂ­as dedicados a defender la ley en la ciudad de Nueva York. Frank Reagan (Tom Selleck) es el Jefe de PolicÃƒÂ­a y patriarca de la familia Reagan, que maneja con la misma diplomacia que en el trabajo, incluso cuando debe enfrentar la polÃƒÂ­tica aplicada por su padre, Henry (Len Cariou), cuando era Jefe. Los hijos mayores de Frank son Danny (Donnie Wahlberg), un experimentado detective, hombre de familia y veterano de guerra dispuesto a utilizar tÃƒÂ¡cticas sospechosas para cerrar casos; y Erin (Bridget Moynahan), una fiscal que sirve como equilibrio para su padre y hermano. Finalmente tenemos a Jamie (Will Estes), el hermano menor que se graduÃƒÂ³ en derecho en Harvard pero decidiÃƒÂ³ rechazar un importante puesto en una firma para seguir una carrera en la fuerza policial, apoyado por su novia Sydney Davenport (Dylan Moore), tambiÃƒÂ©n abogada. La vida de Jamie da un giro inesperado cuando es invitado a convertirse en parte de equipo clandestino de la policÃƒÂ­a del que su padre no sabe nada, y que podrÃƒÂ­a afectar el legado de su familia.\t\t","torrent":{"xt":"urn:btih:5b5c76c7a2db0f558ad574f2a221ae3ca5965aaf","amp;dn":"Blue+Bloods+-+Temp.1+%5BHDTV%5D%5BCap.104%5D%5BSpanish%5D%5Bwww.nolesvotes.com","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5b5c76c7a2db0f558ad574f2a221ae3ca5965aaf","infoHashBuffer":{"type":"Buffer","data":[91,92,118,199,162,219,15,85,138,213,116,242,162,33,174,60,165,150,90,175]},"announce":[],"urlList":[]}}