{"title":"US Infantry in the Indian Wars 1865-91","uid":11767280,"size":5161577,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5b8828b159bf623398f78017e0a892bcad147793&amp;dn=US+Infantry+in+the+Indian+Wars+1865-91&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1426896569,"description":"Thanks to Hollywood's many portrayals of the US Cavalry, it is little understood that the infantry played as great a part in the Indian Wars of the 1860s-80s, and were more consistently successful.\n\nThe great Paiute War of 1866, where the infantry of the most renowned Indian-fighting general, George Cook, excelled in battle, together with the role of other infantry units in the final subjugation of Geronimo's Apaches in 1886, are but two instances of their achievements.\n\nMoreover, after the Custer massacre, it was the infantry under Gen Nelson Miles who out-fought Crazy Horse's Sioux in the Wolf Mountains in 1877; Crazy Horse christened them 'Walk-a-Heaps'.\nThe struggle against the Indians was the longest war in American military history and the Indians were formidable opponents. They knew the terrain, could live off the land and fielded some of the finest light cavalry in the world. Facing such a determined foe, one soldier even wrote: &quot;The front is all around and the rear is nowhere.&quot; The US Infantry endured years of sporadic battles that were bitterly contested against an enemy who was fighting for their very survival.\n\nPresenting an illustrated history of these critical but overlooked soldiers of the Indian Wars, and featuring their involvement in the legendary battles of Wounded Knee and Wolf Mountains, this narrative includes details of their tactics, training, uniforms and equipment culminating in the eventual &quot;closing&quot; of the American Frontier in 1890 and the final conquest of the indigenous inhabitants of North America","torrent":{"xt":"urn:btih:5b8828b159bf623398f78017e0a892bcad147793","amp;dn":"US+Infantry+in+the+Indian+Wars+1865-91","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5b8828b159bf623398f78017e0a892bcad147793","infoHashBuffer":{"type":"Buffer","data":[91,136,40,177,89,191,98,51,152,247,128,23,224,168,146,188,173,20,119,147]},"announce":[],"urlList":[]}}