{"title":"Never Smile at Strangers - Jennifer Minar-Jaynes","uid":11676397,"size":395892,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5c189bc8f2130d1640cf1ccd41401f660827eb9f&amp;dn=Never+Smile+at+Strangers+-+Jennifer+Minar-Jaynes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1422890682,"description":"When teenage girls vanish in what was once considered a safe, Louisiana bayou town, the lives of four desperate young locals take unexpected turns, begging the question: Do you every truly know those closest to you?\n\nWhen 19-year-old Tiffany Perron vanishes from rural Grand Trespass, Louisiana, best friend Haley Landry's relationship with her boyfriend becomes increasingly strained. To make matters worse, her impressionable younger sister Becky has begun idolizing an impetuous, seductive 15 year old who's encouraging her to do dangerous things.\n\nMeanwhile, Erica Duvall, a reclusive 19-year-old aspiring writer, befriends Haley. Ten years earlier, Erica's mother abandoned her, leaving her with the womanizing used car salesman father she loathes. She's decided to write a novel based on Tiffany's disappearance; a novel that she hopes will lead to a reunion with her estranged novelist mother.\n\nRachel Anderson, a 36-year-old mother of two, is having trouble coming to terms with her husband, Tom's, affair with the missing girl - a relationship that supposedly ended shortly before Tiffany's disappearance. What's more, she comes to the blood curdling realization that someone is watching her through the large back windows of her house.\n\nA disturbed man also lives in the area. Ever since his mother's murder four years earlier, he's been raising his insolent teenage sister, Allie, who sleeps with truck drivers for money. He considers women to be dangerous - and his world revolves around his fear and hatred for them. He's terrified of his sister, knowing she's intent on pushing him over the edge","torrent":{"xt":"urn:btih:5c189bc8f2130d1640cf1ccd41401f660827eb9f","amp;dn":"Never+Smile+at+Strangers+-+Jennifer+Minar-Jaynes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c189bc8f2130d1640cf1ccd41401f660827eb9f","infoHashBuffer":{"type":"Buffer","data":[92,24,155,200,242,19,13,22,64,207,28,205,65,64,31,102,8,39,235,159]},"announce":[],"urlList":[]}}