{"title":"Life and Words: Violence and the Descent into the Ordinary","uid":6623211,"size":1115769,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5c91b640b1f351cc27c748f174d65e528f4cce84&amp;dn=Life+and+Words%3A+Violence+and+the+Descent+into+the+Ordinary&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"_F1_","files":-1,"time":1314077275,"description":"Life and Words: Violence and the Descent into the Ordinary (Philip E. Lilienthal Books) [Paperback]\nVeena Das (Author), Stanley Cavell (Foreword)\n\nPaperback: 296 pages\nPublisher: University of California Press; 1 edition (December 4, 2006)\nLanguage: English\nISBN-10: 0520247450\nISBN-13: 978-0520247451\n\nIn this powerful, compassionate work, one of anthropology's most distinguished ethnographers weaves together rich fieldwork with a compelling critical analysis in a book that will surely make a signal contribution to contemporary thinking about violence and how it affects everyday life. Veena Das examines case studies including the extreme violence of the Partition of India in 1947 and the massacre of Sikhs in 1984 after the assassination of then Prime Minister Indira Gandhi. In a major departure from much anthropological inquiry, Das asks how this violence has entered &quot;the recesses of the ordinary&quot; instead of viewing it as an interruption of life to which we simply bear witness. Das engages with anthropological work on collective violence, rumor, sectarian conflict, new kinship, and state and bureaucracy as she embarks on a wide-ranging exploration of the relations among violence, gender, and subjectivity. Weaving anthropological and philosophical reflections on the ordinary into her analysis, Das points toward a new way of interpreting violence in societies and cultures around the globe. The book will be indispensable reading across disciplinary boundaries as we strive to better understand violence, especially as it is perpetrated against women.","torrent":{"xt":"urn:btih:5c91b640b1f351cc27c748f174d65e528f4cce84","amp;dn":"Life+and+Words%3A+Violence+and+the+Descent+into+the+Ordinary","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c91b640b1f351cc27c748f174d65e528f4cce84","infoHashBuffer":{"type":"Buffer","data":[92,145,182,64,177,243,81,204,39,199,72,241,116,214,94,82,143,76,206,132]},"announce":[],"urlList":[]}}