{"title":"Landscape With Figures - A History of Art Dealing in the US","uid":12628455,"size":73194543,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5d0890b612f1352c31850bbc3eb5b3d36107518b&amp;dn=Landscape+With+Figures+-+A+History+of+Art+Dealing+in+the+US&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"STBGD","files":1,"time":1445803368,"description":"Landscape With Figures: A History of Art Dealing in the United States\r\nOxford University Press | 2000 | ISBN 019513673X | Eng | 392 pages | PDF | 70 MB\r\n\r\nHow did the United States become not only the leading contemporary art scene in the world, but also the leading market for art? The answer has to do not only with the talents of American artists or even the size of the American economy, but also-and especially-the skills and entrepreneurship of American art dealers. Their story has not been told...until now. Landscape with Figures is the first history of art dealing in the United States, following the profession from eighteenth-century portrait and picture salesmen in the colonies to the high-profile, jet-set gallery owners of today. Providing anecdotal and carefully researched biographies of the prominent dealers from more than two centuries of trade, author Malcolm Goldstein shows how magnanimous personalities and social networking helped to shape the way Americans have bought and valued art. These dealers range from Michael Paff, whose enthusiasm often overshadowed his expertise but nonetheless helped him sell faux Old Master paintings to major collectors in the early nineteenth century; to the imperious Joseph Duveen, dealer to magnates like Henry Clay Frick; to visionary Leo Castelli, who helped to usher in a revolution in modern art during the 1960s by showing such avant-garde artists as Jasper Johns, Robert Rauschenberg, and Andy Warhol. Goldstein also shows that the American art trade, while male-dominated, has been galvanized by female dealers, including the inimitable Edith Gregor Halpert, Peggy Guggenheim, and Mary Boone. Their fascinating stories unfold in the context of world art history, the rise of major art institutions like the Museum of Modern Art and the Whitney Museum, and the growing zeal of art collectors who would eventually pay millions for individual works of art. Unprecedented and critical to understanding today's art world, Landscape with Figures is a must for artists, art history students, and art lovers","torrent":{"xt":"urn:btih:5d0890b612f1352c31850bbc3eb5b3d36107518b","amp;dn":"Landscape+With+Figures+-+A+History+of+Art+Dealing+in+the+US","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d0890b612f1352c31850bbc3eb5b3d36107518b","infoHashBuffer":{"type":"Buffer","data":[93,8,144,182,18,241,53,44,49,133,11,188,62,181,179,211,97,7,81,139]},"announce":[],"urlList":[]}}