{"title":"Walid Phares - The Coming Revolution [Against Islam] (mobi+)","uid":6971631,"size":1643442,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5d948db67efdb199cc09ee74b19619495df927b1&amp;dn=Walid+Phares+-+The+Coming+Revolution+%5BAgainst+Islam%5D+%28mobi%2B%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":null,"files":2,"time":1327110309,"description":"The Coming Revolution: Struggle for Freedom in the Middle East\n\nAfter the 9/11 Commission concluded in 2004 that the U.S. was engaged in a war with terrorists and never realized it, they reasoned that &quot;a failure of imagination&quot; had prevented us from seeing terrorism coming. In effect, Americans were simply unable, or in fact disabled, to fathom that there were people who hated and opposed our democracy with such ferocity. But after billions of dollars and almost a decade fighting a war in the Middle East, will we miss the threat again?\n\nWith penetrating insight and candor, Walid Phares, Fox News terrorism and Middle East expert and a specialist in global strategies, argues that a fierce race for control of the Middle East is on, and the world's future may depend on the outcome. Yet not a failure of imagination, but rather, of education has left Americans without essential information on the real roots of the rising Jihadi threat. Western democracies display a dangerous misunderstanding of precisely who opposes democracy and why. In fact, the West ignores the wide and disparate forces within the Muslim world--including a brotherhood against democracy that is fighting to bring the region under totalitarian control--and crucially underestimates the determined generation of youth feverishly waging a grassroots revolution toward democracy and human rights. \n\nAs terror strikes widen from Manhattan to Mumbai and battlefields rage from Afghanistan to Iraq, many tough questions are left unanswered, or even explored: Where are the anti-Jihadists and the democrats in the Muslim world? Does the Middle East really reject democracy? Do the peoples of the region prefer the Taliban, the Muslim Brotherhood, or Hezbollah over liberals and seculars? And is there really no genuine hope that freedom and democracy can prevail over the Islamist caliphate? \n\nPhares explores how the free world can indeed win the conflict with the Jihadists, but he says, not by using the tactics, policies, and strategies it has employed so far. He urges policy makers to first identify the threat and define its ideology, or there will be no victory. \n\nThe Coming Revolution is a vital corrective step in the world's war against terrorism and essential reading that clearly and explosively illustrates the untold story of a struggle to determine if the Middle East can at last reach freedom in this century--or if this planet can prevent the otherwise inevitable outcome that could change our social and political landscape forever. The race is on.\n\nAuthor: Walid Phares\nPublisher: Pocket Books\nPublication Date: December 7, 2010\n\nFormats:\n.mobi (compatible with Amazon Kindle, etc.)\n.epub (compatible with Sony Reader, Cruz Reader, iPad, iPodTouch/iPhone, etc.)\n\nFree Calibre eBook reader: &lt;a href=&quot;\nhttp://calibre-ebook.com/download&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://calibre-ebook.com/download&lt;/a&gt;\n","torrent":{"xt":"urn:btih:5d948db67efdb199cc09ee74b19619495df927b1","amp;dn":"Walid+Phares+-+The+Coming+Revolution+%5BAgainst+Islam%5D+%28mobi%2B%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d948db67efdb199cc09ee74b19619495df927b1","infoHashBuffer":{"type":"Buffer","data":[93,148,141,182,126,253,177,153,204,9,238,116,177,150,25,73,93,249,39,177]},"announce":[],"urlList":[]}}