{"title":"Highway 61 Double Feature - The Intruder + Shanty Tramp","uid":7820271,"size":1541626647,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5e96ee89959d30633021f76552b3df987712a729&amp;dn=Highway+61+Double+Feature+-+The+Intruder+%2B+Shanty+Tramp&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Zoticus","files":3,"time":1352777765,"description":"THE INTRUDER (1962) and SHANTY TRAMP (1967)\nTwo southern-fried USA drive-in classics\n\nNever forget . . . \n\n3 Nero Digital MP4 files, 2 feature films and trailer for THE INTRUDER\n512 x 384\nRipped from DVD-R &gt; 1100 kbs\n\nTHE INTRUDER is digitally mastered from a VHS source, from the Englewood Entertainment / Wade Williams &quot;Hollywood Noir&quot; Collection.\n\nSHANTY TRAMP is the Something Weird Video DVD-R release which (on my disc) has one reel repeated at the climax of the film! I repaired the damage as well as I'm able, making this version unique, and an improvement over the original.\n\nWilliam Shatner stars as THE INTRUDER about five years before he landed the part of Captain Kirk in the &quot;Star Trek&quot; television series.  He's very good as a white supremacist who visits a sleepy Southern town to incite the whites against the newly instituted policy of racial integration in the public schools. (See Brown v. Board of Education)  Directed by Roger Corman on location in the Show Me State, Missouri, which is at least half-Southern.\n\nSHANTY TRAMP is an almost indescribable trash classic, the tale of a very bad young woman (the SHANTY TRAMP) who creates chaos in a volatile Southern town.  Starring a trio of actors who also worked with Herschell Gordon Lewis in Florida -- Eleanor Vaill as The TRAMP, Otto Schlesinger as her Pa, and Bill Rogers as The Preacher.\n\nWARNING: BOTH OF THESE FILMS CONTAIN SEXUAL AND VIOLENT SCENES, OFFENSIVE RACIAL EPITHETS, DISCOMFORTING SITUATIONS AND THINGS WE SWEEP UNDER THE RUG AT OUR OWN PERIL. There, I said it. Enjoy yourselves and scatter your seed(s) far and wide.\n\n\n","torrent":{"xt":"urn:btih:5e96ee89959d30633021f76552b3df987712a729","amp;dn":"Highway+61+Double+Feature+-+The+Intruder+%2B+Shanty+Tramp","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5e96ee89959d30633021f76552b3df987712a729","infoHashBuffer":{"type":"Buffer","data":[94,150,238,137,149,157,48,99,48,33,247,101,82,179,223,152,119,18,167,41]},"announce":[],"urlList":[]}}