{"title":"Coast to Coast AM  MAR-19-2013 TUES hr1-2","uid":8280808,"size":28170073,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:5eb9b6e9e3e3516439423eca0ebaea173432a9c3&amp;dn=Coast+to+Coast+AM++MAR-19-2013+TUES+hr1-2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"CAPTAIN7SS","files":3,"time":1363826480,"description":"Coast to Coast AM  MAR-19-2013 TUES hr1-2\n\n\n\n\n\n\n\nNew World Order\n\n2 HOURS OF THE SHOW.......26 MB'S  \n\nDate: \t03-19-13\nHost: \tGeorge Noory\nGuest:  Lindsey Williams\n\nIn the first half, ordained Baptist minister and former Chaplain to the 'Elite,' Lindsey Williams,\n shared what he'd been told by one of his 'Elite' contacts-- the agenda of the New World Order (NWO) for\n the next 4 years. \n He revealed that the NWO was displeased with Pres. Obama, as he went against their wishes by canceling \n the Keystone XL pipeline plan, among other things.\n The Elite do not want a financial collapse or catastrophic event with the American dollar for at least two\n to three years, which gives people temporary economic opportunities, he continued.\n The reason behind this is &quot;forced debt creation&quot; such as through college loans, and government spending,\n he said. \n This will bring debt levels up so high that when the Elite get ready to pull the plug on the currencies\n of the world, people will give up the Constitution, and accept a new world order, he outlined,\n adding that the end game for this scenario was four years.\n\n While the super rich make up their own rules, the middle class will be taxed into oblivion,\n and be put into more and more debt, he continued. \n Within four years, 70% of Americans will be receiving some sort of check from the government,\n and the dollar will be phased out as the reserve currency and petro dollar of the world, Williams stated.\n Regarding gold and silver, he suggested that confiscation was unlikely\n -- the Elite are keeping this from being bothered. &quot;One thing the Elite fear more than anything else,\n is the masses waking up...and as a result they are having to escalate their plans,&quot; he warned. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:5eb9b6e9e3e3516439423eca0ebaea173432a9c3","amp;dn":"Coast+to+Coast+AM++MAR-19-2013+TUES+hr1-2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5eb9b6e9e3e3516439423eca0ebaea173432a9c3","infoHashBuffer":{"type":"Buffer","data":[94,185,182,233,227,227,81,100,57,66,62,202,14,186,234,23,52,50,169,195]},"announce":[],"urlList":[]}}