{"title":"Get Medieval - BlissBoy","uid":4596973,"size":811379345,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:5f1402906affaabff4d1c637054013374d002004&amp;dn=Get+Medieval+-+BlissBoy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Vredeskind","files":8,"time":1230046001,"description":"&quot;Runescape is for wimps..!!&quot;\n\n&quot;This game boils your blood, are you and your friends all over the world up to this challenge..?&quot;\n\nGet medieval's trailer:   &lt;a href=&quot;\nhttp://www.getmedieval.com/gm_320.mov&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.getmedieval.com/gm_320.mov&lt;/a&gt;\n\n\nIrresistibly addictive, Get Medieval immerses you in a frenetic action environment as you battle the evil minions of a dastardly dragon. Laugh out loud at the quips, quibbles, and quirks of this slightly &quot;off&quot; band of adventurers. And while you may not want these characters to show up at your next dinner party, you'll forgive their eccentricities when their diverse but effective skills get you through to the next level.\n\nWith great muliplayer options including - two players on the same keyboard, daisy-chained sidewinders, Internet and LAN support, we're sure you can find a way to get your friends involved, whether they're across the street or across the continent. \n\n\n\nBeautiful 3D rendered graphics \n40 &quot;hand-built&quot; action-packed levels with the option to use the advanced Random Dungeon Generator to create new levels for unlimited gameplay \nOver 20 different enemies and bosses \n4 different characters to choose from, each well-balanced using their respective strengths and weaknesses (e.g. weapon strength, speed, etc.) \n8 artifact powerups that give the characters special abilities \nUp to 4 players can play on one machine or via network to cooperatively explore and clear levels \nDownloadable from the Get Medieval web site is Monolith's DungeonEdit that enable players to build their own custom levels from the ground up \nSpectacular audio, with panning/fading ambient and trigger sound effects and unique music for each level \nWindows(tm) 95 native \nAll the art is beautifully rendered in 3D using 16-bit color and high resolution graphics (640x480) \nDynamic color filters for amazing special effects, including active lighting and translucent images \nPlayable on the Internet, over a LAN or via a modem \nUses Microsoft's DirectX(tm) technology for superior performance and hardware compatibility \nUses Monolith's advanced 2D parallaxing game engine WAP \nSupports SoundFontÃ‚Â® technology \nscreen locks to show all characters on screen \n","torrent":{"xt":"urn:btih:5f1402906affaabff4d1c637054013374d002004","amp;dn":"Get+Medieval+-+BlissBoy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5f1402906affaabff4d1c637054013374d002004","infoHashBuffer":{"type":"Buffer","data":[95,20,2,144,106,255,170,191,244,209,198,55,5,64,19,55,77,0,32,4]},"announce":[],"urlList":[]}}