{"title":"TS Jane Marie - 5 Star Bitch 540p.avi","uid":12330224,"size":1299602212,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:5f9367dec2fc71340b5b443d713341b1eeb40191&amp;dn=TS+Jane+Marie+-+5+Star+Bitch+540p.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Lost213","files":1,"time":1441179100,"description":"Having revolutionized the genre of transsexual porn, director Joey Silvera is an experienced star maker. He knows the talents and special qualities that make she-males stand out - gorgeous femininity, sassy personality and, of course, that extra something that can't quite be tucked away behind sexy lingerie. &quot;TS Jane Marie 5 Star Bitch&quot; showcases Joey's newest protege, an absolutely stunning, 19-year-old Latina T-girl with a big, yummy rack and a throbbing, uncut tool. Jane Marie explains that a &quot;5 Star Bitch is a woman that thinks like a boss,&quot; and the ingenue takes control in five provocative scenes of gender-bending depravity. Kinky bitch Honey Foxx shares a session of mutual butt fucking and ass-to-mouth cocksucking that climaxes in a spray of she-sperm all over Jane's pretty face. Next comes a wild anal orgy with sultry, slinky Asian ladyboy Venus Lux, muscular stud Christian and enormously hung ebony she-male Chanel Couture. After all this craziness, Jane soothes her nerves with a solo masturbation interlude, stroking her stiff dick while reaming her anus with a big pink dildo. Pale, fleshy trannie psychiatrist Tiffany Starr prescribes a private session of cocksucking and anal play for our Latina she-male starlet. Finally, an adventurous genetic girl, busty blonde Katie Summers, treats Jane to her first experience with pussy. Katie gets serviced by our heroine and even indulges in some strap-on domination before lapping up Jane's hot she-spunk. For lovers of transsexual splendor, &quot;TS Jane Marie: 5 Star Bitch&quot; is a luxury model with all options included.\n\n\nScreens:\n &lt;a href=&quot;\nhttp://mega-pix.eu/image/n&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mega-pix.eu/image/n&lt;/a&gt;","torrent":{"xt":"urn:btih:5f9367dec2fc71340b5b443d713341b1eeb40191","amp;dn":"TS+Jane+Marie+-+5+Star+Bitch+540p.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5f9367dec2fc71340b5b443d713341b1eeb40191","infoHashBuffer":{"type":"Buffer","data":[95,147,103,222,194,252,113,52,11,91,68,61,113,51,65,177,238,180,1,145]},"announce":[],"urlList":[]}}