{"title":"Coast to Coast AM April 08 2013","uid":8375279,"size":56628989,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:6064e2e583c7dd2f0905b5acb3bdb79df20e9810&amp;dn=Coast+to+Coast+AM+April+08+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"runcdfirst","files":5,"time":1366036751,"description":"#we.are.some.of.the.leaders.on.the.motherpla.net\n\nDate: \t04-08-13\nHost: \tGeorge Noory\nGuests: \tRobert Young Pelton, Robert Zimmerman\n\nAuthor and adventurer Robert Young Pelton discussed global war trends, his experiences working with private military contractors, as well as geopolitical hot spots. Regarding North Korea, he characterized the country as one of the last holdovers of the Cold War-- still reacting from the Korean War in the 1950s. &quot;The leadership of the country is very similar to Saddam Hussein and some of the older dictatorships, where to stay in power they can do whatever they want-- they don't have anyone to regulate them,&quot; he noted. However, North Korea's recent bout of aggression, posturing, and saber-rattling was actually instigated by one of the US' military exercises, not Kim Jong Un, Pelton pointed out.\n\nWhile American troops are dwindling down in Afghanistan, private contractors are on the increase there, he reported. Many retire from the US military, only to get similar jobs as contractors for more money, he explained. &quot;I was surprised at how many contractors were integrated into the fighting force,&quot; non-uniformed civilians performing things like intel gathering, interrogations, training, and servicing of equipment, he remarked. If a quick military action is required such as setting up a drone base, &quot;they use contractors because they can call them up and they can be there with exact skills and then they can send them home and nobody knows about it,&quot; Pelton revealed.\n\nThe real tinderbox today is the evaporation of the middle class all around the world, he stated. The bedrock of stability is being eroded, and predatory government systems like in Cyprus are preying on its citizens, he said. What we're seeing in the Arab Spring is a predominance of young people who have no future economic prospects, and this is a very dangerous trend, he continued. Afghanistan is experiencing an extraordinary brain drain-- all the young people that worked with Americans because of the aid money, are getting visas to Europe, and &quot;that's what's going to plunge Afghanistan back into the stone age,&quot; he warned.\nSpace Exploration Update\n\nFirst hour guest, space historian Robert Zimmerman reacted to NASA's announcement that they will not lead efforts for astronauts to return to the moon. Private companies however are likely to spearhead getting humans into orbit, &quot;and eventually the profits from that are going to pay for further exploration, which will get us to the moon, and beyond,&quot; he commented. Innovations from companies like SpaceX are reducing costs for launch vehicles such as their Falcon 9 system, which helps to increase their customer base beyond NASA, he added.\n\nNews segment guests: Dr. John McDougall, Mitch Battros\nWebsite(s):\n\n    comebackalive.com\n    dangerousmagazine.com\n    behindtheblack.com\n\nBook(s):\n\n    Licensed to Kill: Hired Guns in the War on Terror\n    The Adventurist: My Life in Dangerous Places\n    The World's Most Dangerous Places\n    Leaving Earth: Space Stations, Rival Superpowers, and the Quest for Interplanetary Travel\n    The Universe in a Mirror: The Saga of the Hubble Space Telescope\n    Genesis: The Story of Apollo 8 (ebook)\n\n","torrent":{"xt":"urn:btih:6064e2e583c7dd2f0905b5acb3bdb79df20e9810","amp;dn":"Coast+to+Coast+AM+April+08+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6064e2e583c7dd2f0905b5acb3bdb79df20e9810","infoHashBuffer":{"type":"Buffer","data":[96,100,226,229,131,199,221,47,9,5,181,172,179,189,183,157,242,14,152,16]},"announce":[],"urlList":[]}}