{"title":"Verve Jazz Masters 08 - Stan Getz (1994) [Jazz][mp3 320][h33t][s","uid":4972782,"size":167030097,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:60aab1f50b9acdc2c1fa75c1b9e38e6a00d6ca2b&amp;dn=Verve+Jazz+Masters+08+-+Stan+Getz+%281994%29+%5BJazz%5D%5Bmp3+320%5D%5Bh33t%5D%5Bs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"schon55","files":15,"time":1245851621,"description":"Verve Jazz Masters 08 - Stan Getz \nAudio CD: March 22, 1994 \nOriginal Release Date: March 22, 1994 \nLabel: Polygram Records\nBitrate: 320 kbps \n\nVol. 8 of the Verve Jazz Masters series features Stan Getz in a wide variety of settings. Of the many recordings he did for the label, it would be hard to pin down his greatest tracks, but what is included on this collection has depth and substance, if not being altogether familiar. The CD is bookended by his most famous bossa nova hits, &quot;Desafinado&quot; and the immortal &quot;The Girl from Ipanema.&quot; In between, you get a cross section of bop, ballads, and a little string-sweetened music. The cuts that stand out are the swinger of Duke Jordan's &quot;Jordu,&quot; Chick Corea's sprightly waltz &quot;Windows,&quot; and European organist Eddy Louiss and Getz doing the soulful &quot;Dynasty.&quot; The brilliant but obscure guitarist RenÃƒÂ© Thomas is also present. What could easily be expanded to a double or triple CD is condensed into an intriguing mix of tunes that faithfully showcases the cool and more energetic tenor of Getz. It's a good purchase. ~ Michael G. Nastos, All Music Guide\n\nThe son of a Russian Taylor (born in 1927; died on 1991) grew and grew up under the most inspirational jazz decades, such as Ben Webster, Woody Herman, Miles Davis, Coleman Hawkins, Ron Carter, Lester Young, Charlie Parker and so many others consecrated soloists. \n\n&quot;He was sheer genius&quot; Dizzy Gillespie about him. Widely celebrated by his ballads; his flawless and velvet tune makes him immediately recognizable among the most discrete listener; so his nickname &quot;the sound&quot; couldn't be more appropriate; he gave a crucial launch to Brazilian music through his renowned musical success than deserved him the world acknowledgement ; Girl from Ipanema with Astrud Gilberto became a reference, a status song and almost his instantaneous meeting card in most stages in the world. \n\nThe live piece &quot;It never entered my mind&quot; is probably the jewel of the crown in this golden recording with Oscar Peterson, but all the album is pure gold. \n\nThe recording is an invaluable set of historical performances that span from 1952 (track 3), 1955 (tracks 2, 4), 1957 (track 5), 1958 (track 6) 1961 (track 9) 1962 (track 1), 1963 ( track 10) 1967 ( track 7) to 1971 (track 8). ~ Hiram Gomez Pardo\n\nVerve Jazz Masters 08 - Stan Getz Tracks:\n01  Desafinado 5:52\n02  S-h-i-n-e 8:54 \n03  Body And Soul 3:19\n04  Gladys 7:49\n05  It Never Entered My Mind 3:56\n06  Jordu 8:33\n07  Windows 9:02 \n08  Dynasty 9:49\n09  Her 6:13\n10  The Girl From Ipanema 5:21","torrent":{"xt":"urn:btih:60aab1f50b9acdc2c1fa75c1b9e38e6a00d6ca2b","amp;dn":"Verve+Jazz+Masters+08+-+Stan+Getz+%281994%29+%5BJazz%5D%5Bmp3+320%5D%5Bh33t%5D%5Bs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"60aab1f50b9acdc2c1fa75c1b9e38e6a00d6ca2b","infoHashBuffer":{"type":"Buffer","data":[96,170,177,245,11,154,205,194,193,250,117,193,185,227,142,106,0,214,202,43]},"announce":[],"urlList":[]}}