{"title":"Quilt - Held in Splendor (2014) [FLAC]","uid":9544936,"size":296910797,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:6166074349302fce97fac86aff825fdfcef02c4f&amp;dn=Quilt+-+Held+in+Splendor+%282014%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"politux","files":-1,"time":1391112179,"description":"\n  Quilt - Held in Splendor (2014) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Psychedelic, Folk Rock\n  Source: CD (log + cue)\n  Codec: FLAC\n  Bitrate: ~ 1,000 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  01 Arctic Shark\n  02 Saturday Bride\n  03 Eye of the Pearl\n  04 Mary Mountain\n  05 Tie Up the Tides\n  06 The Hollow\n  07 A Mirror\n  08 Just Dust\n  09 The World is Flat\n  10 Tired &amp; Buttered\n  11 Secondary Swan\n  12 Talking Trains\n  13 I Sleep in Nature\n\n  Quilt's version of psychedelic pop, which nodded to the sound's '60s heyday with jangly guitars, intricate harmonies, and gently rambling songs, was already pretty fully realized on their self-titled debut. Their second album, Held in Splendor, feels like both a continuation and a dramatic evolution from their early days. Shane Butler, Anna Fox Rochinski, and John Andrews bring more form and focus to their trips; that they were able to record these songs in an intense set of sessions, instead of over the course of a year like they did with their debut, only helps their coherence. Working with Woods' Jarvis Taveniere was also an inspired choice, since his music also feels like both a long-lost discovery and utterly fresh. With his help, Held in Splendor's writing and production values have all taken several steps forward. The fuller arrangements and instrumentation on &quot;A Mirror,&quot; where the bassline provides a strong and sinuous backbone, and &quot;Tired &amp; Buttered,&quot; where a woozy saxophone captures the feeling of being pleasantly half-asleep, deliver the depth that was hinted at on Quilt. \n\n  There's a lysergic brightness and sparkle to the album's sound, particularly on opening track and former single &quot;Arctic Shark,&quot; where Rochinski ponders &quot;heavy dreams&quot; and &quot;newborn forms&quot; over sitar-like guitars (as on Quilt, Rochinski and Butler's dulcet voices lend an earnestness to their mystical musings that makes them sweetly idealistic instead of tiresome). Everything feels more distilled, whether it's the urgency behind &quot;Eye of the Pearl&quot;'s pointed pop, or the way Quilt pack more twists, turns, and breakdowns into these songs than they did before -- and sound more natural and confident doing so. The standout is &quot;Mary Mountain,&quot; where the band expresses the earthiest and airiest sides of psych rock in garagey riffs and stratospheric drones. However, there's just as much depth in dreamy glimpses like &quot;Tie Up the Tides&quot; and &quot;Talking Trains,&quot; which reveals a kinship with British folk from the era that Quilt love so much. Even more than on their debut, Held in Splendor shows that Quilt are defined, but not confined, by their affinity for the sounds of the '60s. Instead, they're using it in ways that may be slightly more down to earth but also cover more ground","torrent":{"xt":"urn:btih:6166074349302fce97fac86aff825fdfcef02c4f","amp;dn":"Quilt+-+Held+in+Splendor+%282014%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6166074349302fce97fac86aff825fdfcef02c4f","infoHashBuffer":{"type":"Buffer","data":[97,102,7,67,73,48,47,206,151,250,200,106,255,130,95,223,206,240,44,79]},"announce":[],"urlList":[]}}