{"title":"Zinfandel - A History of a Grape and Its Wine (California Studie","uid":6466794,"size":2550261,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6342949ec3ec8a2d61b7a410fd227ce3e7a58be4&amp;dn=Zinfandel+-+A+History+of+a+Grape+and+Its+Wine+%28California+Studie&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"lionzbay","files":1,"time":1307986992,"description":"\nAuthor(s): Charles L. Sullivan\nPublisher: University of California Press\nDate: 2003-09-02\nFormat: pdf\nLanguage: English\nISBN10: 0520239695\nPages: 246\nISBN13: 9780520239692\n\nProduct Description: The Zinfandel grape--currently producing big, rich, luscious styles of red wine--has a large, loyal, even fanatical following in California and around the world. The grape, grown predominantly in California, has acquired an almost mythic status--in part because of the caliber of its wines and its remarkable versatility, and in part because of the mystery surrounding its origins. Charles Sullivan, a leading expert on the history of California wine, has at last written the definitive history of Zinfandel. Here he brings together his deep knowledge of wine with the results of his extensive research on the grape in the United States and Europe in a book that will entertain and enlighten wine aficionados and casual enthusiasts. In this lively book, Sullivan dispels the false legend that has obscured Zinfandel's history for almost a century, reveals the latest scientific findings about the grape's European roots, shares his thoughts on the quality of the wines now being produced, and looks to the future of this remarkable grape.\nSullivan reconstructs Zinfandel's journey through history--taking us from Austria to the East Coast of the U.S. in the 1820s, to Gold Rush California, and through the early days of the state's wine industry. He considers the ups and downs of the grape's popularity, including its most recent and, according to Sullivan, most brilliant &quot;up.&quot; He also unravels the two great mysteries surrounding Zinfandel: the myth of Agoston Haraszthy's role in importing Zinfandel, and the heated controversy over the relationship between California Zinfandel and Italian Primitivo. Sullivan ends with his assessments of the 2001 and 2002 vintages, firmly setting the history of Zinfandel into the chronicles of grape history.","torrent":{"xt":"urn:btih:6342949ec3ec8a2d61b7a410fd227ce3e7a58be4","amp;dn":"Zinfandel+-+A+History+of+a+Grape+and+Its+Wine+%28California+Studie","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6342949ec3ec8a2d61b7a410fd227ce3e7a58be4","infoHashBuffer":{"type":"Buffer","data":[99,66,148,158,195,236,138,45,97,183,164,16,253,34,124,227,231,165,139,228]},"announce":[],"urlList":[]}}