{"title":"The.Vampire.Diaries.S04E13.HDTV.x264-LOL greek subtitles","uid":8119527,"size":197761344,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:637a06ea4b28a5b934b99fc43944503a532cf237&amp;dn=The.Vampire.Diaries.S04E13.HDTV.x264-LOL+greek+subtitles&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"loussos","files":2,"time":1360363615,"description":"The vampire brothers Damon and Stefan Salvatore, eternal adolescents, having been leading 'normal' lives, hiding their bloodthirsty condition, for centuries, moving on before their non-aging is noticed. They are back in the Virginia town where they became vampires, as high school students. Stefan is noble, denying himself blood to avoid killing, and tries to control his evil brother Damon. Stefan falls in love with schoolgirl Elena, whose best friend is a witch, like her grandma. Written by KGF Vissers Mystic falls becomes the target town for vampires with the return of Stefan &amp; Damon Salvatore. Stefan, the controlled brother who's focused on his humanity, enrolls at high school attempting a normal life whereas his brother Damon, the dashing, gorgeous, irresistible and dangerous brother makes Stefan's life a misery while trying to steal his girlfriend, Elena, along the way. With the confusing emotions, deceiving acts and hidden talents, comes a deep history from 1864 that Damon is determined to overcome by rescuing the Salvatore brothers' old love, Katherine, with the help of Elena's witch friend. Written by Fiona Anderson After 145 years, the virtuous vampire Stefan Salvatore (Paul Wesley) returns to his home town of Mystic Falls, Virginia and falls for the beautiful Elena Gilbert (Nina Dobrev), a girl with a tragic past and uncanny resemblance to his lost love Katherine. Alwasy close on Stefan's heels is his vampire brother Damon (Ian Somerhalder), a ruthless killer who also loved Katherine and is determined to make Stefan's after-life a living hell in any way he can. But underneath the surface of the sleepy town is a world of mystery, magic, and intrigue, where no one is safe and everyone is hiding a secret... Written by KneelBeforeTodd ","torrent":{"xt":"urn:btih:637a06ea4b28a5b934b99fc43944503a532cf237","amp;dn":"The.Vampire.Diaries.S04E13.HDTV.x264-LOL+greek+subtitles","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"637a06ea4b28a5b934b99fc43944503a532cf237","infoHashBuffer":{"type":"Buffer","data":[99,122,6,234,75,40,165,185,52,185,159,196,57,68,80,58,83,44,242,55]},"announce":[],"urlList":[]}}