{"title":"William Goldman-Boys and Girls Together","uid":8582383,"size":4256342,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:63d858f6fb0c940ef9227bd1a85190663cb7095d&amp;dn=William+Goldman-Boys+and+Girls+Together&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"loonleeks","files":-1,"time":1371435861,"description":"William Goldman-Boys and Girls Together \n\nOCR - Text Searchable\n\n---\n\nReview\n&quot;A SUPERB, BRILLIANT EVOCATION . . . Satisfying in its length, rich in its complication, intriguing in its characters, and above all, revealing of its time and place.&quot;\n--Los Angeles Times\n\n&quot;[GOLDMAN] SUCCEEDS WHERE MOST NOVELISTS SINCE THOMAS WOLFE HAVE FAILED. He carves a huge piece out of the heart of New York, and it has life, power, beauty and truth.&quot;\n--San Francisco Chronicle\nProduct Description\nWilliam Goldman is famous for his Academy Award-winning screenplays, infamous for the thriller that did for dentists what Psycho did for showers, beloved for his hilarious &quot;hot fairy-tale,&quot; and notorious for his candid behind-the-scenes Hollywood chronicles. But long before Butch and Sundance, Buttercup, and the Tinsel-Town tell-alls, he made his mark as one of the great popular novelists of the twentieth century. Now his sweeping, classic tale of a generation's tumultuous coming-of-age is at last back in print.\n\nBOYS &amp; GIRLS TOGETHER\n\nAaron, Walt, Jenny, Branch, and Rudy. They are children of America's post-war generation, as different from one another as anyone can be. Yet they are bound together by the traumas of their pasts, the desperate desire to capture their dreams and satisfy their passions, the stirring pleasures of sexual awakening--and the twists of fate that will inextricably link their lives in the turbulent world of 1960s New York City.\n\n--\nMy Review\n\nThis was the beach book of the 60's. Gay, straight - this book broke ground , all implied nothing explicit but sex is everywhere here just like in real life. It almost become a TV series but perhaps too depressing or not  enough happy endings to suit the TV audiences.\nA  masterpiece that needs to be rediscovered in the 21st century . \n\n\n","torrent":{"xt":"urn:btih:63d858f6fb0c940ef9227bd1a85190663cb7095d","amp;dn":"William+Goldman-Boys+and+Girls+Together","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"63d858f6fb0c940ef9227bd1a85190663cb7095d","infoHashBuffer":{"type":"Buffer","data":[99,216,88,246,251,12,148,14,249,34,123,209,168,81,144,102,60,183,9,93]},"announce":[],"urlList":[]}}