{"title":"Worlds in Collision (1950) - Ages in Chaos (1952,1977,1978) - Im","uid":9047276,"size":8467156,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6421afc0f1123e0580dcf82a30ceb66c39b43e3e&amp;dn=Worlds+in+Collision+%281950%29+-+Ages+in+Chaos+%281952%2C1977%2C1978%29+-+Im&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"onttm","files":4,"time":1381782333,"description":"Worlds in Collision - (from the Publisher) With this book Immanuel Velikovsky first presented the revolutionary results of his 10-year-long interdisciplinary research to the public, founded modern catastrophism - based on eyewitness reports by our ancestors - shook the doctrine of uniformity of geology as well as Darwin's theory of evolution, put our view of the history of our solar system, of the Earth and of humanity on a completely new basis - and caused an uproar that is still going on today. Worlds in Collision - written in a brilliant, easily understandable and entertaining style and full to the brim with precise information - can be considered one of the most important and most challenging books in the history of science. Not without reason was this book found open on Einstein's desk after his death. For all those who have ever wondered about the evolution of the earth, the history of mankind, traditions, religions, mythology or just the world as it is today, Worlds in Collision is an absolute MUST-READ!\n \nAges in Chaos - (from the Author) Ages in Chaos was conceived in the spring of 1940. It was then that I realized that the Exodus had occurred in the midst of a natural upheaval and that this catastrophe might prove to be the connecting link between the Israelite and Egyptian histories, if ancient Egyptian texts were found to contain references to a similar event. I found such references and before long had worked out a plan of reconstruction of ancient history from the Exodus to the conquest of the East by Alexander the Great. Already by October of the same year I had come to understand the nature and extent of that catastrophe. For a decade after that I worked simultaneously on Ages in Chaos and Worlds in Collision, the present work requiring the lion's share of the toil.  Ages in Chaos covers largely the period dealt with in Worlds in Collision - the eight hundred years from the Exodus of the Israelites from Egypt to the invasion of Palestine by Sennacherib in 687 before the present era, and the additional three and a half centuries to Alexander of Macedonia, altogether twelve hundred years of the history of the ancient East. But whereas the first work concentrated on the description of the physical history of the period, the present work deals with its political and cultural aspects. The occurrence of a widespread natural catastrophe serves here only as the point of departure for constructing a revised chronology of the times and lands under consideration.  I searched the records of one land after another and went from one generation to another, taking from everywhere hints and clues, evidence and proof. Because I had to discover and to collate them, this book is written like a detective story. It is well known that in detective work unexpected associations are often built on minute details: a fingerprint on a bar of metal, a hair on a window sill, a burnt-out match in the bushes. Some details of an archaeological, chronological, or paleographic nature may seem minor matters, but they are the fingerprints of an investigation in which the history of many nations in many generations is vitally involved. Such details are not included to make the reading difficult; they are necessary to establish the main thesis of this work. Therefore, any attempt to read this book cursorily will prove to be a fruitless undertaking.\n \nTitle:\tWorlds in Collision\nAuthors:\tImmanuel Velikovsky\nFormats:\tMOBI\nIds:\tGoogle, Amazon.com, 9781906833718\nTags:\tEarth Sciences, Geology, History, Professional &amp; Technical, Professional Science, Science &amp; Math\nPublishers:\tParadigma Ltd\n \nTitle:\tFrom the Exodus to King Akhnaton\nAuthors:\tImmanuel Velikovsky\nFormats:\tMOBI\nSeries:\tBook I of Ages in Chaos\nIds:\tGoogle, Amazon.com, 9781906833732\nTags:\tAncient, Egypt, History, Middle East, Religion &amp; Spirituality\nPublishers:\tParadigma Ltd\n \nTitle:\tRamses II and His Time\nAuthors:\tImmanuel Velikovsky\nFormats:\tMOBI\nSeries:\tBook II of Ages in Chaos\nIds:\tAmazon.com, 9781906833749\nTags:\tAncient, Egypt, History, Israel, Middle East\nPublishers:\tParadigma Ltd\n \nTitle:\tPeoples of the Sea\nAuthors:\tImmanuel Velikovsky\nFormats:\tMOBI\nSeries:\tBook III of Ages in Chaos\nIds:\tAmazon.com, 9781906833756\nTags:\tAncient, Egypt, Greece, History\nPublishers:\tParadigma Ltd","torrent":{"xt":"urn:btih:6421afc0f1123e0580dcf82a30ceb66c39b43e3e","amp;dn":"Worlds+in+Collision+%281950%29+-+Ages+in+Chaos+%281952%2C1977%2C1978%29+-+Im","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6421afc0f1123e0580dcf82a30ceb66c39b43e3e","infoHashBuffer":{"type":"Buffer","data":[100,33,175,192,241,18,62,5,128,220,248,42,48,206,182,108,57,180,62,62]},"announce":[],"urlList":[]}}