{"title":"Garage Sale 4.0.6 k UB","uid":4145903,"size":19800515,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:663bf5415fec347f3888435a0104bdee984d8008&amp;dn=Garage+Sale+4.0.6+k+UB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Beastilio","files":1,"time":1208724287,"description":"Are you sick and tired of creating auctions using eBay&amp;#039;s slow web site? Have you been waiting patiently for a quality, affordable listing utility for the Mac OS for years? Here comes your deliverance: Ladies and Gentlemen, we&amp;#039;re pleased to announce the arrival of GarageSale. (Your auction experience is about to change for the better...)\n\nGarageSale is a slick, full-featured client application for the eBay online auction system. With GarageSale Mac OS X users can finally compose eye-catching auctions quickly using an intuitive Mac-like interface. (And in the fraction of the time it would take to do it on eBay&amp;#039;s web interface.) Not only this, but GarageSale also integrates perfectly with iPhoto, offers WYSIWYG text editing and comes with over 130 free design templates.\n\n\n\nFeatures:\n\nFree Image Serving\nStore up to ten auction images free of charge on our servers and say &amp;#039;Goodbye&amp;#039; to eBay&amp;#039;s image hosting fees. (Learn More) \t\n\n124 Unique Listing Designs\nEnhance your listing with one of 124 listing designs. With each of them you can change how images and description are laid out - giving you more than 1000 unique possibilities. Of course you can also create your own design! Preview the included designs here. (Learn More)\n\nBuilt-in Scheduler\nStart your auctions anytime you want to - WITHOUT paying extra. (Learn More) \t\n\niPhoto integration\nAccess your iPhoto library directly from within GarageSale. No more copying, pasting or exporting each individual picture from iPhoto. It just works!\n\nPowerful Messaging System\nSend messages to your buyers using customizable templates with just a few clicks via eBay&amp;#039;s message system or Apple Mail. (Learn More) \t\n\nFTP and .Mac Image Serving\nUpload as many images as you like to your web server via FTP or WebDAV or use your .Mac account without paying image hosting fees to eBay. (Learn More)\n\neBay Store Support\nUse GarageSale to upload items to your eBay Store. (Learn More) \t\n\nFair Licensing\nWe don&amp;#039;t treat our customers like criminals. No machine ID checking and no phoning home each time you start up GarageSale. (Learn More)\n\nMultiple Accounts\nUse GarageSale for all of your accounts. Just select the account before uploading to eBay. (Learn More) \t\n\nIntegrated Feedback Function\nNow you can leave buyer feedback without ever leaving GarageSale! (Learn More)\n\nBuilt-in Image Editor\nUse the new Image Editor to greatly enhance image quality (Requires Mac OS X 10.4 or higher). (Learn More) \t\n\neBay Motors\nWith GarageSale you can list cars and car parts on eBay Motors. (Learn More)\n\nDashboard Widget\nHave a quick look at your active auctions with our new Dashboard widget (Requires Mac OS X 10.4 or later). (Learn More) \t\n\nAppleScript Support\nBulk change auction attributes with a single click. (Learn More)\n\nCapture Images from iSight\nConnect an iSight to your Mac and capture auction images quickly. \t\n\nPre-Filled Items\nList your items with less hassle and let eBay add product information for books, DVDs, CDs, games and eletronics to your auction. (Learn More)\n\neBay Attributes\nWithout attributes many people will never find your auction. \t\n\nOffline Capability\nEven when disconnected or away from the Internet you can create auctions in GarageSale and upload them when your are back online.\n\nIntegrated Auction Preview\nPreview your auction as it would be appear on eBay. \t\n\nCertified eBay API Client\nGarageSale has been certified by eBay for use with its online auction system. View GarageSales entry in eBays Solutions Directory.\n\nIntuitive interface\nUse GarageSales mac-like user interface to create auctions conveniently. That means no more waiting on eBays webserver to guide you trough to several pages step by step. \t\n\nAuction Tracking\nTrack your running auctions from within GarageSale. GarageSale enables you to see the current bid and bid count, the highest bidder and other information.\n\nDirect from Camera Importer\nImport images directly from your digital camera. \t\n\nAutomator\nCreate and upload auctions or add auction images using Automator (Requires Mac OS X 10.4 or later).\n\nSpotlight\nSearch and find your auction templates with Spotlight (Requires Mac OS X 10.4 or later). \t\n\nGrowl Support\nGarageSale supports the free Growl notification system to display on-screen messages whenever you receive bids or your auction finishes.\n","torrent":{"xt":"urn:btih:663bf5415fec347f3888435a0104bdee984d8008","amp;dn":"Garage+Sale+4.0.6+k+UB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"663bf5415fec347f3888435a0104bdee984d8008","infoHashBuffer":{"type":"Buffer","data":[102,59,245,65,95,236,52,127,56,136,67,90,1,4,189,238,152,77,128,8]},"announce":[],"urlList":[]}}