{"title":"The Awakened Eye by Ross Parmenter [Wesleyan University Press] &amp;","uid":10659820,"size":45059635,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:66b35bea0e7bdac6c6b316a0dbaebb1fee70b11b&amp;dn=The+Awakened+Eye+by+Ross+Parmenter+%5BWesleyan+University+Press%5D+%26&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"brooklyn_bilbao","files":-1,"time":1406707750,"description":"Title: The Awakened Eye\nAuthor: Ross Parmenter\nPublisher: Wesleyan University Press\n\nCopyright Â© 1968 by Wesleyan University\nLibrary of Congress Catalog Card Number: 68-16011\nManufactured in the United States of America\nFIRST EDITION\n\nRoss Parmenter is a man who truly sees; and in this warm, many-faceted, continuously interesting inquiry, he shares the fruits of his heightened vision for our illumination and delight. His new book is a personal adventure in observing the world and in following its visual cues to new knowledge, enriched understanding, and increased wisdom and enjoyment. This is of course a book about seeing, not in its physiological aspects but as a rewarding art that can be learned. Yet it is no dull compendium of abstract speculation or didactic instruction. \n\nDirect and personal, it is in a sense the story of Mr.Parmenter's own awakening: what befell him when he first noticed the odd particularities of face cards (which king brandishes a sword? what is in the spade jack's hand?), or contemplated a brazier of burning wood in a Mexican courtyard, or watched the gulls on the Hudson waterfront, or found himself on a commuting train or in any of a dozen commonplace situations that, closely seen, were not commonplace at all.\n\n\nThroughout, his work glows with odd sparks of information, anecdote, and insight. Through incident after incident, told in sm(X)th flowing, polished prose and lighted by good will and good humor, it leads gradually to the important core of Mr. Parmenter's thought an implicit but powerful aesthetic, a particular view of the world and its workings, and lor whoever wants to find it, a recipe For a more satisfying apprehension of life. \n\nThis book is meant literally as an eyeopener. It coordinates for the general reader the thinking on vision of eye scientists, artists, psychologists, and religious visionaries. (This last integration is particularly pertinent, for Mr. Parmenter takes up the question of how to achieve transfigured vision without resorting to drugs.) Those who take its wisdom to heart will find their lives greatly enriched, and every reader will meet stimulation and pleasure in these pages.\n\nA graduate of the University of Toronto and a native of that city, he became a reporter on the Evening Telegram there in 1933. The next year he joined The New York Times, first as a city reporter, eventually as music editor. Yet the important happenings of his life have come about largely by chance. \n\nHere is his own statement: My retirement from the Times in August, 1964, was almost the first major thing in my life that I intended to have happen. And I planned it a) because thirty years of your life is enough to give to any one institution, and b) because I had so many writing projects to work on that I wanted all my time for them. \n\nThese are the major things that I did not intend:\n\nI did not intend to come to the United States (London was my goal).\n\nI did not expect to be a music critic (though music was the art 1 loved most).\n\nI did not intend to serve in the United States Army and I wish there had been no World War II).\n\nI did not intend to go to Mexico (I went there after the war to recover my bearings), yet it has become my greatest source of literary material.\n\nI did not intend to write a book about a plant (yet such was my first book).\n\nI did not intend to get into anthropology (it has been an outgrowth of my interest in Mexico).\n\nI did not intend to go to the Far East, but because the Times sent me to Japan in 1960 to cover cultural events, I'm now writing a book about a Japanese temple.\n\n&quot;The Awakened Eye&quot; is in a way an outgrowth of what might be called two case studies in visual adventure. The Plant in My Window was the first, and with it I sharpened my visual faculties by observing a philodendron.\n\n&quot;Week in Yanhuitlan&quot; was the second, and here the visual whetstone was an architectural masterpiece of the sixteenth century.Canada, the United States, Mexico, and Japan are the countries where I have lived. 1 keep my apartment in New York but have have living in Mexico most of the time of late.\n\nWESLEYAN UNIVERSITY PRESS","torrent":{"xt":"urn:btih:66b35bea0e7bdac6c6b316a0dbaebb1fee70b11b","amp;dn":"The+Awakened+Eye+by+Ross+Parmenter+%5BWesleyan+University+Press%5D+%26","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"66b35bea0e7bdac6c6b316a0dbaebb1fee70b11b","infoHashBuffer":{"type":"Buffer","data":[102,179,91,234,14,123,218,198,198,179,22,160,219,174,187,31,238,112,177,27]},"announce":[],"urlList":[]}}