{"title":"Pompy de robodoll.DVDr.NLT-Release (DIVx)","uid":4807655,"size":793425237,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6708daac5d89cf5fe89f14b7bde70b3ac5979689&amp;dn=Pompy+de+robodoll.DVDr.NLT-Release+%28DIVx%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"diddle783","files":-1,"time":1238254533,"description":"\n\nNadat de weesjongen Migiel de op hol geslagen Vrijblij, de Fraaimaaier van Professor Vriendelijk, in de stad onschadelijk weet te maken, maakt professor, als dank speciaal voor Migiel een uit conservenblikjes bestaande robot. Migiel geeft dit robotje, Pompy de Robodoll, aan zijn broertje Danny, die in het ziekenhuis ligt. Danny en Pompy worden de beste maatjes. Daar komt verandering in als Danny een ander cadeautje krijgt. Hij ziet Pompy niet meer staan. Verdrietig, verlaat Pompy het huis. Buiten in het bos bevrijdt het robotje de hond Attila die daar, vastgeketend aan een boom, achtergelaten is. Samen trekken de twee verder en beleven ze allerlei avonturen. Het wordt extra spannend als Pompy oog in oog komt te staan met Kruimel Tuimel, de blikvanger. Met zijn grote magneet probeert deze alswaar het blikken robotje te vangen. Maar wanneer Pompy in gevaar is, gaat bij professor Vriendelijk het alarm af en stuurt hij zijn vliegende bol Yaki Yaki er op af, om Pompy te redden. \n\nEen spannende en aandoenlijke film voor jong en oud. \nMet in de hoofrollen: IJf Blokker als professor Vriendelijk en Willem Duyn als Kruimel Tuimel de Blikvanger. Met de stemmen van Bill van Dijk, Cor Witschge en Martine Bijl. \n\nReleasedatum 01 januari 2007 \n\nlet op de orginele cover heb ik er niet van wel een afbeelding!\n\n\nDeze torrent wordt je aangeboden door NLT.ons-Forum het forum.\n\nHet forum met de nieuwste films en muziek en de meest uitgebreide\n\nCollectie DviX torrents. Al onze Film torrents hebben Nederlandse subs of zijn Nederlands Geproken\n\nWe zijn te vinden op:\n &lt;a href=&quot;\nhttp://www.nlt.ons-forum.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.nlt.ons-forum.nl&lt;/a&gt; ","torrent":{"xt":"urn:btih:6708daac5d89cf5fe89f14b7bde70b3ac5979689","amp;dn":"Pompy+de+robodoll.DVDr.NLT-Release+%28DIVx%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6708daac5d89cf5fe89f14b7bde70b3ac5979689","infoHashBuffer":{"type":"Buffer","data":[103,8,218,172,93,137,207,95,232,159,20,183,189,231,11,58,197,151,150,137]},"announce":[],"urlList":[]}}