{"title":"Jackie McLean - Capuchin Swing (1960) [EAC-FLAC]","uid":9791719,"size":286360148,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:6800ee5dfad50196c089aec4b47a780c6846c69f&amp;dn=Jackie+McLean+-+Capuchin+Swing+%281960%29+%5BEAC-FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pucholoco","files":-1,"time":1395257462,"description":"                  Jackie McLean - Capuchin Swing (1960) [EAC-FLAC]\n                   EAC rip (secure mode) | FLAC+CUE+LOG -&gt; 273 Mb \n                           Full Artwork @ 300 dpi (jpg)\n\nSaxman Jackie McLean's explorations of free jazz and the avant-garde were still a couple of years away when he cut this Blue Note album in 1960, but that doesn't mean CAPUCHIN SWING is a by-the-numbers affair by any means. Though its name isn't generally invoked when the tally of hard bop's greatest albums is made, it stands up alongside anything Freddie Hubbard, Hank Mobley, et al were doing at the time. With trumpeter Blue Mitchell proving to be a perfectly matched sparring partner, McLean pushes bop harmonies and structures nearly to the breaking point with his intense improvisations on a batch of original compositions with a couple of outside tunes thrown in. Throughout, McLean stirs the sonic pot in such a fiery fashion, you can just tell something's cooking that he hasn't quite served up yet.\n\nOne of McLean's more underrated albums from a plethora of Blue Note releases, 1960's Capuchin Swing finds the bebop alto saxophonist in fine form on a mix of covers and originals. While McLean's future fascination with Ornette Coleman's free-form innovations can be sensed in some solos here, the majority of the album is in a classic hard bop vein. Like contemporaries Hank Mobley, Sonny Clark, and Lee Morgan, though, McLean doesn't just churn out pat jam-session fare, but comes up with consistently provocative charts and solos. Eschewing any ballad cuts, McLean focuses on mid- to fast-tempo swingers and blues. Standouts include originals like &quot;Francisco&quot; and &quot;Condition Blue&quot; and choice renditions of &quot;Just for Now&quot; and &quot;Don't Blame Me.&quot; McLean enlists a sparkling lineup of hard bop stars, including trumpeter Blue Mitchell, pianist Walter Bishop, Jr., bassist Paul Chambers, and drummer Art Taylor. Mitchell particularly impresses, matching many of McLean's own inspired flights with his supple and progressive playing. Along with other fine Blue Note titles like Jackie's Bag and Bluesnik, Capuchin Swing makes for a great introduction to McLean's extensive catalog.\n\n\n-----------------------------------------------------------------------------------\nTracklist:\n-----------------------------------------------------------------------------------\n\n01. Francisco\n02. Just For Now\n03. Don't Blame Me\n04. Condition Blue\n05. Capuchin Swing\n06. On The Lion\n\n*2002 Blue Note RVG Remaster\n\nPersonnel: \nJackie McLean (alto saxophone) \nBlue Mitchell (trumpet)\nWalter Bishop Jr. (piano)\nPaul Chambers (bass)\nArt Taylor (drums)\n\n\nEnjoy, SEED and SHARING... Thanks!\n","torrent":{"xt":"urn:btih:6800ee5dfad50196c089aec4b47a780c6846c69f","amp;dn":"Jackie+McLean+-+Capuchin+Swing+%281960%29+%5BEAC-FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6800ee5dfad50196c089aec4b47a780c6846c69f","infoHashBuffer":{"type":"Buffer","data":[104,0,238,93,250,213,1,150,192,137,174,196,180,122,120,12,104,70,198,159]},"announce":[],"urlList":[]}}