{"title":"Igor Baranko: The Horde (Humanoids)","uid":8741359,"size":61923943,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:68260aab119ac2c7b101f4d5a58e3eb5baf87031&amp;dn=Igor+Baranko%3A+The+Horde+%28Humanoids%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"fudoh101","files":1,"time":1374796955,"description":"Published by Humanoids 2004\n144 pages\n\nIn the year 1206, Genghis Khan and his Golden Horde dominated an immense territory from the Pacific Ocean to the Caspian Sea with only 150,000 men. In the year 2040, the newest Russian dictator has a unique vision: to invoke the spirit of Genghis Khan and his Golden Horde to create an empire reaching from the Pacific Ocean to the Atlantic. To do this, his secret service must find the corpse of the latest reincarnation of Genghis Khan. Their path will cross with the last Chechen, the survivor of a nuclear holocaust on a mystical quest. He has nothing to lose and fears nothing, especially not the Russian army and secret service.\n\nUkrainian writer/artist Igor Baranko was born in Kiev during the Cold War. After attending art school, Baranko served for two years in the Soviet Army, where he developed a great hatred of military life. He won the US Immigration Lottery in 1999, allowing him to move to the United States and has been creating graphic novels ever since, collaborating with Alexandro Jodorowsky for METAL HURLANT MAGAZINE, Jean-Pierre Dionnet on the sequel to Enki Bilal and Dionnet's EXTERMINATOR 17 and creating his own epic, THE HORDE.","torrent":{"xt":"urn:btih:68260aab119ac2c7b101f4d5a58e3eb5baf87031","amp;dn":"Igor+Baranko%3A+The+Horde+%28Humanoids%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"68260aab119ac2c7b101f4d5a58e3eb5baf87031","infoHashBuffer":{"type":"Buffer","data":[104,38,10,171,17,154,194,199,177,1,244,213,165,142,62,181,186,248,112,49]},"announce":[],"urlList":[]}}