{"title":"Heather Graham - Dead on the Dance Floor (Retail)","uid":10222057,"size":1030000,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:69049dd3ec258e7c5ee099de3c1bfd085358a418&amp;dn=Heather+Graham+-+Dead+on+the+Dance+Floor+%28Retail%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TheRose88","files":1,"time":1401056658,"description":"Heather Graham - Dead on the Dance Floor - Retail (epub)\n\n\nAccomplished dancer Lara Trudeau drops dead of a heart attack brought on by a lethal combination of booze and pills. To former private investigator Quinn O'Casey, it's a simple case of death by misadventure. But when his brother Doug, a Miami-Dade patrolman, asks for help, he can't refuse. Especially when he learns that Lara and Doug--a student at the Moonlight Sonata dance studio where Lara occasionally taught--were having an affair. And despite Quinn's lack of interest in the case and even less in dancing, experience has taught him not to count on the obvious when it comes to murder. Going undercover as a dance student, Quinn meets studio manager Shannon Mackay, a beautiful, graceful woman who has left world-class competition to teach. He also uncovers some disturbing facts. Everyone there had a reason to hate Lara Trudeau, a woman as ruthless as she was talented. As a drama of broken hearts, shattered dreams and tangled motives unfolds, Quinn begins looking for a killer.\n\nIn a city where pleasure drugs are a fast and dangerous high, Quinn is alarmed by the growing number of deaths due to overdoses, illegal substances and execution-style shootings connected to the Moonlight Sonata. Shannon, too, has begun to wonder if strange events surrounding the studio have a deeper source. She suspects she's being followed. Worse, she fears someone may be trying to kill her.\n\nShannon is about to discover the risks she is willing to take to fight for what she wants--to dance, to compete again, to share her life with Quinn. Yet someone has another plan for her, adangerous shadow figure made all the more deadly by wearing the face of a friend. But someone just hadn't counted on Quinn O'Casey--a man who doesn't give up and never backs down, especially when it comes to protecting the woman he loves.","torrent":{"xt":"urn:btih:69049dd3ec258e7c5ee099de3c1bfd085358a418","amp;dn":"Heather+Graham+-+Dead+on+the+Dance+Floor+%28Retail%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"69049dd3ec258e7c5ee099de3c1bfd085358a418","infoHashBuffer":{"type":"Buffer","data":[105,4,157,211,236,37,142,124,94,224,153,222,60,27,253,8,83,88,164,24]},"announce":[],"urlList":[]}}