{"title":"Scarab - Serpents Of The Nile 2015 ak","uid":11721704,"size":134652248,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:69a51318960d24681979d19ee8e4c3a567380d9a&amp;dn=Scarab+-+Serpents+Of+The+Nile+2015+ak&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"analogkid6103","files":8,"time":1424872241,"description":"Genre: Death\nBitrate: 320 k\nSize: 128.41 MB\n\n1. Calling Forth the Ancient Spirits of Kemet\n2. Visions of a Blood River\n3. The Spells of Coming Forth by Day\n4. Serpents of the Nile\n5. Pyramid of Illusions\n6. Funeral Pharaoh\n7. The Afterlife Illusions\n8. Days of a Burial Mask\n\nScarab are an amazing band, and this album -- Scarab's second full-length -- is a record breaker in more than one sense. Firstly, they are from the very heart of Egypt itself, the capital city of Cairo. That means Scarab are the first and only Egyptian band that has ever been worth mentioning, if my memory doesn't betray me, throughout my entire &quot;career&quot; as a reviewer. Second, they will make you ask: Nile who? The American and much more famous, Ancient Egypt-centric Nile will become a distant memory once you listen to this monster of an album. Third, this album made even a hater of guitar leads, such as your humble servant, simply adore guitar leads. Fourth, this is fucking authentic and amazing death metal. That's the second time I use the adjective &quot;amazing&quot; in a single, short paragraph, something that's highly unlikely to ever happen as far as this reviewer is concerned.\n\n_Serpents of the Nile_ is oriental death metal at its finest. If Melechesh are the undisputed kings of Middle-Eastern black metal, then all hail Scarab -- the new masters of Egyptian death metal par excellence.\nThe album is comprised of gorgeous metallic arabesques that substitute the traditional, 'Western' (worn out) riffs; in that sense, this album is a paradigm shift from the basic, rock 'n' roll-oriented attitude most metal musicians hold and execute. It's not like the band occasionally ornament and embellish their form of heavy metal with some sporadic, exotic, Arabian tunes; oh no, they actually play Arabian music that was given a metallic interpretation.\n\nYou cannot and will not fathom how exquisitely beautiful this sounds until you actually listen to the album thoroughly. That's probably also why you're going to love the guitar leads and occasional solos; they are not your usual leads / shreds / whatnot, but metallic Arabesques, heavy metal played almost exclusively on Oriental scales -- dark, sensual and mystical.\nIn a nutshell, Scarab play technical and brutal death metal the way technical brutal death metal has never been played before -- unless I'm missing something.\n\nScarab are sometimes blazingly fast, blasting and grinding, while some time they retreat to the slower, mid-paced rhythm. The band's highly skilled handling of their instruments, like the best of technicians out there, does not stop here; the technical aspect of their music does not sacrifice the atmospheric aspect, and in this case the atmosphere is at all times thick, suffocating yet extremely lush and full-bodied.\n\nThe album is text-driven, in the sense each track is packed with lyrics and the music is basically -- other than where the interludes, song prologues and leads are concerned, of course -- accompanied at all times by the monstrous growler, who is one of the album's highlights and among the best throat performances one will ever hear.\n\nThe more one listens to this album, the deeper one drills into the layers and dimensions of this enigmatic dark beauty -- the more enjoyable it becomes; the melodies start to emerge and make sense, the instrument artistry becomes more evident and the singular atmosphere and epic proportions of this album begin to dawn upon the listener. Each listening session discloses yet another layer, dimension or face this album possesses. Each listen, a revelation of new angels, novel sensations and greater depths. This band's music will take you to that starlit place where myth, religion, mystery, the desert and the Egyptian bright night meet; when myth was part of life, and life itself was mythical.\n\nClever, bold and powerful, _Serpents of the Nile_ is an astounding piece of metallic art, having a genuine tie with its creators' heritage and folklore, mirroring endemic culture that could rather easily be traced to its quite unique geographical spot, a crossroad where East and West, North and South meet; a place where once great things occurred. It seems like great things are starting to happen, again, for the Egyptians, after several millennia of hiatus.\n\n_Serpents of the Nile_ can be easily put on the same pedestal together with Canadian Necronomicon's _Pharaoh of Gods_ and Augury's _Concealed_, but this one is an unexpectedly pleasant surprise equal to the surprise one will register when the Sphinx itself begins to speak.\n\nNile who?","torrent":{"xt":"urn:btih:69a51318960d24681979d19ee8e4c3a567380d9a","amp;dn":"Scarab+-+Serpents+Of+The+Nile+2015+ak","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"69a51318960d24681979d19ee8e4c3a567380d9a","infoHashBuffer":{"type":"Buffer","data":[105,165,19,24,150,13,36,104,25,121,209,158,232,228,195,165,103,56,13,154]},"announce":[],"urlList":[]}}