{"title":"The other side of Heaven (2001) [H264].avi","uid":4149227,"size":667566934,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6afa3fbff1d50701dca71f915b54a5ba4c88c4cc&amp;dn=The+other+side+of+Heaven+%282001%29+%5BH264%5D.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pakmenu","files":1,"time":1208861463,"description":"John H. Groberg (Christopher Gorham), a farm kid from Idaho Falls, crosses an ocean to become a missionary in the remote and exotic Tongan islands during the 1950\\&amp;#039;s. He leaves behind a loving family and the true love of his life, Jean (\\&amp;#039;Anne Hathaway\\&amp;#039;). Through letters and musings across the miles, John shares his humbling and sometimes hilarious adventures with \\&quot;the girl back home\\&quot;, and her letters buoy up his spirits in difficult times. John must struggle to overcome language barriers, physical hardship and deep-rooted suspicion to earn the trust and love of the Tongan people he has come to serve. Throughout his adventure-filled three years on the islands, he discovers friends and wisdom in the most unlikely places. John H. Groberg\\&amp;#039;s Tongan odyssey will change his life forever.\n\nCoded in h264 Advanced Video Coding, at constant quality with mediacoder 6.1\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0250371/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0250371/&lt;/a&gt;\n\nif doesn\\&amp;#039;t play install ffdshow (3mb, allows playback with all players)\nor play with standalone player VLC, it has the codecs built in the player.\n\nFor those who do not know where the Tonga islands are located:\neast of New Zealand in the tropical Pacific Ocean. (yes?)\nwatched the movie as I have a Tongan friend.... \n\nit is amazing the hardships this guy goes though, funny intercultural misunderstandings, otherwise pretty standard story but worth watching,\nnice scenery.\n\nsome other user comments:\n\n---------------------------\nI loved this movie!!! My father is Tongan and my mother is Samoan (the first island Elder Groberg landed at the beginning of his journey). Even though I was born and raised here in the US, I have been exposed to my Polynesian roots and love and embrace both cultures of who I am (Polynesian side and American side).\n\nI have to say that my family and I LOVED this movie. It is refreshing to watch a beautiful movie without all the sex, violence and vulgar material that permeates our society today. This movie is about True Love on so many levels - the love between Elder Groberg and his future bride Jean, the love between the Tongan people and Elder Groberg and the love between Our Lord and his children. No, I\\&amp;#039;m not Mormon, I\\&amp;#039;m actually an Assembly of God Christian, however that does not overshadow my appreciation for this movie.\n\nThe depiction of the people of Tonga is accurate. They are a lighthearted and loving group of people who love to laugh and find joy in the simple things of life. They are all about respect and honoring one\\&amp;#039;s family. The scene of the first funeral brought back memories for me as it illustrated exactly how these kind people handle the departing of a loved one. When my dear Grandmother Siu passed away in 1994, my family and I traveled back to Vava\\&amp;#039;u (an island within the Kingdom of Tonga) to lay her to rest. The unmasked grief and crying as depicted in the movie was exactly how my grandmother\\&amp;#039;s funeral was. The crying and grieving took place for 1 full day (24 hours - day and night) while different groups of people from all the villages on the island, came to pay their last respects.\n\nHats off to Disney for going out on a limb to bring the story of one young man\\&amp;#039;s journey of faith and trials and tribulations of his mission to the big screen! Well done!\n------------------------------------\n\n\nI have read \\&quot;In the eye of the storm\\&quot;, John Groberg\\&amp;#039;s book about his mission to Tonga from which this movie was taken. Although, as is almost invariably the case, the book surpasses the movie in almost every important detail, \\&quot;The other side of heaven\\&quot; was nevertheless an enjoyable movie that was well made, with a good cast and outstanding scenery and effects.\n\nIn most respects, the movie was quite faithful to the book, and the only knock I have is that it seemed to shy away from anything that could not be explained in a worldly way. Although people who are not members of the Church of Jesus Christ of latter-day Saints might be sceptical of the ability of a missionary to heal the sick, I think that it is important to depict a true story in its truest form, and John Groberg truly worked miracles in Tonga. I think that the majority of believers in the world (and most critics seem not to be!) believe in miracles, whether they be through a young mormon missionary or any other faithful follower of God, and I think this would have only enhanced the story. Granted, since Hollywood was funding it, they probably have a different opinion then I do! One notable exception in the movie was when he was sinking in the water after they jumped form the boat in the storm, and it seemed that a hand came and pulled him up, but no one was there. Although it was not clearly stated, I think they were insinuating that the Lord was helping him, and it was nice to see they didn\\&amp;#039;t ignore that aspect altogether.\n\nAnyway, aside from all of that, it was an enjoyable movie that I think the whole family can watch and marvel at the difficulties people can face, and overcome, in their lives if they have the courage to try.\n\n-------------------------------------------\nI\\&amp;#039;m sorry that the adolescent ravings of the previous reviewer appear first. His profound failure to \\&quot;get it\\&quot; is an embarrassment.\n\nFirst of all, this is about a young man of \\&quot;white-bread\\&quot; heritage casting aside all he has and all he is, even leaving the love of his life for two and a half years, in order to immerse himself in a culture about which he is totally ignorant so that he can offer them the greatest gift he has to offer: His faith.\n\nRather than \\&quot;looking down\\&quot; on the people he has come to SERVE, he bears great hardships, and exerts himself in ways he could never have conceived, in order to connect with these people. He comes to love them, profoundly.\n\nAnd their love for him in return, even those who have reason to be suspicious of him, is a testament to his sincerity.\n\nPlease recall that this is a TRUE STORY. Whatever you might think of John Groberg\\&amp;#039;s religion, or his motives, the fact is that these things actually happened in just this way. He DID travel from Idaho to Tonga, he did live among the people there, he did come to gain their trust, he did bring to them a precious gift of faith, and he did return often throughout the rest of his life, with his wife and family, to be among these people whom he loved.\n\nThat anyone could be so callously dismissive of this truth is a sad commentary on our \\&quot;post-Christian\\&quot; society.\n\nBut I found this film to be deeply moving and very satisfying, and I recommend it highly to those who enjoy inspiring film.\n-----------------------------------------\n\n","torrent":{"xt":"urn:btih:6afa3fbff1d50701dca71f915b54a5ba4c88c4cc","amp;dn":"The+other+side+of+Heaven+%282001%29+%5BH264%5D.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6afa3fbff1d50701dca71f915b54a5ba4c88c4cc","infoHashBuffer":{"type":"Buffer","data":[106,250,63,191,241,213,7,1,220,167,31,145,91,84,165,186,76,136,196,204]},"announce":[],"urlList":[]}}