{"title":"CHRIS CORNELL-SCREAM(2009)Full Album Continuity [320/60min]","uid":4734191,"size":144327084,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:6b4d9b9473e8f04ff0e86063ef020eb7bed89b94&amp;dn=CHRIS+CORNELL-SCREAM%282009%29Full+Album+Continuity+%5B320%2F60min%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"stylishirish","files":-1,"time":1235195131,"description":"*** As of March some 700+ people have downloaded this torrent, yet there has rarely been even 50 seeds -- PLEASE SEED IT FOR AWHILE AFTER YOUR DOWNLOAD!!! Thank You!!\n\nTHIS ALBUM WAS RECORDED AND PUT TOGETHER TO BE SEAMLESS - A NON-STOP FLOW OF MUSIC FROM THE START, ONE SONG INTO THE NEXT, TO THE END - THIS TORRENT COMPLIMENTS THE INTENTION OF THE ARTIST AND THE PRODUCER BY KEEPING IT ALL TOGETHER AS ONE TRACK\n\nTORRENT CONTAINS THE ALBUM, COVER, AND .NFO FILE:\n\nChris Cornell (Scream).mp3    137 MB \nScream (2009).nfo             502 B \nScream (Cover).jpg            285 KB\n\nScream is the 3rd solo studio album from American musician Chris Cornell.\nThis is the FULL ALBUM VERSION - meaning there is ONE TRACK and all the songs flow into one another for the ENTIRE 60 MINUTES. This IS the way that Cornell and Timbaland intended the album to be heard - so put it on in the car or listen to it with headphones the whole way through. Back in the day they used to put the song timing on the record - and with cassettes you only had fwd or rwd... the timing of all the songs are noted below - again, this is ONE FLUID TRACK!\n\nArtist     Chris Cornell\nProducer   Timbaland\nReleased   March 10, 2009\nRecorded   2008\nGenre      Pop, Alternative, R&amp;B\nLength     60:00 Min\nLabel      Mosley, Interscope, Universal\nEncoded    320 Kbps MP3\nFile Size  137 MB\n\nCornell first came into contact with Timbaland through the suggestions and connections within their respective families -and the collaboration evolved into the duo writing and recording an entire album in just six weeks, notably with the conceptual direction of &quot;tying it all together musically&quot;, which Cornell describes as &quot;[harkening] back to albums that I listened to when I was a kid, where the music never stops&quot; and that it &quot;begs to be listened to on headphones all the way through&quot;. Although the writing and recording was finished within 6 weeks, Timbaland continued to work his magic for around 6 months until the album became what it is today.\n\nCHRIS CORNELL - SCREAM (2009)\nFull Album (Single Track) Version\n\n\n       Album Intro              (00:00)\n\nSongs:\n\n1    - Part Of Me               (00:53)\n2    - Time                     (05:20)\t\t\t\n3    - Sweet Revenge            (09:59)\n4    - Get Up                   (14:09)\n5    - Ground Zero              (17:44)\n6    - Never Far Away           (20:54)\n7    - Take Me Alive            (26:00)\n8    - Long Gone                (30:36)\n9    - Scream                   (35:52)\n10   - Enemy                    (42:06)\n11   - Other Side Of Town       (46:41)\n12   - Climbing Up The Walls    (51:30)\n13   - Watch Out                (55:43)\n\n       End Of Album             (59:30)\n\n\n\n\nThis album is getting mixed reviews. Personally, I love the man's work and have followed his entire career. This album is definitely NOT your father's Cornell - you know, he's been around long enough to make that statement a possible truth... Dad remembers 'Screaming Life' and his son is blowing up 'Scream'\n\nThis is a surprisingly good record - everything comes together fairly perfectly. Timbaland and Cornell have put everything together quite nicely with a little help from some friends - such as Justin Timberlake on 'Take Me Alive'. The obvious favorites are 'Scream' and 'Long Gone' - but I also think songs like 'Sweet Revenge' and 'Ground Zero' and 'Climbing Up The Walls' and... well, you know - this whole record is actually very solid. \n\nAND, since it is the kind of music that is at its very best when the quality is at its very best - PLEASE GO OUT AND BUY THE CD IF YOU LIKE IT! You will get perfect quality and the same seamless flow of music -AND- more convenient individual tracks :)\n\nENJOY... AND IF YOU LIKE IT - PLEASE SEED IT!","torrent":{"xt":"urn:btih:6b4d9b9473e8f04ff0e86063ef020eb7bed89b94","amp;dn":"CHRIS+CORNELL-SCREAM%282009%29Full+Album+Continuity+%5B320%2F60min%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6b4d9b9473e8f04ff0e86063ef020eb7bed89b94","infoHashBuffer":{"type":"Buffer","data":[107,77,155,148,115,232,240,79,240,232,96,99,239,2,14,183,190,216,155,148]},"announce":[],"urlList":[]}}