{"title":"Guns N' Roses - Greatest Hits (2004) WMA320","uid":6050283,"size":221212661,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:6be92a8104095b773c9388218e15352b53c3e6f6&amp;dn=Guns+N%5C%27+Roses+-+Greatest+Hits+%282004%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MARCELODRGZ","files":-1,"time":1292700292,"description":"Guns `N' Roses is probably the best and most important rock band of the last twenty-five or so years, and their continuing popularity ensures a large Greatest Hits market. This CD's title may be strictly accurate in regard to hit singles, but after Appetite for Destruction, Guns rarely released their best songs as singles; indeed, they often made bizarre choices. This is therefore a very poor and distinctly unrepresentative picture of - certainly not a Best Of, as Greatest Hits usually claim to be. It is fine for extremely casual fans, as the first five cuts plus &quot;November Rain&quot; are the Guns songs most played on radio; anyone wanting those plus a few more can get them here conveniently and easily. Everyone else, though, is poorly served. First, hits or not, several cuts - &quot;Yesterdays&quot; especially - are not among the band's best. Second, the inclusion of five covers among fourteen tracks - more than one third of the total - is truly strange. Even stranger is that the last three cuts, as well as four of the last five, are covers. This is particularly exasperating in that many excellent Guns songs are missing. Their &quot;Knockin' on Heaven's Door&quot; is of course a signature essential, and their &quot;Live and Let Die&quot; is played fairly often on radio and thus should arguably be here, but the rest should have been left off. Two (&quot;Ain't It Fun&quot; and &quot;Since I Don't Have You&quot;) are from The Spaghetti Incident, a covers album universally considered the band's least good pre-Chinese Democracy effort. The latter is actually quite good, but the former's inclusion is simply inexplicable. Both should probably have been left off for Guns-written songs; at the very least, &quot;Since&quot; alone should have been included if each album was to be represented. The band's &quot;Sympathy for the Devil&quot; is also one of their lowest moments, a soundtrack entry presumably here only to attract those with all the albums. However, hard-cores will have it anyway, and no one else will care for it. There is indeed nothing previously unreleased or even fancy packaging to attract diehards, meaning only the extremely casual should even consider this. The low price is certainly attractive, but the bottom line is that Appetite is one of the greatest albums ever, and the Use Your Illusions have many superb moments. All three are essential, containing everything of real value here plus far more; they will cost a little more, but the investment is very worthwhile. \n\nby Bill R. Moore\n\nTRACKLIST:\n\n01 - Welcome To The Jungle.wma                    \n02 - Sweet Child O' Mine.wma                      \n03 - Patience.wma                                 \n04 - Paradise City.wma                            \n05 - Knockin' On Heaven's Door.wma                \n06 - Civil War.wma                                \n07 - You Could Be Mine.wma                        \n08 - Don't Cry (Original).wma                     \n09 - November Rain.wma                            \n10 - Live And Let Die.wma                         \n11 - Yesterdays.wma                               \n12 - Ain't It Fun.wma                             \n13 - Since I Don't Have You.wma                   \n14 - Sympathy For The Devil.wma   \n\nWMA 320Kbps 44100Hz STEREO","torrent":{"xt":"urn:btih:6be92a8104095b773c9388218e15352b53c3e6f6","amp;dn":"Guns+N%5C%27+Roses+-+Greatest+Hits+%282004%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6be92a8104095b773c9388218e15352b53c3e6f6","infoHashBuffer":{"type":"Buffer","data":[107,233,42,129,4,9,91,119,60,147,136,33,142,21,53,43,83,195,230,246]},"announce":[],"urlList":[]}}