{"title":"The Universe Doesn't Give a Flying Fuck About You","uid":14247399,"size":146406,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6cd06149503c320662145a586dbff83a87a3ac9d&amp;dn=The+Universe+Doesn%27t+Give+a+Flying+Fuck+About+You&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dwizzlex10","files":1,"time":1460161649,"description":"If you walk around every day on eggshells, nervous about making a mistake or looking stupid, then you should read this. \r\n\r\nIf you have a &quot;next big thing&quot; in mind you want to do because you know it will be awesome (starting the business, making the big move, launching the nonprofit, writing the book) but are afraid of doing what it would take to make that thing happen, then you should read this. \r\n\r\nThe universe is very big. You are very small. In fact, you're so small and so insignificant in the big picture that you don't even register to the eye of the cosmos. The universe was here before you were born and will be here long after you're gone, and your life is but a blip on its vast, vast radar. If your life is to matter, it's not going to matter to the universe. It's up to you make your life matter in the only way you can: by doing things that make a difference to you, to those around you, and to those whose lives you touch. Time is short. You have exactly NOW to do whatever it is you're here to do, or to let the inexorable passage of hours and days and years kill your potential like fruit left to die on a vine","torrent":{"xt":"urn:btih:6cd06149503c320662145a586dbff83a87a3ac9d","amp;dn":"The+Universe+Doesn%27t+Give+a+Flying+Fuck+About+You","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6cd06149503c320662145a586dbff83a87a3ac9d","infoHashBuffer":{"type":"Buffer","data":[108,208,97,73,80,60,50,6,98,20,90,88,109,191,248,58,135,163,172,157]},"announce":[],"urlList":[]}}