{"title":"Hawkwind friends &amp; relations volume 3","uid":4816362,"size":69435738,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:6d3d8ec5d19f52373eaed2ba5a4d7ad7fc4c3215&amp;dn=Hawkwind+friends+%26+relations+volume+3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Umuzungu","files":8,"time":1238544463,"description":"Here's one that's gone missing everywhere due to copyright ... problems. This album has been around for sale only for 6 weeks I believe. So I feel like I am a lucky smthng.\n\nFirstly, most of the songs can be found on rareties, but not all, and secondly Psychedelia lives is a bit without a tail there. \n\nAnd it is the firstly I wanna share with all the poor Hawkfans that have to miss only one of the best albums there is!\n\nAs especially the tail of Spychedelia lives it gives .. well .. the edge to the ... stinking noise, and Cabinet key ... get's you into a psychosis.\nNot to mention Wired up for sound.\n\nEven though I have been stupid enough to get only the 128 bitrate to these mp3's, I go redo it for the full 320 for my fellow Hawkcreatures, I do have remastered it with the removal of noise from the cd tracks that I lifted from rareties, as well, give it a brake guys. \nYou can seed out anything you want, but copying a cd and putting it here is the easy way out. Hawkwind ain't cut up in pieces just like that! You need to work on it! Cd's aren't perfect. Please process it a bit before you upload. So one doesn't hear anymore the wind in the trees. There are plenty of programs that make your life easy. Or is it you ARE lazy? Not for this ... And besides, you are unemployed anyway, so what stops you doing nothing even more?\n\nIt is properly tagged, only I forgot when was the year. But you can always improve on the tagging yourself, don't you?\n\nIf you don't like this music, don't seed and just delete.\nIf you wanna keep it, well, you can't buy. I suggest to buy a few tickets to a concert and sell it under the price to people waiting in the line. It always gave me a shipload of free beers! Or buy a few albums and give them away. \n\nI do not have the lyrics complete, but as far as they are there, they are complete.\n\nTo get the lyrics complete you have to wait a bit, as for some odd reason I can't include them.\n\n\nNow go enjoy one of the best albums all time. You need it.\n\n\n\nUmuzungu","torrent":{"xt":"urn:btih:6d3d8ec5d19f52373eaed2ba5a4d7ad7fc4c3215","amp;dn":"Hawkwind+friends+%26+relations+volume+3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6d3d8ec5d19f52373eaed2ba5a4d7ad7fc4c3215","infoHashBuffer":{"type":"Buffer","data":[109,61,142,197,209,159,82,55,62,174,210,186,90,77,122,215,252,76,50,21]},"announce":[],"urlList":[]}}