{"title":"The Dark Side of Calvinism - George Bryson","uid":11773424,"size":2056169,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6e37571871a9a10b32393060028399127b9c9e7b&amp;dn=The+Dark+Side+of+Calvinism+-+George+Bryson&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"starxteel","files":1,"time":1427167410,"description":"\nThe Dark Side of Calvinism. A biblically based examination, and refutation of the Reformed Doctrine of Redemption and Reprobation.\n\nThe Dark Side of Calvinism by George Bryson is another light in the spectrum of books dispelling the gloom of Calvinism. Up until a few years ago, there were very few books challenging the labyrinth of Calvinistic logic, but recently, several books have been written, each with their own strengths. Laurence Vance?s The Other Side of Calvinism is an excellent source for seeing in their own words what Calvinists teach and believe. C. Gordon Olson?s Beyond Calvinism and Arminianism: An Inductive, Mediate Theology of Salvation contains some of the strongest exegetical arguments against Calvinism that exist. Dave Hunt added his weight with the striking book What Love Is This?\n\nBryson?s book is a mixture of these others. Like Vance, he has numerous quotes from Calvinistic authors. Like Olson, he includes exegetical arguments. Like Hunt, he employs logic to show the illogic of Calvinism. Bryson?s real strength, however, is in the tone of the book. His book is full of grace. Of all the books written against the so-called ?Doctrines of Grace? his is the most gracious. This is an amazing feat considering that his primary purpose was to show the scriptural abuses, logical sinkholes, and foreboding theological implications inherent in the Calvinistic system.\n\n\nAbout the author:\nLike thousands of others in ministry today, he came to faith in Christ through the ministry of Pastor Chuck and Calvary Chapel of Costa Mesa in 1968. He became the senior Pastor of Calvary Chapel of Eugene-Springfield. In the very early eighties he added to his pastoral duties a daily (21/2 hour) call-in Christian talk show, called scripturally Speaking. In 1988 he embarked on his first mission to the former Soviet Union. These were the latter years of perestroika and glasnost and were exciting to say the least. In 1991, the Soviet Union dissolved and the doors opened wide for the Gospel.\n\nLike a lot of Calvary Chapel pastors, after a few years in the ministry, he decided to continue his study of scripture and theology in a more formal fashion. Eventually he found myself in a graduate level study of New Testament and Systematic theology. He has written articles and books (of a theological nature) published by the two main publishing arms of Calvary Chapel","torrent":{"xt":"urn:btih:6e37571871a9a10b32393060028399127b9c9e7b","amp;dn":"The+Dark+Side+of+Calvinism+-+George+Bryson","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6e37571871a9a10b32393060028399127b9c9e7b","infoHashBuffer":{"type":"Buffer","data":[110,55,87,24,113,169,161,11,50,57,48,96,2,131,153,18,123,156,158,123]},"announce":[],"urlList":[]}}