{"title":"TrickySpa - Paisley Parker (Tricky Stepdaughter At It Again) NEW","uid":12513767,"size":283577775,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:6fb0b1c8d97bb6218f416d975f2ec9f3e08bd736&amp;dn=TrickySpa+-+Paisley+Parker+%28Tricky+Stepdaughter+At+It+Again%29+NEW&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"xxxlavalxxx","files":2,"time":1443615089,"description":"Being sent to the dog house is a term all men know at one time or another, but especially Eric. Punished by his wife, he sits in the spare bedroom moping only wishing his wife could understand he was innocent and all her paranoia that he was fooling around with her daughter Paisley Parker was just humbug. She walks into the guest room, comforting her step dad and his predicament and offers him a relaxing massage to ease the tension and maybe get his mind off of things for a moment. He could use a soothing back rub, after all, he is the good-guy in this and didn't deserve being bullied by her mother! Masterson convinces himself that this simple gift from his stepdaughter is absolutely harmless and well deserved. Paisley's intentions are to make her daddy feel good, reassuring him that he was such a sweet man and her mother was a fool if she didn't love him. His stepdaughter wants to make sure she would massage every inch of his horny body, including his cock. No body part should be excluded. She begs to have her daddy's cock to deepthroat and then rub his hard cock over her perky tits filling her mouth with his thick cum. This joy would quickly come to a halt, being interrupted by her stepgranddad Jake Jacobs who busts in and catches the two. Daddy jumps out of bed, ashamed that his own daddy caught them, but she has no shame, expressing her love through sex and pleasure, which is something Jake experiences first hand.\r\nTags: Brunette, Blowjob, Deepthroat, Hardcore, Natural Tits, Stockings, Massage, Open Mouth Facial, Reality, Stepdad, Family Roleplay\r\n \nhttp://imgdone.com/viewer.php?file=01700076533126969289.jpg\r\n \nhttp://imgdone.com/viewer.php?file=35715235752107681049.jpg","torrent":{"xt":"urn:btih:6fb0b1c8d97bb6218f416d975f2ec9f3e08bd736","amp;dn":"TrickySpa+-+Paisley+Parker+%28Tricky+Stepdaughter+At+It+Again%29+NEW","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6fb0b1c8d97bb6218f416d975f2ec9f3e08bd736","infoHashBuffer":{"type":"Buffer","data":[111,176,177,200,217,123,182,33,143,65,109,151,95,46,201,243,224,139,215,54]},"announce":[],"urlList":[]}}