{"title":"The Bible Series - Louie Giglio - Passion Talk Series 2009 DVD9","uid":15992808,"size":4708463645,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:706477194ad4e78d0826de5cf39b04e715b6bba9&amp;dn=The+Bible+Series+-+Louie+Giglio+-+Passion+Talk+Series+2009+DVD9&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"POtHS11","files":26,"time":1476035304,"description":"The Bible Series - Louie Giglio - Passion Talk Series 2009 DVD9\r\n\r\n\r\n Passion Talk Series: The Essential Collection includes 4 full length talks and nearly 4 hours of compelling content from Passion Founder, Louie Giglio. The collection of talks have been experienced by millions around the world. Each talk tells a meaningful story of God's goodness, grace &amp; love. This special package, includes 4 full length talks which will inspire, encourage &amp; speak to God's grace &amp; truth.\r\n\r\nIndescribable (43 Mins)\r\nThe heavens are telling the glory of God, and their expanse declares the work of His hands. Indescribable takes us on an image-rich journey through the cosmos, allowing us to peer into God's universe to discover the amazing magnitude of His greatness and grace.\r\n\r\nHow Great Is Our God (40 Mins)\r\nOur life is a miracle, and the Creator of the universe knows each of us by name. He's big enough to breathe out stars, yet intricate enough to fashion together the trillions of cells that make up every facet of who we are. And he cares about each of us &amp; promises to carry us through. He will hold onto you and hold you together, giving strength to those who hope in His unfailing love.\r\n\r\nSymphony (I Lift My Hands) (52 Mins)\r\nIt's staggering when we begin to realize that all creation is singing to praises of the One who fashioned and formed the universe. Yet, singing stars and earth's ovation cannot drown God's desire to hear your voice. In the mist of a miraculous and immense symphony of praise, God is still mindful of you, going to extraordinary lengths to give you life and breath through His Son.\r\n\r\nMoved By Mercy (50 Mins)\r\nA father. A son. And a dance floor. How far can we run from God? Can we ever do enough to make Him give up on us? Moved By Mercy transports us to the heart of the conflict between the crippling feeling of guilt and the lavishness mercy, and shows us how a Father's love can overcome all wrongs","torrent":{"xt":"urn:btih:706477194ad4e78d0826de5cf39b04e715b6bba9","amp;dn":"The+Bible+Series+-+Louie+Giglio+-+Passion+Talk+Series+2009+DVD9","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"706477194ad4e78d0826de5cf39b04e715b6bba9","infoHashBuffer":{"type":"Buffer","data":[112,100,119,25,74,212,231,141,8,38,222,92,243,155,4,231,21,182,187,169]},"announce":[],"urlList":[]}}