{"title":"The Day the Universe Changed - James Burke for Kindle","uid":12036584,"size":19108931,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:70de56a787679c486a2659d058ab8eb9f699a3a4&amp;dn=The+Day+the+Universe+Changed+-+James+Burke+for+Kindle&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"manav32","files":3,"time":1434693902,"description":"Goodreads : In The Day the Universe Changed, James Burke examines eight periods in history when our view of the world shifted dramatically: in the eleventh century, when extraordinary discoveries were made by Spanish crusaders; in fourteenth-century Florence, where perspective in painting emerged; in the fifteenth century, when the advent of the printing press shook the foundations of an oral society; in the sixteenth century, when gunnery developments triggered the birth of modern science; in the early eighteenth century, when hot English summers brought on the Industrial Revolution; in the battlefield surgery stations of the French revolutionary armies, where people first became statistics; in the nineteenth century, when the discovery of dinosaur fossils led to the theory of evolution; and in the 1820s, when electrical experiments heralded the end of scientific certainty. Based on the popular television documentary series, The Day the Universe Changed is a bestselling history that challenges the reader to decide whether there is absolute knowledge to discover - or whether the universe is &quot;ultimately what we say it is.&quot;","torrent":{"xt":"urn:btih:70de56a787679c486a2659d058ab8eb9f699a3a4","amp;dn":"The+Day+the+Universe+Changed+-+James+Burke+for+Kindle","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"70de56a787679c486a2659d058ab8eb9f699a3a4","infoHashBuffer":{"type":"Buffer","data":[112,222,86,167,135,103,156,72,106,38,89,208,88,171,142,185,246,153,163,164]},"announce":[],"urlList":[]}}