{"title":"The Stalin and Molotov Lines: Soviet Western Defences 1928-41","uid":11936490,"size":28636194,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:72b86bd2188f24afcf2948efaf4495f9d69fae52&amp;dn=The+Stalin+and+Molotov+Lines%3A+Soviet+Western+Defences+1928-41&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1431904377,"description":"During the Russian Civil War, the Red Army created a series of fortified areas, or ukreplinnyje rajony (UR), which were to be used not only for defence but were also to act as staging points for offensive operations. Following the end of the war these defences were extended, creating a front that stretched over 2,000km from the Baltic to the Black Sea, that consisted of more than 3,000 positions from forts to machine gun and antitank positions, emplaced tank turrets, and observation and command positions. By the outbreak of World War II, these defenses - known as the Stalin Line - were largely complete.\n\nHowever, after the Soviet occupation of eastern Poland in October 1939 the Stalin Line was too far behind the new border to be of use as a springboard for an offensive. So, a new set of defenses was begun, named after the Soviet Foreign Minister, Molotov. Equipment was stripped from the Stalin Line, but only 25 percent of the positions had been completed by the time of the German invasion in June 1941 and it proved no match for the Wehrmacht - positions were mostly empty or simply bypassed during the advance. Illustrated with cutaway artwork and rare photographs this book provides a detailed examination of the development of these defensive lines, and the fighting that took place around them in 1941, and is packed with detail and information that is not readily available in the English","torrent":{"xt":"urn:btih:72b86bd2188f24afcf2948efaf4495f9d69fae52","amp;dn":"The+Stalin+and+Molotov+Lines%3A+Soviet+Western+Defences+1928-41","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"72b86bd2188f24afcf2948efaf4495f9d69fae52","infoHashBuffer":{"type":"Buffer","data":[114,184,107,210,24,143,36,175,207,41,72,239,175,68,149,249,214,159,174,82]},"announce":[],"urlList":[]}}