{"title":"The Wind (1928)","uid":4948976,"size":1576714681,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:72bebf3bce1e90c34768a78e9bfaf1c9bd07ee50&amp;dn=The+Wind+%281928%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Willams","files":19,"time":1244798645,"description":"The Wind (1928)\n\n\nThe Wind (1928) is an American dramatic silent film directed by Victor SjÃƒÂ¶strÃƒÂ¶m. The movie was adapted by Frances Marion from the novel The Wind written by Dorothy Scarborough. It features Lillian Gish, Lars Hanson, Montagu Love, Dorothy Cumming, and others. It was one of the last silent films released by Metro-Goldwyn-Mayer.\n\nOne could argue that the true protagonist of The Wind is the wind itself, a mournful sandstorm that almost drives Gish's character insane. She plays Letty Mason, a lonely Virginia woman who travels by train to the Texas ranch of her cousin, Cora (Dorothy Cumming.) While on the train, Letty strikes up a flirtation with Roddy (Montagu Love), a Fort Worth man who implies that he might want to marry her. Later, at the ranch, Cora grows jealous of Letty when she develops a friendship with her husband (Edward Earle.) She accuses Letty of trying to steal him away from her, and kicks her out of the house.\n\nWhen Letty discovers, much to her dismay, that her train-ride suitor, Roddy, already has a wife, she marries an awkward cowboy named Lige (Lars Hanson.) Lige understands that Letty doesn't love him, but he still wants to take care of her until he can earn enough money to send her back to Virginia. It would be ruining things to say what happens next, but Letty's story is an unforgettably harrowing tale of betrayal, murder, and, finally, redemption. The wind blows remorselessly throughout, serving as a reminder of her tortured psychological state. At one point, it literally (and, in filmmaking terms, quite brilliantly) uncovers her darkest secret.\n\nGish came with the idea of making a film adaption of the novel of the same name. Irving Thalberg immediately gave her permission to do so. Gish recalled wanting Lars Hanson as her leading man after having him seen in a Swedish film with Greta Garbo. She also assigned Victor SjÃƒÂ¶strÃƒÂ¶m as the director herself. SjÃƒÂ¶strÃƒÂ¶m directed Gish before in the 1926 movie The Scarlet Letter.\n\nThe film was shot partially near Bakersfield and the Mojave Desert, California. The off-key happy ending of the film that was released was added at the insistence of Metro-Goldwyn-Mayer Studios, who refused to approve the novel's logical ending in which Gish's character wandered into a windstorm and died.\n\nIn 1993, the film was selected for preservation in the United States National Film Registry by the Library of Congress as being &quot;culturally, historically, or aesthetically significant.&quot;\n\nThis torrent contains the extras extracted from DVD, some stills, covers and posters of the film, and externals spanish, french and italian subtitles. \n\n\nIMDB: 8.5/10\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0019585/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0019585/&lt;/a&gt;\n\n*****************************FREAKYFLICKS*****************************\n\nFreakyFlicks is a free and open community dedicated to preserving and\nsharing cinematic art in the digital era. Our goal is to disseminate\nsuch works of art to the widest audience possible through the channels\nprovided by P2P technology.\n\nThe FreakyFlicks collection is limited to those films that have played\nan exceptional role in the history of cinema and its progression in\nbecoming a great art. Films that are usually described as classic,\ncult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them\nand participate in our community. All you need do is include this tag\nin your upload and join us at the forum to announce your release.\n       \n \n            &lt;a href=&quot; http://freakyflicks.proboards54.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://freakyflicks.proboards54.com&lt;/a&gt;\t\n\t\n\n*****************************FREAKYFLICKS*****************************\t\t","torrent":{"xt":"urn:btih:72bebf3bce1e90c34768a78e9bfaf1c9bd07ee50","amp;dn":"The+Wind+%281928%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"72bebf3bce1e90c34768a78e9bfaf1c9bd07ee50","infoHashBuffer":{"type":"Buffer","data":[114,190,191,59,206,30,144,195,71,104,167,142,155,250,241,201,189,7,238,80]},"announce":[],"urlList":[]}}