{"title":"The Benchwarmers(2006)DVDRip.AC3(ENG)-DROCK","uid":6171882,"size":733942589,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:72e47481565b9a90ae2463c73f8e66845d9a1c51&amp;dn=The+Benchwarmers%282006%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"drock232","files":-1,"time":1297613668,"description":"Three guys with little athletic ability strike a blow for everyone chosen last at recess in this comedy. Clark (Jon Heder), Gus (Rob Schneider), and Richie (David Spade) are three geeky guys who have spent most of their lives being humiliated by bullies and taunted by people with greater hand-eye coordination than they possess (which is nearly everyone). While the three guys love baseball, they've been treated like losers on the diamond ever since their days riding the pine in Little League. One day they stop by a softball field at a local park and a bunch of kids practicing for Little League tryouts try to heckle them into going home. Clark, Gus, and Richie challenge the kids to a game -- three against nine -- and miraculously don't entirely humiliate themselves. Mel (Jon Lovitz), a guy with an athletically-challenged son of his own, is impressed with the nerdy trio's nerve, and offers to set up a tournament in which the three inept grown-ups will take on the best Little League teams from around the state. Clark, Gus, and Richie accept the offer, and they soon become unlikely heroes to the bullied, clumsy, and awkward everywhere. The Benchwarmers also stars Craig Kilborn, Tim Meadows, Molly Sims and Reggie Jackson. \n\nRipped with Handbrake.","torrent":{"xt":"urn:btih:72e47481565b9a90ae2463c73f8e66845d9a1c51","amp;dn":"The+Benchwarmers%282006%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"72e47481565b9a90ae2463c73f8e66845d9a1c51","infoHashBuffer":{"type":"Buffer","data":[114,228,116,129,86,91,154,144,174,36,99,199,63,142,102,132,93,154,28,81]},"announce":[],"urlList":[]}}