{"title":"Sudarshan Kriya - Sri Sri Ravi Shankar - Gene Espression Profili","uid":4356840,"size":94778,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:76507c8c51533ccb9ac32c5359c0e65029f5bf6a&amp;dn=Sudarshan+Kriya+-+Sri+Sri+Ravi+Shankar+-+Gene+Espression+Profili&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"welovesrisri","files":1,"time":1219449175,"description":"Gene Expression Profiling in Practitioners of Sudarshan Kriya\n\nNeeta Singha, Himani Sharmaa, Palika Dattaa,Archna Singha, Sudip Sena,\nNarendra Kumar Bhardwajb and Vinod Kochupillaib.\n\nDepartment of Biochemistry, All India Institute of Medical Sciences,\nDepartment of Medical Oncology, B.R. Ambedkar\n\nInstitute Rotary Cancer Hospital, AIIMS, New Delhi\n\nDr. Neeta Singh, Prof. Dept. of Biochemistry, AllMS New Delhi, received her PhD in Biochemistry from Delhi University. In 1979 she was a post doctoral fellow at Neuro Chemical Institute, Denmark and in 1983. Swiss Institute for\nexperimental Cancer Research Switzerland and also she was visiting associate at National Cancer Institute, U.S.A. She was awarded (DANIDA) Danish Govt. fellowship by Swiss Govt., ICRETT award of International union against cancer in\n1989, 1997 and UNDP award. She has membership of National Academy of Medical Sciences India, UICC American Association for Research. During her career spanning 29 years she had varied organizational teaching and research experience\nwith 100 research publications to her credit. She also guided 17 PhD students and 10 MD students.\n\nIntroduction :\n\nThe human body is constantly under various kinds of stress and attack by reactive oxygen species (ROS) either generated by external agents or during normal metabolic process. ROS can damage cellular functions by damaging lipids, proteins and DNA in the cell [1, 2]. \n\nIncreasing evidence suggests that chronic psychosocial stress may increase oxidative stress which in turn may contribute to the pathophysiology of atherosclerosis, coronary heart disease, cancer and other chronic diseases [3,4]. \n\nCells can transduce stress into biochemical signals. Numerous cellular functions can be influenced by the presence of stress. Several genes and pathways of stress signalling molecules are found to be activated under conditions of stress. \n\nSome of them being heat shock proteins, mitogen-activated protein kinases, stress-activated protein kinases and molecules involved in the oxidative stress pathway [5]. Meditation, SK and other techniques have been known to relieve stress by causing a relaxation response, a complex compensatory mechanism. SK is a breathing technique involving breathing in three different rhythms [6]. \n\nWe have shown earlier [6] that SK helps lower blood lactate levels and provides better antioxidant defense. However, the biochemical effects and the signal transduction pathways of stress removal have not been studied. \n\nIn this study an attempt has been made to study the effect on long term practitioners of SK on genes involved in oxidative stress, DNA damage, cell cycle control, aging, apoptosis and several pathways of stress signalling molecules.","torrent":{"xt":"urn:btih:76507c8c51533ccb9ac32c5359c0e65029f5bf6a","amp;dn":"Sudarshan+Kriya+-+Sri+Sri+Ravi+Shankar+-+Gene+Espression+Profili","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"76507c8c51533ccb9ac32c5359c0e65029f5bf6a","infoHashBuffer":{"type":"Buffer","data":[118,80,124,140,81,83,60,203,154,195,44,83,89,192,230,80,41,245,191,106]},"announce":[],"urlList":[]}}