{"title":"Great Interview Tips","uid":9602542,"size":203772,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:7672f5b1eb99038f5fbdf07423a9c95ba5f7d3aa&amp;dn=Great+Interview+Tips&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mrweaponx","files":1,"time":1392147188,"description":"Great Phone Interview Tips\nBrought to you by Personnel Strategies Inc.\n\nResearch\nPrior to the phone call, research their website at length.\n\nWhy are you interviewing?\nKnow the reason why you would like to work at the company.\n\nLaundry List\nHave a list of accomplishments and pertinent skills in front of you and know why you are a fit for the job. If you cannot articulate this effectively, you may not get to the face to face interview.\n\nPrivacy Please\nSchedule the interview at a time and number where you can be alone and talk freely. Land lines are better than mobile phones whenever possible.\n\nResume at the Ready\nBe sure to have your resume in front of you so you can follow along with your background as they ask you questions.\n\nBe Honest\nAnswer questions as directly as possible. If you do not know, say so. Be candid, friendly, cheerful and courteous. Confident but not cocky. If you sense that the other person wants to do lots of talking - let them. People like others who are interested in hearing them talk!\n\nNext Step?\nAt the end of the interview, try to get a face to face interview. Ask what the next step will be before hanging up the call.\n\nAddress Weaknesses\nIf you can, find out from the interviewer what they feel your strong points and weaknesses may be. This way, in the face to face interview you can reemphasize the strong points and address any perceived weaknesses.\n\nFor more tips and information on interviewing visit our website at (In PDF File) \n","torrent":{"xt":"urn:btih:7672f5b1eb99038f5fbdf07423a9c95ba5f7d3aa","amp;dn":"Great+Interview+Tips","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7672f5b1eb99038f5fbdf07423a9c95ba5f7d3aa","infoHashBuffer":{"type":"Buffer","data":[118,114,245,177,235,153,3,143,95,189,240,116,35,169,201,91,165,247,211,170]},"announce":[],"urlList":[]}}