{"title":"Kelly Rowland feat. David Guetta - Commander (2nafish)","uid":5726954,"size":130732036,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:76cbc62dc22d8ca76834907a33685ad2e06bb121&amp;dn=Kelly+Rowland+feat.+David+Guetta+-+Commander+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1280448324,"description":"File Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 8000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;Commander&quot; is a song performed by American recording artist Kelly Rowland from her self-titled, third studio album. It serves as the project's international lead single and her debut release with Universal Motown after the recording of the single caught the attention record label boss Sylvia Rhone. It was written by American songwriter Rico Love who, described the song as a &quot;fun and aggressive club record&quot; with themes of female empowerment and lyrics with deliberate linguistic errors.\n\nFrench DJ and producer, David Guetta produced &quot;Commander&quot; with synthesized dance beats that blend R&amp;B with electronica and house music. The single was debuted at the 2010 Winter Music Conference and subsequently garnered universal praise from contemporary critics for reuniting Rowland and Guetta, on a dance track that marries her vocal performance with his production perfectly. The duo had previously topped charts around the world with a similar dance production, &quot;When Love Takes Over&quot; (2009). Entertainment Weekly named &quot;Commander&quot; the number one summer jam of 2010.\n\nJust over a month after release, it topped the U.S. Hot Dance Club Chart and later peaked top ten in the UK and top twenty in Ireland and New Zealand. An accompanying music video was directed by Masashi Muto, and portrays Rowland facing herself in various dance-off scenes. Promotion for the release included a number of live performances including BBC Radio 1's Live Lounge and The Graham Norton Show. The Extended Dance Mix, also produced by Guetta, was released alongside the main single worldwide whereas the urban remix with American rapper Nelly was released in the United Kingdom and United States.\n\nThe video was filmed on May 5, 2010 with Japanese music producer and promo director, Masashi Muto. Muto's previous work includes &quot;I Will Be Here&quot; for Dutch disc jockey, Tiesto as well as promo clips for Pepsi and Honda. Muto's work is known for its scale, impact and colorful imagery. Song writer, Rico Love and song producer, David Guetta make appearances in the video whilst Fatima Robinson handled the video's choreography. The Los Angeles Times  was one of several media outlets present during the video shoot and released a sneak preview of the &quot;behind the scenes&quot; shots on May 10, 2010. An early version of the video was leaked online on June 1, 2010 which, was later addressed by Rowland via her official Twitter account where she made clear that the wrong edit of the video leaked online. UK music channels MTV and MTV Base began to play the early version of the video on June 8, 2010 though, it was not until June 21, 2010 when the official final version premiered on Rowland's website.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:76cbc62dc22d8ca76834907a33685ad2e06bb121","amp;dn":"Kelly+Rowland+feat.+David+Guetta+-+Commander+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"76cbc62dc22d8ca76834907a33685ad2e06bb121","infoHashBuffer":{"type":"Buffer","data":[118,203,198,45,194,45,140,167,104,52,144,122,51,104,90,210,224,107,177,33]},"announce":[],"urlList":[]}}