{"title":"(Blues Rock) Roy Rogers - Split Decision","uid":6359281,"size":109213006,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:773472554543b07c52eda0da480c4bd44cf6264a&amp;dn=%28Blues+Rock%29+Roy+Rogers+-+Split+Decision&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"nightissuchproximity","files":-1,"time":1304271040,"description":"Blues man Roy Rogers released breakthrough recordings Slidewinder and Blues on the Range in his early days for the Blind Pig label, and returns to their stable of artists with his first studio date in seven years, his latest since 2004, and his twelfth album overall. Like any evolving artist, Rogers has taken into consideration diversifying his sound while not adopting the trendiness that has crept into more commercialized blues. It seems he's taken cues from the great Charlie Musselwhite in modernizing his music with voodoo economics, teaming up with the Delta Rhythm Kings, European contemporary keyboardist Philip Aaberg, and multi-faceted saxophonist George Brooks. The songwriting of Rogers is more observant than conciliatory, scolding and at times brow beating, putting shame to no-gooders while offering a helping hand and wise advice, but not a free pass. His slide guitar sports a finely honed edge, more attuned to overheated and sweat dripping environs than the cooler temperature of the Northern California bay area where this was recorded. Rogers does favor beats over surreality, as &quot;Patron Saint of Pain&quot; is straight out of the bag of Elmore James, a choogling blues similar to &quot;Take Out Some Insurance.&quot; The shuffling &quot;Requiem for a Heavyweight&quot; features his &quot;do anything for you&quot; slide guitar, and the rockin' good time &quot;Holy Ghost Man&quot; is a liberated, epiphany blues buoyed by Aaberg's organ accents. In the Southern swamp boogie tradition, &quot;Calm Before the Storm&quot; is a blues of conceit and being taken for granted. the spookier, cerebral elements of Musselwhite come to play on the post-Hurricane Katrina storyboard song &quot;Bitter Rain,&quot; and the slow &quot;I Would Undo Anything&quot; features the shimmering slide guitar of Rogers. There are three instrumentals as well; the short and heartfelt &quot;Your Sweet Embrace&quot; with new age guitarist Ottmar Liebert, the cool, jazzy funky strutting &quot;Rite of Passage&quot; featuring Brooks up front, and &quot;Walkin' the Levee&quot; with blues berimbau from Sam Rogers in a walkin' and stompin' framework. All of these original tunes were either completely written or co-written by Rogers, admirable considering the trend to cover classics of the masters, or tacking on overt commercialized rhythm &amp; blues dance beats. He's clearly got his own style, difficult to retain while avoiding a sell-out in contemporary times. If you are still not hip to the value of Roy Rogers, get aboard the train via this fine, somewhat overdue effort that should reestablish his estimable street cred.\n\n\nmp3   320kbps\n","torrent":{"xt":"urn:btih:773472554543b07c52eda0da480c4bd44cf6264a","amp;dn":"%28Blues+Rock%29+Roy+Rogers+-+Split+Decision","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"773472554543b07c52eda0da480c4bd44cf6264a","infoHashBuffer":{"type":"Buffer","data":[119,52,114,85,69,67,176,124,82,237,160,218,72,12,75,212,76,246,38,74]},"announce":[],"urlList":[]}}