{"title":"Red Ankh - Shadow (2013) [avant-garde symphonic metal]","uid":9553641,"size":357358426,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:788a51f725c6b7385ea6cae54321b1100017855d&amp;dn=Red+Ankh+-+Shadow+%282013%29+%5Bavant-garde+symphonic+metal%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"VizilV","files":-1,"time":1391313240,"description":"From:\n\n'Officially released in 2013, this is a dark symphonic metal double album by Red Ankh. Unlike previous releases from recent years, this album is composed of entirely new material written over the past year, except for the two tracks 'Remember Kata' and 'Ugluwiktz' which were pulled from discontinued instrumental albums that decidedly did not belong there. Across the double album there are four instrumental interludes featuring unconventional organic instruments. The first 'disk' ends with a cross breed remix of 'Let's Drag You Down'. \n\nLyrics shed light on the core story from Shyft's writing, the refrain from 'Down Below' being a poem from the third book of the Shyfted Dreaming Trilogy. Otherwise, the lyrical focus ranges from ethics to self-doubt and madness, to more whimsical, lighthearted themes.\ncredits\nreleased 19 December 2013 \nDrums, Guitars, Viola, Keyboard, Vox, Vox Programming, Programming, Composition, Mastering, Crappy Shop Art, the whole shebang - Shyft Trakia-Vorga VahtiDahl'\n\n\nBy comparison to previous releases, this is probably the least experimental release by Red Ankh to date, as well as the darkest and most sinister.  As far as vocals go, this one is heavy on the harsh black metal vox and choirs, with clean male vocals and use of Vocaloid taking a back seat this time around.","torrent":{"xt":"urn:btih:788a51f725c6b7385ea6cae54321b1100017855d","amp;dn":"Red+Ankh+-+Shadow+%282013%29+%5Bavant-garde+symphonic+metal%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"788a51f725c6b7385ea6cae54321b1100017855d","infoHashBuffer":{"type":"Buffer","data":[120,138,81,247,37,198,183,56,94,166,202,229,67,33,177,16,0,23,133,93]},"announce":[],"urlList":[]}}