{"title":"Abuna Messias (1939)","uid":8813295,"size":889607419,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:79cc9fc71dbc5c67d87d27bbe8d5b7e9336e57a1&amp;dn=Abuna+Messias+%281939%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"pg168","files":2,"time":1376513451,"description":"The film takes place at the end of the 19th century. The Cardinal Guglielmo Massaia has spent 20 years in Ethiopia to convert people to the Catholic Church. He comes back to Italy and he tries to get the help of the government of Piedmont. The Count Cavour, although he appreciates the Cardinal's deeds in Africa, cannot grant his Cabinet's support to the Cardinal's plans. The missionary man, trusting the Divine Providence, goes back to Africa by himself. The Cardinal, who is known among the people as Abuna Messias, becomes a friend of king Menelik. The support of the king is fundamental to spread his word and accomplish his mission. The Head of the Coptic Church, Abuna Attanasio, does whatever he can to prevent Massaia from reaching his goals and to get him exiled from Ethiopia. Menelik refuses to help Abuna Attanasio, who decides to address the Emperor, thus igniting a war between the Emperor and his subject Menelik. In order to end the war, the Cardinal decides to leave Africa, having nevertheless ordained a young Ethiopian priest, who will continue his mission.","torrent":{"xt":"urn:btih:79cc9fc71dbc5c67d87d27bbe8d5b7e9336e57a1","amp;dn":"Abuna+Messias+%281939%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"79cc9fc71dbc5c67d87d27bbe8d5b7e9336e57a1","infoHashBuffer":{"type":"Buffer","data":[121,204,159,199,29,188,92,103,216,125,39,187,232,213,183,233,51,110,87,161]},"announce":[],"urlList":[]}}