{"title":"Motown Chartbusters[vol 4]-mp3-320k-m3u+covers-winker@kidzcorner","uid":6162673,"size":126465417,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:7a3b2a553e6752fb578798ae15c41411690c109e&amp;dn=Motown+Chartbusters%5Bvol+4%5D-mp3-320k-m3u%2Bcovers-winker%40kidzcorner&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"alanwatson","files":-1,"time":1297268724,"description":"vol 4\n\nThis one followed Volume 3 to the top of the UK Album chart. It was tucked between Pink Floyd and Led Zeppelin in October 1970.\n\nThe hits were coming thick and fast for Tamla Motown. Wheras Vol 3 was nearly half re-releases, there was only one on here. The Four Tops' anthemic 'I Can't Help Myself', finally got UK justice with a top ten placing. Their version of Jimmy Webb's 'Do What You Gotta Do' made number 11. Motown and Jimmy had a win-win relationship. His first song writing royalty cheque came from a song he wrote on The Supremes' 1965 Christmas album.\n\nThe stock split of Diana Ross &amp; The Supremes is catalogued here. In America, their final single together 'Someday We'll Be Together' was their biggest hit, selling 2 million copies. It stalled outside the top ten here. The (Jean Terrell lead) Supremes first single 'Up The Ladder To The Roof' was the only top ten hit here by any of them. Who would remember now that Diana Ross' first single 'Reach Out And Touch' stalled outside of our top 30. It would become a staple of her concerts for many years.\n\nStevie Wonder was going strong and getting ready to throw off the artistic shackles of the Motown sound, as was Marvin Gaye. 'The Onion Song' was Marvin &amp; Tammi's biggest British hit. Due to Tammi's poor health, Valerie Simpson did the female lead on that one.\n\nJimmy Ruffin was proving more popular here than in America. He frequently toured here in the clubs of the North, which became the eastern wing of the chittlin' circuit.\n\nThe Jackson 5 began their phenominal run of success in 1970. Their first two American No 1s were also big hits in the UK.\n\nThe Tempts were finally getting something like decent UK chart placings. Even their collaboration with DR&amp; S 'I Second That Emotion' made our top twenty. Smokey's original only made the top thirty a year or so before.\n\nJunior Walker's move to a more mellow sound 'What Does It Take To Win Your Love' gave him a UK top 20. He was reluctant to record the song at first, but they persuaded him.\n\nThis was a good time for Tamla Motown in the UK.\n\n1. I Want You Back (Jackson 5)\n2. The Onion Song (Marvin Gaye And Tammi Terrell)\n3. I Can't Help Myself (Four Tops)\n4. Up The Ladder To The Roof (The Supremes)\n5. I Can't Get Next To You (The Temptations)\n6. Too Busy Thinking About My Baby (Marvin Gaye)\n7. Yester-Me, Yester-You, Yesterday (Stevie Wonder)\n8. Someday We'll Be Together (Diana Ross And The Supremes)\n9. A B C (Jackson 5)\n10. Never Had A Dream Come True (Stevie Wonder)\n11. Farewell Is A Lonely Sound (Jimmy Ruffin)\n12. Do What You Gotta Do (Four Tops)\n13. I Second That Emotion (Diana Ross &amp; The Supremes &amp; The Temptations)\n14. Cloud Nine (The Temptations)\n15. What Does It Take (Jr Walker &amp; The Allstars)\n16. Reach Out And Touch (Diana Ross)\nPeers: 1 se","torrent":{"xt":"urn:btih:7a3b2a553e6752fb578798ae15c41411690c109e","amp;dn":"Motown+Chartbusters%5Bvol+4%5D-mp3-320k-m3u%2Bcovers-winker%40kidzcorner","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7a3b2a553e6752fb578798ae15c41411690c109e","infoHashBuffer":{"type":"Buffer","data":[122,59,42,85,62,103,82,251,87,135,152,174,21,196,20,17,105,12,16,158]},"announce":[],"urlList":[]}}