{"title":"Libertarianism Today","uid":5804010,"size":993647,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7a6cd7c91d2eef1ce4db976acf965e3cd487e1c2&amp;dn=Libertarianism+Today&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bookzilla","files":1,"time":1283375381,"description":"-seems like they deleted my bitchtorrent account or maybe it was hacked-\n\nPublisher: Praeger \nNumber Of Pages: 224 \nPublication Date: 2010-07-01  \n\nAmericans are becoming ever more disillusioned with the two traditional political parties. Both seem to offer more of the same: more spending, more war, more bailouts for big businesses, more control over people's lives.\n\nThat's why more people than ever are taking a look at libertarianism.\n\nBut what does that mean? Attorney and law professor Jacob H. Huebert explains in Libertarianism Today, an engaging introduction to the libertarian movement's ideas and people.\n\nThe book starts with the basic libertarian idea that people should be free to do whatever they want as long as they don't harm anyone else. Then the book examines what that means for a wide range of contemporary issues, including the economy, health care, guns, drugs, online file-sharing, and more.\n\nLibertarianism Today also introduces the people who are advancing these ideas, from maverick Congressman Ron Paul to the Austrian economists who predicted the 2008 financial crisis to the lawyers who are fighting for freedom in the courts.\n\n","torrent":{"xt":"urn:btih:7a6cd7c91d2eef1ce4db976acf965e3cd487e1c2","amp;dn":"Libertarianism+Today","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7a6cd7c91d2eef1ce4db976acf965e3cd487e1c2","infoHashBuffer":{"type":"Buffer","data":[122,108,215,201,29,46,239,28,228,219,151,106,207,150,94,60,212,135,225,194]},"announce":[],"urlList":[]}}