{"title":"Mind Funk 'aka Mindfunk' - Mind Funk (1991) -V 0","uid":4804329,"size":91736731,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:7ac74cd0f9bad257f842ea3e583c1287e759e22b&amp;dn=Mind+Funk+%5C%27aka+Mindfunk%5C%27+-+Mind+Funk+%281991%29+-V+0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"egosavar","files":10,"time":1238151806,"description":"Mind Funk was a second-division &quot;supergroup&quot; of sorts, formed to capitalize on the short-lived funk metal trend. The band was made up of ex-Uniform Choice vocalist Pat Dunbar; ex-M.O.D. guitarist and bassist Louis J. Svitek and John Monte; ex-Celtic Frost drummer Reed St. Mark; and second guitarist Jason Coppola. Their ÃƒÂ¼ber-hyped self-titled debut for Epic Records caused a small media sensation with its aggressive collage of metal, punk, and funk, but bombed in stores. By the time the band came off the road in support of the album, both St. Mark and Coppola were gone, replaced by drummer Shawn Johnson and ex-Nirvana guitarist/ex-Soundgarden bassist Jason Everman. Dropped by Epic just as they were about to re-enter the studio, Mind Funk signed with Megaforce to record the appropriately named Dropped, released in 1993. Their latest release is 1995's People Who Fell From the Sky.\n\nby Ed Rivadavia (allmusic) \n\nMindfunk's 1991 self-titled debut is a highly original amalgamate of its various members' previous metal and punk bands, with a little funk thrown in for fashion's sake (funk-metal was the flavor of the day). Virtually every song features an audacious combination of these disparate influences, and discerning listeners will appreciate how effectively the band puts all the pieces together. The solid songwriting is complemented by excellent musicianship and the sarcastic edge of Pat Dunbar's versatile voice. Both &quot;Sugar Ain't So Sweet&quot; and &quot;Blood Runs Red&quot; slowly build from alluring melodies into chugging metal riffs, and the latter even features some salsa-style drumming. &quot;Bring It On&quot; glides on an excellent mid-pace groove, while songs such as &quot;Ride and Drive&quot; and &quot;Big House Burning Down&quot; (anchored on a powerful bass riff) pummel at full speed from start to finish. Finally, the most unique offering arrives in &quot;Sister Blue,&quot; an acoustic-led bluesy number featuring tasteful soloing from guitarist Louis J. Svitek. \n\n\n\n\n\nI also have their second cd &quot;Dropped&quot;, which is nearly impossible to find on p2p networks, as a decent rip. I don't count low bitrate mp3's as rips. If there're any people left who still remember this great hidden gem of a band of the early 90's and have difficulty finding it, type a comment, i'll rip and upload it here. ","torrent":{"xt":"urn:btih:7ac74cd0f9bad257f842ea3e583c1287e759e22b","amp;dn":"Mind+Funk+%5C%27aka+Mindfunk%5C%27+-+Mind+Funk+%281991%29+-V+0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7ac74cd0f9bad257f842ea3e583c1287e759e22b","infoHashBuffer":{"type":"Buffer","data":[122,199,76,208,249,186,210,87,248,66,234,62,88,60,18,135,231,89,226,43]},"announce":[],"urlList":[]}}