{"title":"Heavy.Metal.Louder.Than.Life.2006.DVDR.PAL-HE3","uid":5676521,"size":12016243162,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:7d6e62a34b620d938ae65d53352353557b3bb0d2&amp;dn=Heavy.Metal.Louder.Than.Life.2006.DVDR.PAL-HE3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"HalfEvil333","files":4,"time":1278552012,"description":"Heavy Metal - Louder Than Life (2006)\nhttp://www.imdb.com/title/tt0819722/\nIMBD: 7.3\nSource: Retail DVD\n\nAudio : Dolby Digital Stereo. 2-channels\n\nSubs : Fin, Dan, Nor, Swe\n\nDisc 1 DVD9 7.59GB\n\nThis documentary is a considered look at the continuing story of Metal, in the words of the people that make it, live it, breathe it and keep it vital. The Bands. The Fans, The Producers, The Industry and The Journalists. What makes it tick, why nothing else can touch it for power, emotion and longevity, why it's misunderstood, why it doesn't care, how it continues to upset the establishment, how it manipulates the media, the positivity, and the way it has forced it's iconography and ethos deep into an unsuspecting and unwilling mainstream.Metal is a documentary that looks at what made Metal, how it grew and how it has transcended fashion, misunderstanding, ridicule and ignorance. Metal is a journey into the psyche of the genre, the sounds, the sights and the smells. While not underestimating it's cultural significance, it's financial power or it's pioneering creativity, it's a film that shows the humour and intelligence as well as the excitement and the primal power. Metal is a film that will inform and entertain the uninitiated. If you know nothing about it by the time the credits roll, love it or loath it you'll understand how, why and what it does. For the hardcore Metal fans this will become a benchmark, it will reinforce and reaffirm their allegiance.Metal features interviews and archive from some of the most influential and respected musicians of the genre as well as commentators and fans. Created by award winning duo Director Dick Carruthers (Led Zeppelin, Aerosmith, The White Stipes) and Producer Jim Parsons (MTV Headbangers' Ball. New Kings of Rock 'n' Roll, Re:covered) Metal is a long overdue film that unravels the music, the myths and the madness.  Written by Jim Parsons \n\nDisc 2 DVD5 3.59GB\n\nMetal School, Dee Snider on Metal, Confessions of a Headbanger, The Metal Timeline","torrent":{"xt":"urn:btih:7d6e62a34b620d938ae65d53352353557b3bb0d2","amp;dn":"Heavy.Metal.Louder.Than.Life.2006.DVDR.PAL-HE3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7d6e62a34b620d938ae65d53352353557b3bb0d2","infoHashBuffer":{"type":"Buffer","data":[125,110,98,163,75,98,13,147,138,230,93,83,53,35,83,85,123,59,176,210]},"announce":[],"urlList":[]}}