{"title":"Ablaye Cissoko &amp; Volker Goetze - Sira [FLAC] TQMP","uid":6322671,"size":255926509,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:7dd788805db383b85703cb6acfa77464f49ae448&amp;dn=Ablaye+Cissoko+%26+Volker+Goetze+-+Sira+%5BFLAC%5D+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pastafari","files":-1,"time":1302988170,"description":"Ablaye Cissoko &amp; Volker Goetze - Sira\n2009\n\nAblaye Cissoko &amp; Volker Goetze Blend Ancient African Traditions with Contemporary\n\nIt would seem that a Senegalese griot singer who plays the traditional West African 21-stringed kora would have little to discuss musically with a German-born, New York-based jazz trumpeter. But today's cross-cultural fusions often transcend both geography and genre, and whether it was fate or design that brought together Ablaye Cissoko and Volker Goetze, it is we who are the beneficiaries. On October 14 in the USA and Canada, ObliqSound will release the duo's album Sira, a stunning collection of 10 utterly matchless and profoundly inspirational tracks that paint a direct line between two disparate worlds and reaffirm the maxim that music is the universal language.\n\n Cissoko himself calls his collaboration with Goetze &quot;vibrant and mysterious music&quot;, while Goetze says, &quot;I believe we are breaking new ground here.&quot; To that we can add any number of adjectives and superlatives but in the end the music speaks best for itself: The duo's collective music-making rings with a pristine clarity and their performances are straightforward and uncluttered; nothing is extraneous on Sira. The album, recorded in Senegal without assistance from any other musicians, marks one of those rare instances when creative sparks collide and combust in truly unexpected and delightful ways. \n\n Sira--which translates to mermaid and is the name of Cissoko's youngest daughter--is a demonstration of single- mindedness among two artists and a statement of respect between world class musicians. Ablaye Cissoko, who comes from a centuries-long line of griots, or storytellers, is a master of intricate, lyrical string work and a vocalist whose deep emotionalism is conveyed in each line he sings. Volker Goetze is an accomplished trumpeter who has collaborated with some of the most important figures of the contemporary scene. Both are composers with an ear toward the future as well as the past.\n\n Their alliance proved a natural fit. Of his musical partner on Sira, Ablaye says, &quot;He's passionate, with all the strictness and professionalism that characterize great men. His playing is an alert--with the sound of the trumpet, you have to respond.&quot;\n\n Volker returns the kudos: &quot;It is striking to play with Ablaye, a musician who plays from his heart, never letting academia get between him and his music. Every phrase he shapes on the kora or sings is perfect, and for a moment it is like God touches the earth. One week after we met we rehearsed one of his songs. It was unbelievably beautiful and since that first meeting I have always wanted to make a duo record with him. To combine the western technical training with the oral tradition of Africa is thrilling.&quot;\n\n Once they agreed to work together, Cissoko and Goetze realized that their partnership would have even greater cultural significance if their creative alliance could benefit the children of Africa. Thus, the artists are donating 10 percent of their profits from Sira to Tostan, an organization whose mission, says its Web site, &quot;is to empower African communities to bring about sustainable development and positive social transformation based on respect for human rights.&quot; Tostan, which means &quot;breakthrough&quot; in the West African Wolof language, has been recognized by the international community for its groundbreaking work with villagers living in extreme poverty in remote areas. (Visit www.tostan.org for more information.)\n\n That spirit of generosity and giving is prevalent throughout the music of Sira. Goetze and Cissoko give each other a wide berth to state their individuality while seamlessly blurring the lines between East and West in their composition and execution. On the lonesome, bluesy &quot;Faro,&quot; written by both musicians, Cissoko delivers a majestic vocal performance that accentuates the seriousness of the song's message. Performed in 6/8 time, over a bass figure derived from an African rhythm, &quot;Faro&quot; speaks to hot- button environmental issues and mankind's responsibilities. &quot;When we arrive on Earth without anything, we can't survive,&quot; says Ablaye. &quot;There are more and more calamities, the planet is warming. We cut trees without planting replacements, there are fewer animals, and not enough water to cultivate the ground. We must take care of nature.&quot;\n\n On Goetze's &quot;Bamaya,&quot; based on a Ghanaian dance, Cissoko engages in an ostinato pattern on his kora while Goetze initially blows a serene melody. Even when he picks up the pace, he keeps his lines delicate and unforced. &quot;It's a folk style in West Africa,&quot; says Volker about the song. &quot;The rhythmic progression is taken from that tradition, but I superimposed a bi-tonal melody on top. The ornaments came subconsciously, as it reminded me of the African flute tradition, where the flute is often in a different key.&quot;\n\n Of the three traditional numbers on the record, the instrumental &quot;Gorgorlou,&quot; arranged by Cissoko, is particularly rich. A meditative piece built around hints of Asian tonal qualities, it spotlights Ablaye's mandolin-like counter-melody weaving tightly with Goetze's trumpet sturdy lines. It's a sunny tune that perfectly exemplifies the pair's shared vision.\n\n For Cissoko, the opportunity to co-create with Goetze opened up new vistas. &quot;It's important to open one's mind to discovering new vibrancies,&quot; he says. &quot;My encounter with Volker is exactly like that. These instances were magic for me.&quot; Adds Goetze, &quot;I hope our music serves society and speaks to people.&quot;\n\n ObliqSound co-founder and the album's executive producer Michele Locatelli agrees. &quot;The vocabulary and the intensity of the performance take the music beyond any genre definition or categorization,&quot; he says. &quot;Its spiritual content turns it into a universal language that can touch any listener, regardless of taste or inclination. It's a perfect fit for ObliqSound.&quot;\n -- All About Jazz\n\n* * * * * * * * * * * * * * * * * * *\n\n Track List\n 01 - Sira\n 02 - Domain Domain\n 03 - Lountang\n 04 - Gorgorlou\n 05 - Faro\n 06 - Badingwoo\n 07 - Bouba\n 08 - Bamaya\n 09 - Sakhadougou\n 10 - Manssani Cisse\n\n* * * * * * * * * * * * * * * * * * *\n\nArtwork, EAC log and CUE sheet included.\nAudio format: FLAC (Free Lossless Audio Codec) &lt;a href=&quot;\nhttp://flac.sourceforge.net/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://flac.sourceforge.net/index.html&lt;/a&gt;\n\nPastafari &lt;a href=&quot;\nhttp://thepiratebay.se/user/pastafari/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/pastafari/&lt;/a&gt;","torrent":{"xt":"urn:btih:7dd788805db383b85703cb6acfa77464f49ae448","amp;dn":"Ablaye+Cissoko+%26+Volker+Goetze+-+Sira+%5BFLAC%5D+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7dd788805db383b85703cb6acfa77464f49ae448","infoHashBuffer":{"type":"Buffer","data":[125,215,136,128,93,179,131,184,87,3,203,106,207,167,116,100,244,154,228,72]},"announce":[],"urlList":[]}}