{"title":"Claudia's Holiday - The tongue of my step-mother 720p XXX DVDRip","uid":12180974,"size":2308650388,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:7ed1cf81d6edf36f8ae4b733ffc706c9c482f896&amp;dn=Claudia%27s+Holiday+-+The+tongue+of+my+step-mother+720p+XXX+DVDRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Ctrlme","files":10,"time":1438442171,"description":"Claudia's Holiday - The tongue of my step-mother 720p XXX DVDRip\n-----------------------------------------\nScreenshot(s):   &lt;a href=&quot;\nhttp://imgctrl.com/image/CGi&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgctrl.com/image/CGi&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgctrl.com/image/CGq&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgctrl.com/image/CGq&lt;/a&gt;\n\nClaudia is finally 18 and therefore free and longing for enjoying herself without barriers. But the devil has a hand in this and although she's spending her holidays in Ibiza, she is controlled by her brother and his fiance Giulia. Thanks to an unexpected chance, beautiful Claudia succeeds in doing what she has been waiting for. Exquisite anal, lesbian and blow jobs with a nice and pleasant Ibiza in the background.\nClaudia's Holiday - titled 'Viaggio a Ibiza' (Journey to Ibiza) in Italian - is a charming sex-romp. Stylishly directed by Francesco Fanelli it stars the talented Claudia Antonelli as Claudia, a lonely, bored teen on holiday in Ibiza. As the temperature rises so do her fellow-holidaymakers' passions, and poor Claudia realises that everyone around her is having masses of sex, even her own mum! Luckily it's not long before she finds love, or at least sex, and much needed relief for her teenage longings.\nIn addition to Miss Antonelli, who was herself only in her teens when the film was made, there is eye-candy in the form of several other cute babes as well as one or two glamorous slightly older women and, of course, a squad of well-endowed hunks who rise blissfully to every occasion. Most of the sex scenes take place in the open air, and the sets and backdrops are exquisite - a boat, swimming pools, a park - which adds so much to the film's appeal for the female viewer.\nThis is a clever little film with something for everyone, sentimental, romantic, funny and sexy, and there are even at least two versions: the uncut one is, um, graphic, but there's another where the sex isn't explicit (but there are still lots of bare boobs).\n\nScene 1. Julia Taylor, Franco Trentalance - Anal, cumshot on belly\nScene 2. Rita Faltoyano, Alex Forte, Toni Ribas - dp, facials\nScene 3. Claudia Antonelli, Alex Forte, Kevin King - pussy and bj, cum on ass and facial\nScene 4. Lily Love, Tara White, Csoky - ffm pussy and cum in mouth, cum eating\nScene 5. Claudia Antonelli, Marco Nero - straight, cum on pussy\nScene 6. Claudia Antonelli, Julia Taylor - lesbian, \n\nName: Claudia Holiday / language my stepmother\nOriginal title: Claudia's Holiday - The tongue of my step-mother\nDirected by: Francesco Fanelli\nReleased: 2007\nReleased: Italy / Pink'o, Goldlight, Marc Dorcel\nDuration: 1:48:11\nLanguage: English, German, French, Italian\n(all tracks full of duplicated translation)\n\nAntonelli, Julia Taylor, Sandra Parker\nRita Faltoyano, Gilda Roberts (as Lily Love)\nTarra White, Monica Santini\n\nNote: This film was released a few times in different languages and with slight variations of the title and the scene sequence, hopefully I got it right!\n\nFormat: MKV\nQuality: HDRip 720p\nVideo Codec: AVC / H.264\nVideo: 1280x720, 23.976fps","torrent":{"xt":"urn:btih:7ed1cf81d6edf36f8ae4b733ffc706c9c482f896","amp;dn":"Claudia%27s+Holiday+-+The+tongue+of+my+step-mother+720p+XXX+DVDRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7ed1cf81d6edf36f8ae4b733ffc706c9c482f896","infoHashBuffer":{"type":"Buffer","data":[126,209,207,129,214,237,243,111,138,228,183,51,255,199,6,201,196,130,248,150]},"announce":[],"urlList":[]}}