{"title":"Bioshock-MCE-alforo","uid":15813102,"size":4293294880,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:7f2059d66e2b6eec5df588759bc3556efb27d99e&amp;dn=Bioshock-MCE-alforo&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"alfrg72","files":1,"time":1473649625,"description":"BioShock es un videojuego de disparos en primera persona, desarrollado por Irrational Games (anteriormente conocida como 2K Boston/2K Australia), publicado el 21 de agosto de 2007 en Norteamérica para el sistema operativo Windows y la consola Xbox 360, tres días después en algunos países de Europa y Australia, y el 31 de agosto en España. Una versión para la PlayStation 3, desarrollada por 2K Marin, fue posteriormente lanzada internacionalmente el 17 de octubre de 2008, el 20 en España y el 21 del mismo mes en Norteamérica. Así como una versión para Mac OS X, el 7 de octubre de 2009.3 Fue diseñado e ideado por Ken Levine. Una secuela, BioShock 2, fue lanzada el 9 de febrero de 2010.16 y una tercera parte, BioShock Infinite, fue lanzada el 26 de marzo de 2013.\r\n\r\nEl juego transcurre en una ucronía del año 1960, y pone al jugador en el rol de Jack, superviviente de un accidente de avión, que luego deberá explorar la ciudad de Rapture, mientras que lucha contra seres humanos mutados con poderes especiales y robots diseñados para atacar ciertos objetivos automáticamente. El juego, que se encuentra en la categoría de juego de disparos en primera persona, incorpora elementos de juegos de rol, biopunk, survival horror y sigilo, por esto, es descrito por sus desarrolladores y Levine como una &quot;secuela espiritual&quot; del juego System Shock 2.17\r\n\r\nEl juego ha recibido gran cantidad de críticas positivas, además ocupa el tercer puesto en la escala de clasificación de videojuegos para Xbox 360 por GameRankings,18 y el cuarto para PC.19","torrent":{"xt":"urn:btih:7f2059d66e2b6eec5df588759bc3556efb27d99e","amp;dn":"Bioshock-MCE-alforo","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7f2059d66e2b6eec5df588759bc3556efb27d99e","infoHashBuffer":{"type":"Buffer","data":[127,32,89,214,110,43,110,236,93,245,136,117,155,195,85,110,251,39,217,158]},"announce":[],"urlList":[]}}