{"title":"I Shouldn't Be Alive - Season 4 - HD 720p","uid":11252972,"size":39991632114,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:82ae24bf4bb5ac696db5eef80af1e4f4b84eaa54&amp;dn=I+Shouldn%27t+Be+Alive+-+Season+4+-+HD+720p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":9,"uploader":"voltxrid","files":-1,"time":1413859639,"description":" &lt;a href=&quot;http://bayimg.com/CacLIaagC&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/CacLIaagC&lt;/a&gt;\n\n\n=========================================\n\nI Shouldn't Be Alive - Season 4 - HD 720p\n\n=========================================\n\n\nEpisode 1 - &quot;A Dad's Worst Nightmare&quot; - October 13, 2010\n\nJuly 1998. After an overnight camping trip in the Australian Outback, Matthew McGough and his 5 year old daughter Shannon get stranded on their way back after taking a wrong turn. They survive for 8 days on limited supplies after Matthew's car is burned up in an accident.\n\n\nEpisode 2 - &quot;Shipwrecked Family&quot; - October 20, 2010\n\nIn 2005, John Silverwood, his wife Jean and his four children Ben, Amelia, Jack and Camille embark on the sailing trip of a lifetime. Halfway into the trip, they run aground on a rocky reef in the South Pacific. Huge waves buffet the boat and flood the cabins and John is seriously injured when the mast collapses.\n\n\nEpisode 3 - &quot;Edge of Death&quot; - October 27, 2010\n\nSeptember 2007. 49-year old Charlie Hench falls off the side of a mountain during a personal hiking expedition and lands on a small ledge at 9000 feet. He is found when his friend Dave Grah, whose brother got lost in a storm 30 years earlier, hiking on the same pass, has a hunch that Charlie is in the same spot.\n\n\nEpisode 4 - &quot;Crashed in the Rockies&quot; - November 3, 2010\n\nJanuary 2002. After crashing into a remote mountainside in the Rocky Mountains, pilot Justin Kirkbride hikes for hours in waist-deep snow (all the while looking for a cellphone signal) to save his two injured friends. The Air Force helicopter sent to rescue Justin crashes shortly after he boards it.\n\n\nEpisode 5 - &quot;Death in the Sea of Cortez&quot; - November 10, 2010\n\nIn September 2000 3 men are stranded on a deserted island in the Gulf of California and attempt to hike to the northern shore for 12 days to attract passing fishermen. They rely on scraps they collect in the island in order to survive.\n\n\nEpisode 6 - &quot;76 Days Adrift&quot; - November 17, 2010\n\n1982. Steven Callahan is shipwrecked from his boat and survives for 76 days on a small liferaft at sea. It's up to his wits and his quick thinking if he wants to get out of this unforgiving ocean.\n\n\nEpisode 7 - &quot;Alone in the Amazon&quot; - November 24, 2010\n\n1985. After his canoe was smashed Benedict Allen is stranded in the Amazon rainforest for 28 days and faces dehydration, starvation, and malaria. He is forced to kill and eat his dog Cashew with a machete to survive.\n\n\nEpisode 8 - &quot;Vacation Nightmare&quot; - December 1, 2010\n\nIn November 2001, newlyweds Brandon and Brandy Wiley, their new friend Michael Packard, and 5 other people are plunged into the Costa Rican jungle when their plane hits clouds and falls out of the sky, killing the pilots and a passenger. The survivors have to survive violent animals and a cold rainy night.\n\n\nEpisode 9 - &quot;River of Fear&quot; - January 5, 2011\n\nIn November 1991 David Whittlesey is stranded when his raft capsizes in the Colorado River. While scaling a cliff to evaluate the situation a handhold breaks and he plummets into the river knocking out 4 teeth, also breaking 2 toes after a rock falls on his foot. He must survive alone on a sandy alcove in the dead of winter for a full week.\n\n\nEpisode 10 - &quot;Killer Crevasse&quot; - January 12, 2011\n\nIn June 1992 the mountaineering expedition of best friends Jim Davidson and Mike Price goes terribly wrong when Jim falls into an 80 foot crevasse, dragging his partner with him. Jim survives the fall because of Mike slowing it down. Jim has to climb out without Mike, who died of his injuries, or he'll die in the night.\n\n\nEpisode 11 - &quot;Hike into Hell Canyon&quot; - January 19, 2011\n\nIn August 1975, 20-year old Linda Skvarna, with her dog Cocoa Gin, took a walk to a nearby village via the canyon, only to take a wrong turn along the way. With little supplies, she and her dog survive for 20 days in rising temperatures and sweltering heat.\n\n\nEpisode 12 - &quot;Death Climb&quot; - January 26, 2011\n\nIn January 1999, Jamie Andrew and his friend Jamie Fisher are trapped on a ledge in the French Alps when a surprise snowstorm blows in. Because of the harsh weather, the rescue helicopter can't land which leaves Fisher dead and Andrew frostbitten.\n\n\nEpisode 13 - &quot;A Family's Desert Hell&quot; - February 2, 2011\n\nIn August 2002 Roger Sargeant, his girlfriend Shelly and her 2 daughters Michaela and Tiffany are looking for a place to test their new firearm in the Arizona Desert. Their truck gets stuck on a wash and they become lost and spend the next 2 days wandering around where gangs of criminals attempt to run them over and leave them to die.\n\n\nEpisode 14 - &quot;Ocean Disaster&quot; - February 9, 2011\n\nJune 2008. Skipper Steve Conway, safety officer Roger Stone, and their four-student crew of Texas A&amp;M participate in the annual regatta at the Gulf of Mexico when their sailboat capsizes in the dead of night. One man sacrifices himself to save two students trapped in the cabin, and the survivors struggle to survive 26 hours in open water, battling the heat of day, the cold of night and haunted by the distant unmanned oil rig in the horizon.\n\n\nEpisode 15 - &quot;Left for Dead on Everest&quot; - February 16, 2011\n\nIn May 2006 climber Lincoln Hall summits Mt. Everest but on the way down he develops life threatening cerebral edema. Sherpas, themselves at risk in the low oxygen death zone, assist his descent but abandon him at 28,000 feet when he falls unconscious and is believed beyond help. During the night Lincoln, his death already announced, awakens and that morning is found by Dan Mazur and his group of climbers during their summit attempt.\n\n\nEpisode 16 - &quot;A Father's Deadly Dilemma&quot; - February 23, 2011\n\nIn March 2003 David Hunt and his 11 year old daughter Leia are en route via snowmobile to their cottage in Maniwaki, Quebec, Canada. Their snowmobile flips throwing David into a ravine. He eventually climbs out, but his knee is shattered and he can't continue. It's up to Leia to save her dad's life and to stay alive.\n\n\nIf problems or inconsistencies with any of the content files are noticed, please let me know via the comments and I will attempt to upload some corrected replacements.  Thanks much and enjoy!  :-)","torrent":{"xt":"urn:btih:82ae24bf4bb5ac696db5eef80af1e4f4b84eaa54","amp;dn":"I+Shouldn%27t+Be+Alive+-+Season+4+-+HD+720p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"82ae24bf4bb5ac696db5eef80af1e4f4b84eaa54","infoHashBuffer":{"type":"Buffer","data":[130,174,36,191,75,181,172,105,109,181,238,248,10,241,228,244,184,78,170,84]},"announce":[],"urlList":[]}}