{"title":"Hitler's Furies: German Women in the Nazi Killing Fields","uid":9093098,"size":23341698,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:82e88338606b6c933658784d4a08ba4e313e058b&amp;dn=Hitler%27s+Furies%3A+German+Women+in+the+Nazi+Killing+Fields&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"AN0NYMOUS142857","files":-1,"time":1382641033,"description":"Hitler's Furies: German Women in the Nazi Killing Fields [2013][Wendy Lower][mobi/epub][INFERNO]\n\n\n\nFormat: mobi/epub\nLength: 288 pages\nGenre: History\nDate: 8 October 2013\n\nA revelatory new history of the role of German women in the Holocaust, not only as plunderers and direct witnesses, but as actual killers on the eastern front during World War II.\n\nHitler's Furies builds a fascinating and convincing picture of a morally &quot;lost generation&quot; of young women, born into a defeated, tumultuous post-World War I Germany, and then swept up in the nationalistic fervor of the Nazi movement - a twisted political awakening that turned to genocide. These young women - nurses, teachers, secretaries, wives, and mistresses - saw the emerging Nazi empire as a kind of &quot;wild east&quot; of career and matrimonial opportunity, and yet could not have imagined what they would witness and do there.\n\nDrawing on twenty years of archival and field work on the Holocaust, access to post-Soviet documents, and interviews with German witnesses, Hitler's Furies presents overwhelming evidence that these women were more than &quot;desk murderers&quot; or comforters of murderous German men: that they went on &quot;shopping sprees&quot; for Jewish-owned goods and also brutalized Jews in the ghettos of Poland, Ukraine, and Belarus; that they were present at killing-field picnics, not only providing refreshment but also taking their turn at the mass shooting.\n\nHitler's Furies will challenge our deepest beliefs: genocide is women's business too, and the evidence can be hidden for seventy years.\n\nAuthor:\n\nWendy Lower, Ph.D. is the John K. Roth Chair of History at Claremont McKenna College and research associate of the Ludwig Maximillians Universit?t in Munich, Germany. A historical consultant for the U.S. Holocaust Memorial Museum, she has conducted archival research and field work on the Holocaust for twenty years. \n\n","torrent":{"xt":"urn:btih:82e88338606b6c933658784d4a08ba4e313e058b","amp;dn":"Hitler%27s+Furies%3A+German+Women+in+the+Nazi+Killing+Fields","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"82e88338606b6c933658784d4a08ba4e313e058b","infoHashBuffer":{"type":"Buffer","data":[130,232,131,56,96,107,108,147,54,88,120,77,74,8,186,78,49,62,5,139]},"announce":[],"urlList":[]}}