{"title":"Taking Woodstock (2009)(ENG)(NLSUBS) 2Lions-Team","uid":5210861,"size":4686156069,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:82ff8104cf52172900ca282fdda4c57f6dc0db57&amp;dn=Taking+Woodstock+%282009%29%28ENG%29%28NLSUBS%29+2Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Pioen","files":-1,"time":1260585637,"description":"Taking Woodstock (2009) NTSC       \n\n\nVerenigde Staten\nKomedie / Muziek\n120 minuten\n\ngeregisseerd door Ang Lee\nmet Demetri Martin, Emile Hirsch en Liev Schreiber\n\n'Taking Woodstock' neemt je mee terug naar hoe het wereldberoemde festival Woodstock ooit begon. Gebaseerd op het dagboek van Elliot Tiber, in een tijd waar alles mogelijk leek te zijn. Elliot werkt als interieurontwerper in Greenwich Village, maar moet terug naar El Monaco om het familiebedrijf te redden, dat door zijn onnozele ouders om zeep wordt geholpen. Om te zorgen dat het motel niet door de bank wordt overgenomen, moet Elliot met een geniaal plan komen. Wanneer hij hoort dat een reeds gepland muziekfestival geen toestemming krijgt vanuit het buurtdorp Wallkill, biedt Elliot producer Michael Lang als alternatief een groot stuk grond en het familiemotel aan. Met de hulp van zijn vrienden en dorpsgenoten wachten ze een half miljoen mensen op dat onderweg is naar het festival van drie dagen vrede en muziek. Zo komt Elliot terecht in een belevenis die zijn eigen en vele andere levens leven voorgoed verandert.\n\n\nTaking Woodstock (2009)\n\nEnglish\n\nA generation began in his backyard. From Academy Award-winning director Ang Lee (Brokeback Mountain, Crouching Tiger, Hidden Dragon), comes Taking Woodstock, a new comedy inspired by the true story of Elliot Tiber (Demetri Martin) and his family, who inadvertently played a pivotal role in making the famed Woodstock Music and Arts Festival into the happening that it was.\n\nIts 1969, and Elliot Tiber, a down-on-his-luck interior designer in Greenwich Village, New York, has to move back upstate to help his parents run their dilapidated Catskills motel, The El Monaco. The banks about to foreclose; his father wants to burn the place down, but hasnt paid the insurance; and Elliot is still figuring how to come out to his parents.\n\nWhen Elliot hears that a neighboring town has pulled the permit on a hippie music festival, he calls the producers, thinking he could drum up some much-needed business for the motel. Three weeks later, half a million people are on their way to his neighbors farm in White Lake, NY, and Elliot finds himself swept up in a generation-defining experience that would change his life, and American culture, forever\n\n\nMovie..............: Taking Woodstock (2009)\ngenre..............: Komedie / Muziek\nSource.............: Taking.Woodstock.DVDR-Replica\nFormat.............: DVDR\nruntime............: 120 minuten\nMenu...............: Yes edited Jodinho\nVideo..............: CCE@ 4370 kbps\nAudio..............: Eng: DD 5.1\nSubtitles..........: Vertaald door Jopie123, Nice job m8.\nControle...........: Jopie123\nBewerking+Resync...: Jopie123\n\nCategorie : Beeld \nFormaat : DVD5 \nBron : Retail\n \nOndertitels : Nederlands (Lossles)\n \nGenre : Komedie\nMuziek\n \nWeblink : http://www.moviemeter.nl/film/56130\nWeblink : http://www.imdb.com/title/tt1127896\n\n***************************************** \n\nBrought to you by\n\n\n2Lions Team \n\n\n \n\n\n2Lions-Team for all your Dutch MOVIES and more \n\n***************************************** \n\nDON T HIT AND RUN Niet gelijk afhaken als de film binnen is blijf seeden. \n\nDon`t quit after you finished the download, but keep seeding\n\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!\n\nto the fakers , get a life !!!\n","torrent":{"xt":"urn:btih:82ff8104cf52172900ca282fdda4c57f6dc0db57","amp;dn":"Taking+Woodstock+%282009%29%28ENG%29%28NLSUBS%29+2Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"82ff8104cf52172900ca282fdda4c57f6dc0db57","infoHashBuffer":{"type":"Buffer","data":[130,255,129,4,207,82,23,41,0,202,40,47,221,164,197,127,109,192,219,87]},"announce":[],"urlList":[]}}