{"title":"SSV-NSMABAAOTWMODAACOTIATW (Not Sisters of Mercy)","uid":4788721,"size":47226174,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:837d89a1ce93f9ad0f147c7c570741b13d9df326&amp;dn=SSV-NSMABAAOTWMODAACOTIATW+%28Not+Sisters+of+Mercy%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Ekv2000","files":11,"time":1237641812,"description":"SSV are not the Sisters. Their official full name is SSV-NSMABAAOTWMODAACOTIATW. \n\nCould this possibly stand for &quot;Screw Shareholder Value - not so much a band as another opportunity to waste money on drugs and ammunition, courtesy of the idiots at Time Warner&quot;? \n\nSurely not. That would require a comma. \n\nSSV's only album ('Go Figure') features music by P.Bellendir and words by T.Schroeder. It was produced by P.Bellendir in 1997. It does not feature anything by Andrew Eldritch except some sampled vocals. \n\nBecause of those sampled vocals, East West bought the record (without having heard it) and agreed to release Andrew from his recording contract. What led them to do such a strange thing, after years of intransigence? \n\nDespite their threats to sue Andrew for not delivering any Sisters records, they were perhaps more worried that a judge would regard a seven year strike as evidence that the contract was dead anyway. So they took what they could get. Andrew has neither the money nor the desire to spend years on a court case, and he was happy to accept immediate freedom on these particular terms. He was very happy for East West to get their SSV record. \n\nUnfortunately for East West, their SSV record is Not Very Good - to put it mildly. It's reasonable to assume that &quot;techno without drums&quot; is designed merely to bore and annoy. \n\nEast West have not released the SSV album, but they did send tapes to the press. One copy landed on the internet, so you could pick the album up for free, in MP3 format. Maybe you still can. We don't think the record's worth downloading, anyway. \n\nWe gather that East West have remixed two tracks, but they're not allowed to remix any more. One day, East West may decide to release the SSV album. We can't recommend it. \n\n\nSisters of Mercy\n","torrent":{"xt":"urn:btih:837d89a1ce93f9ad0f147c7c570741b13d9df326","amp;dn":"SSV-NSMABAAOTWMODAACOTIATW+%28Not+Sisters+of+Mercy%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"837d89a1ce93f9ad0f147c7c570741b13d9df326","infoHashBuffer":{"type":"Buffer","data":[131,125,137,161,206,147,249,173,15,20,124,124,87,7,65,177,61,157,243,38]},"announce":[],"urlList":[]}}