{"title":"Hector Postigo - The Digital Rights Movement. The Role of Techno","uid":10086123,"size":6923396,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:85eef441a824f25852a6ba345e504ad6fe6a19ed&amp;dn=Hector+Postigo+-+The+Digital+Rights+Movement.+The+Role+of+Techno&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Anette14","files":-1,"time":1399096153,"description":"Description\nProduct Details\nBook Title: The Digital Rights Movement: The Role of Technology in Subverting Digital Copyright (The Information Society Series)\t\nBook Author: Hector Postigo (Author)\nSeries: The Information Society Series\nHardcover: 256 pages\nPublisher: The MIT Press (October 5, 2012)\nLanguage: English\nISBN13: 9780542865787\nISBN10: 0542865785\n\n===================================================================================\nBook Description\nThe movement against restrictive digital copyright protection arose largely in response to the excesses of the Digital Millennium Copyright Act (DMCA) of 1998. In The Digital Rights Movement, Hector Postigo shows that what began as an assertion of consumer rights to digital content has become something broader: a movement concerned not just with consumers and gadgets but with cultural ownership. Increasingly stringent laws and technological measures are more than incoveniences; they lock up access to our &quot;cultural commons.&quot; Postigo describes the legislative history of the DMCA and how policy &quot;blind spots&quot; produced a law at odds with existing and emerging consumer practices. Yet the DMCA established a political and legal rationale brought to bear on digital media, the Internet, and other new technologies. Drawing on social movement theory and science and technology studies, Postigo presents case studies of resistance to increased control over digital media, describing a host of tactics that range from hacking to lobbying. Postigo discusses the movement's new, user-centered conception of &quot;fair use&quot; that seeks to legitimize noncommercial personal and creative uses such as copying legitimately purchased content and remixing music and video tracks. He introduces the concept of technological resistance--when hackers and users design and deploy technologies that allows access to digital content despite technological protection mechanisms--as the flip side to the technological enforcement represented by digital copy protection and a crucial tactic for the movement.\n\n===================================================================================\nReviews\n&quot;With a journalist's eye for detail, an activist's commitment to the issues beneath, and a scholar's insight into their implications, Hector Postigo carefully documents the importance of hacktivism. He makes a convincing case that the DRM circumvention battles of the last decade drew together the people, the ideas, and the tactics now so vital to today's global controversies about digital citizenship and creative freedoms online.&quot; -- Tarleton Gillespie, Cornell University; author of Wired Shut: Copyright and the Shape of Digital Culture\n\n&quot;With the Digital Millennium Copyright Act, the giants of the content industry attempted to impose an order on the Internet, but they ignored the opposing views of some of the Internet's most savvy users. Hector Postigo shows that unlike other social movements that use the Internet to achieve rapid scale shifts, the digital rights movement is both viral and retroviral. In other words, hacktivists use the Internet to organize protests and build support in legal battles, but they also unlock the code of copyright-protected products. Both strategies are part of a broader political goal of maximizing the Internet's public domain.&quot; -- David J. Hess, Vanderbilt University\n\n&quot;Hector Postigo traverses a wide intellectual landscape -- from the intricacies of copyright law in the digital age to grand visions for what online participatory culture could become -- in this riveting account of the development of the digital rights movement. Postigo is among the first to provide a comprehensive discussion of the development of the digital rights movements, its key actors, and its major arguments. If you are interested in online social movements, digital rights, or participatory culture, this book is for you!&quot; -- Jennifer Earl, Professor of Sociology, University of Arizona; co-author of Digitally Enabled Social Change\n\n===================================================================================\nAbout the Author\nHector Postigo is Associate Professor in the Department of Broadcasting, Telecommunications, and Mass Media in the School of Communications and Theater at Temple University.\n===================================================================================","torrent":{"xt":"urn:btih:85eef441a824f25852a6ba345e504ad6fe6a19ed","amp;dn":"Hector+Postigo+-+The+Digital+Rights+Movement.+The+Role+of+Techno","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"85eef441a824f25852a6ba345e504ad6fe6a19ed","infoHashBuffer":{"type":"Buffer","data":[133,238,244,65,168,36,242,88,82,166,186,52,94,80,74,214,254,106,25,237]},"announce":[],"urlList":[]}}