{"title":"Ch4 Restoration Man Series 2 16of16 Pig Barn 540p DVDRip x264 AA","uid":9289198,"size":690604704,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:866dcec725b927b03a7cf29e4b76a3b4c6ad7e98&amp;dn=Ch4+Restoration+Man+Series+2+16of16+Pig+Barn+540p+DVDRip+x264+AA&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MVGroup","files":-1,"time":1386063069,"description":"Restoration Man: Series 2\n\nHistory, Technology Documentary hosted by George Clarke, published by Channel 4 in 2013 - English narration\n\n\nInformation\n------------------------------\n\nRestoration Man: Series 2\nArchitect George Clarke returns for a second series of Restoration Man with a whole range of new families and brand new restoration projects. Each episode features a family taking on the emotional and financial rollercoaster of restoring an old building - many of which are literally falling down or are listed with planning restrictions. In 2011 the 'Heritage at Risk Register' had a staggering 5,828 entries. However thanks to restoration projects this statistic is over half of what it was ten years ago. But restoring old buildings isn't for the faint hearted and throughout the filming of the series George is on hand to offer advice and support to these restoration warriors wherever he can. Projects include the restoration of a water tower in Cheshire, Victorian brickworks in Oxfordshire, and a Yorkshire steam train water tower. Each building has a unique story to tell, so George tries to uncover the architectural and historical significance of building.\n\n\n1)  Reeds Windmill \nAfter years of living away from their families, Pete and Nikki have moved back down south to Kent with the dream of restoring a derelict windmill that's been owned by Pete's family for over 100 years. Locally listed, the windmill has been a roofless ruin since 1915, and its tapering structure overlooks an area of outstanding natural beauty in the heart of the county. The build nearly comes unstuck when Nikki, who had recovered from cancer, suddenly becomes unwell again. George is on hand to advise, and support them on their restoration journey as they battle with Nikki's illness.\n\n2)  Water Tower Congleton \nGeorge meets architect Andy and his girlfriend Ana, who are trying to restore a listed water tower into an uber-modern 21st century home. But at what personal cost?\nAndy Critchlow surprised his girlfriend Ana Ferguson when he bought a stunning, cylindrical Grade II listed water tower in Congleton, Cheshire, at auction - without even seeing the inside. Andy dreams of converting this building into a cutting-edge 21st century home, which means selling their current property and moving in with his parents during the nine-month build. As a director of his own architectural practice, Andy tackles the build with huge drive and determination. Meanwhile, George goes on a historical mission and discovers how this monumental landmark sitting proudly on a Cheshire hill saved the lives of the people it overlooked.\n\n3)  Church Eden Valley \nGeorge Clarke meets Phil and Joanne Evans, who have taken a huge financial gamble by purchasing a Grade II-listed rural parish church in the Eden Valley in Cumbria. The pair hope to transform the structure into their dream home, and have enlisted relative Alex, a newly qualified architect, to manage the build. However, an early disaster and ambitious plans have a dramatic impact on the tiny budget, and George is forced to dispense practical advice to save the project from failure.\n\n4)  Engine House \nTim and Emma Verdon, a school bursar and a teacher, seek help from architect George Clarke to transform a derelict Victorian brickworks in the heart of rural Oxfordshire into a home for themselves and their children. Nestling in six acres, the unlisted house is only four walls without a roof, and despite Emma leaving her job to manage the project, planning problems soon force the couple to make radical decisions.\n\n5)  Towers Revisit \nArchitect George Clarke catches up with artist Sarah McCombie, who has owned a Martello tower in Kent since 2004, and ex-soldier Barrie Taylor, who became custodian of a Renfrewshire castle tower in 2005. Neither had gained planning permission during George's first visit, so he returns to see if their restoration dreams have come to fruition.\n\n6)  Medieval Hall Revisit \nArchitect George Clarke catches up with Simon Hooper and partner Victoria, who tried to convert a Grade I listed medieval hall in Cardiff. George returns to Wales to see if the family has overcome the challenges of restoring the ancient building after Simon failed to stick to his original deadlines to complete the project.\n\n7)  Water Tower Settle \nArchitect George Clarke comes to the rescue of former Bradford police officer Mark Rand and his wife Pat, whose project to add a glass rooftop to the Grade II-listed water tower at Settle station in North Yorkshire has been threatened by opposition.\n\n8)  Chapel Pembrokeshire Revisit \nGeorge Clarke revisits Gareth Williams, who sought his assistance four years previously as he tried to create a new home for his family by restoring a derelict Victorian church in Pembrokeshire. To save money, Gareth planned to carry out all the necessary work himself, but the church's location in a working graveyard caused administrative problems in addition to the difficulty of the physical labour. Now the project is complete, George returns to learn more about the building's history and discover whether the reality of living in a former church has lived up to expectations.\n\n9)  Bath Lodge Revisit \nTwo years on, George Clarke returns to Ormskirk, near Liverpool, to see how builder Mark Horton is faring in the former 18th-century folly that he bought and converted himself into a family home. Despite the bank pulling his loan after three months and dramatic consequences on his health, Mark managed to finish the project. So how has the building turned out as a living space?\n\n10)  Ice House Revisit \nArchitect George Clarke returns to a remote 19th-century Scottish ice house after two years to catch up with its owner, Laird Henderson. George previously helped to realise an ambitious glass extension, but after budget problems and a clash with building control, will Laird have moved on and built the idyllic loch-side hideaway to match, or will he still be taking in the stunning views from his caravan as he struggles to complete the restoration?\n\n11)  Gothic Church Revisit \nArchitect George Clarke catches up with Joanne McGirr and Phil Evans, who risked all to restore a Victorian Gothic church at the foot of the Pennines. Last time George saw them they were teetering on the edge of financial ruin and faced with the agonising decision of whether they should sell the project... Have they been able to keep hold of their dream home?\n\n12)  Oast House \nGeorge meets James and Lois Denning, who inherited an historic estate which has been in James' family for the last 234 years. The castle and stately home that used to belong to his family have been given to the National Trust, so they've decided to convert a stunning and only recently abandoned oast house. George is on hand to advise them with the epic restoration of this beautiful old agricultural building into a grand nine bedroom family home.\n\n13)  Berneray Church \nUsing an inheritance from his late father, artist Keith McIntyre and his wife Sheena bought a listed, Thomas Telford-designed church in the remote island of Berneray in the Outer Hebrides. Keith and Sheena plan to convert the church into a holiday home and artist's studio, where they can bring their art students and musician friends to be inspired by the amazing light and rugged, desolate landscape. In restoring this roofless ruin, Keith and Sheena face challenges from the extreme weather and have to keep the neighbours on side while managing the build 400 miles away from their home in Newcastle.\n\n14)  Longhurst Lodge \nIt was love at first sight when theatre producer Vanessa Ford Robbins and her partner Nik Huddy saw Longhurst Lodge, a Victorian gate lodge nestled on the boundaries of a country estate in Surrey. This unusual two up, two down has been derelict for nearly 50 years. Nik and Vanessa want to bring this fairy tale building back to life, but they desperately need more living space and face mounting planning issues over extending the Grade II listed building. The couple tackle the project with huge drive and determination, doing all the build work themselves, but living in a caravan on site during winter. George Clarke is on hand to help advise and support the couple. He also discovers some of the estate's bloody history.\n\n15)  Thrum Water Mill \nFour years ago Dave and Margaret came across a picture of a watermill in the north east. The mill had been abandoned for 50 years and they decided to bring it back to life. The couple put their hearts into the restoration, with experienced amateur builder Dave even designing the new mill water-wheel to generate hydro-electric power from the force of the river. George Clarke is on hand to help the couple as they tackle this huge project. But, with floods and Margaret's life-threatening illness to contend with, will they ever achieve their dream of calling this historic building home?\n\n16)  Pig Barn \nDavid and Judith Ward take up the challenge of restoring a dilapidated pig barn across the road from their daughter's farmhouse in order to be nearer to their grandchildren. David is a charismatic preacher and has faith that even in this challenging market they will manage to sell their old home, pay back the loan and raise the funds to finish the restoration. George Clarke is there from the start, giving practical advice and guidance. But will their hopes for a happy retirement in the bosom of their family ever become reality?\n\nScreenshots\n------------------------------ &lt;a href=&quot;\nhttp://img823.imageshack.us/img823/1/ph3r.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img823.imageshack.us/img823/1/ph3r.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img24.imageshack.us/img24/4067/uvg5.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img24.imageshack.us/img24/4067/uvg5.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img834.imageshack.us/img834/5315/liq3.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img834.imageshack.us/img834/5315/liq3.jpg&lt;/a&gt; \n\nTechnical Specs\n------------------------------\n\n\n * Video Codec: x264 CABAC &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;4e062729260e027d607f&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n * Video Bitrate: 1949 Kbps\n * Video Aspect Ratio: 1.778 (16:9)\n * Video Resolution: 960 x 540\n * Audio Codec: AAC LC\n * Audio Bitrate: 160 Kbps VBR 48KHz\n * Audio Channels: stereo (2/0)\n * Audio: English\n * Run-Time: 48mins\n * Frame rate: 25fps\n * Number of Parts: 16\n * Part Size: average 659 MB\n * Container: Mp4\n * Encoded by: Harry65\n * Source: DVD\n\n\n\nLinks\n------------------------------\n\n1)  Further Information &lt;a href=&quot;\nhttp://www.tigeraspect.co.uk/series/factual-features/the-restoration-man-series-2/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.tigeraspect.co.uk/series/factual-features/the-restoration-man-series-2/&lt;/a&gt;\n\n2)  Related Documentaries &lt;a href=&quot;\nhttp://docuwiki.net/?title=Restoration%20Man%3A%20Series%201&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=Restoration%20Man%3A%20Series%201&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:866dcec725b927b03a7cf29e4b76a3b4c6ad7e98","amp;dn":"Ch4+Restoration+Man+Series+2+16of16+Pig+Barn+540p+DVDRip+x264+AA","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"866dcec725b927b03a7cf29e4b76a3b4c6ad7e98","infoHashBuffer":{"type":"Buffer","data":[134,109,206,199,37,185,39,176,58,124,242,158,75,118,163,180,198,173,126,152]},"announce":[],"urlList":[]}}