{"title":"Niels Holgersson afl 47  tm 52.DVDr.NLT-Release","uid":4815343,"size":4420235756,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:86a9a9e46ecd68d43a8da082bd9e9da5b1e81305&amp;dn=Niels+Holgersson+afl+47++tm+52.DVDr.NLT-Release&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"diddle783","files":-1,"time":1238522892,"description":"Niels leeft samen met zijn ouders op een boerderij in het zuiden van Zweden. Hij is een heel ondeugend jongetje, mensen en dieren plagen is z'n lust en z'n leven. De dieren op de boerderij moeten niets van hem hebben en zijn blij als hij op een dag samen met zijn hamster Kruimel voor straf door een kabouter betoverd wordt.\n\nAflevering 47 - Asa Thor en de Reuzen\nNils en Kruimel schuilen voor een storm. Van voorbijgangers horen ze het wonderbaarlijke verhaal over het ontstaan van de streek...\n\nAflevering 48 - Afscheid van Smirre\nDe vos Smirre blijft achter Nils aanzitten, maar hij heeft geen geluk en krijgt medelijden met zichzelf...\n\nAflevering 49 - De Wens van de Kabouter\nElke dag komen Nils en de wilde ganzen een beetje dichter bij huis. Nils is daar niet vrolijk over. Natuurlijk heeft hij heimwee, maar hij wil Akka en de ganzen niet verliezen...\n\nAflevering 50 - De Schat op het Eiland\nAkka ziet dat Nils het erg lastig heeft en wil hem een verzetje geven. Ze vraagt hem mee te vliegen naar een afgelegen eiland, waar jaren geleden een kostbare schat werd begraven...\n\nAflevering 51 - De Thuiskomst\nNils zal wel altijd klein blijven. Toch wil hij zijn familie en de boerderij nog eens terugzien. Hij sluipt stilletjes rond op het erf en ziet dat de toestand belabberd is...\n\nAflevering 52 - Afscheid van de Wilde Ganzen\nNils staat op het punt de boerderij te verlaten. Dan verschijnt Maarten, die zijn kroost wil tonen waar hij vroeger gewoond heeft. Vader Holgersson vangt de ganzen en brengt Maarten naar de keuken om hem te slachten...\n\nDeze torrent wordt je aangeboden door NLT.ons-Forum het forum.\n\nHet forum met de nieuwste films en muziek en de meest uitgebreide\n\nCollectie DviX torrents. Al onze Film torrents hebben Nederlandse subs of zijn Nederlands Geproken\n\nWe zijn te vinden op:\n &lt;a href=&quot;\nhttp://www.nlt.ons-forum.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.nlt.ons-forum.nl&lt;/a&gt; \n\n\nDENK NIET ALLEEN AAN UZELF MAAR HELP EEN ANDER DOOT TE SEEDEN MIN 1:1 MAAR MEER MAG OOK\n","torrent":{"xt":"urn:btih:86a9a9e46ecd68d43a8da082bd9e9da5b1e81305","amp;dn":"Niels+Holgersson+afl+47++tm+52.DVDr.NLT-Release","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"86a9a9e46ecd68d43a8da082bd9e9da5b1e81305","infoHashBuffer":{"type":"Buffer","data":[134,169,169,228,110,205,104,212,58,141,160,130,189,158,157,165,177,232,19,5]},"announce":[],"urlList":[]}}