{"title":"Reset (early Simple Plan) - No Worries LP (1998)","uid":4203501,"size":49929692,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:86d29d39d02df2303e1f622345606eba7bb62c40&amp;dn=Reset+%28early+Simple+Plan%29+-+No+Worries+LP+%281998%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"VinYl_RiPPa","files":14,"time":1211642975,"description":"Artist...: Reset\nGenre....: Punk Rock\nTitle....: No Worries\nYear.....: 1998\nTracks...: 12\n\nSource...: CD Audio\nMon/Ste..: Stereo\n\nEncoder..: Lame MP3 CBR\nQuality..: 192 kbps\n\nCovers...: No\n\n\n\n\nNo Worries was recorded back in 1997. This is, in my opinion, the BEST effort ever made by the members of the band. All three instruments, along with the vocals, are tightly coordinated to create a chugging punk sound that carries on throughout the album. It was too bad that the band began to fall apart after, apparently, not liking the sound of the album.\n\nThough the songs might sound the same, with the same chugging of palm-muted power chords and double-time drums, they have both politically-inspired and angsty lyrics, such as Holy War, which is about the uneasiness going on in the Middle East, and I m A Man, which is about being grown up and being able to take on anything without the support of others. Concerns about the environment and rape issues are also presented in the songs Concern and A Matter Of Rights. The song writing is focused and doesnt wander off, and is what makes this album punk.\n\nThe instrumental work is stable and coordinated, though not fantastic. It is mostly consisted of palm-muting power chord progressions mixed with tight riffs and the occasional solo. The bass is loud and follows the riffs clearly, and the drums keep the double-time going with good drum fills. It is not talentless, yet not outstanding.\n\nNow the part youve been waiting for: Pierre s voice. I KNOW a hell ton of people HATE him with passion. Yes, he has a whiny and irritating voice, even as of today. On this record, however, it fits the music, and seeing as he was a teenager, you can&amp;#039;t really blame him for having the same voice on this album. The adolescent and angst of his singing is perfect for every song of this CD, and there are no attempts to do anything extraordinary.\n\nThe album itself is pretty solid. It opens up with fast-paced songs, and ends with fast-paced songs, with Pierre singing (or whining, or irritating you...) to no end. The last and longest song, United We Stand Tall, ends off with the A5 chord, wrapping this album up. In the end, the album leaves you with the impressions about politics and stuff, like how any punk album should.","torrent":{"xt":"urn:btih:86d29d39d02df2303e1f622345606eba7bb62c40","amp;dn":"Reset+%28early+Simple+Plan%29+-+No+Worries+LP+%281998%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"86d29d39d02df2303e1f622345606eba7bb62c40","infoHashBuffer":{"type":"Buffer","data":[134,210,157,57,208,45,242,48,62,31,98,35,69,96,110,186,123,182,44,64]},"announce":[],"urlList":[]}}