{"title":"Eric Kloss - First Class! [1967]","uid":9487339,"size":203080744,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:86d95d05081f10b169780c66edb38e1c3e0b3594&amp;dn=Eric+Kloss+-+First+Class%21+%5B1967%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":null,"files":-1,"time":1389924274,"description":"mp3 320\n\nFirst Class! collects two solid Eric Kloss albums from 1966 and 1967, the first titled Grits and Gravy, the latter First Class Kloss! Over the course of 16 pieces, however, saxophonist Kloss fronts three different groups: a quartet, quintet, and septet. While this never seems disjointed, it does occasionally feel like a best-of package, especially when the female vocal group joins in on pieces like &quot;Slow Hot Wind.&quot; This is especially true on the first eight pieces from Grits and Gravy. Bizarre hodgepodges like the title track with its combination of background vocals, a large ensemble, and repetitive funky riffs remind one of a bad '60s movie soundtrack. These tracks are juxtaposed with incredibly edgy work by Kloss, pianist Jaki Byard, bassist Richard Davis, and drummer Alan Dawson. The intensity of &quot;Softly, As in a Morning Sunrise&quot; still sounds fresh 20 years after the fact, and the chemistry among the players is explosive. Luckily, the two bonus tracks, &quot;When I Fall&quot; and &quot;Psychedelicatessen Rag,&quot; come from these sessions. Kloss is joined by trumpeter Jimmy Owens, pianist Cedar Walton, bassist Leroy Vinnegar, and drummer Dawson for the last half-dozen tracks, and the work here is uniformly excellent. &quot;The Chasin' Game&quot; and &quot;African Cookbook&quot; take advantage of the duel-horn lineup, and the quintet stretches both of these pieces out for seven minutes. While the overall effect of First Class! is a bit scattered, there's a great deal of excellent music on the disc that's sure to please the Kloss fan.\n","torrent":{"xt":"urn:btih:86d95d05081f10b169780c66edb38e1c3e0b3594","amp;dn":"Eric+Kloss+-+First+Class%21+%5B1967%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"86d95d05081f10b169780c66edb38e1c3e0b3594","infoHashBuffer":{"type":"Buffer","data":[134,217,93,5,8,31,16,177,105,120,12,102,237,179,142,28,62,11,53,148]},"announce":[],"urlList":[]}}