{"title":"Hitman.Absolution-SKIDROW","uid":7876329,"size":15163791092,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:86f0b8bce69592b34dfb6849f98cb9aac3fa014b&amp;dn=Hitman.Absolution-SKIDROW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"NepsterJay","files":78,"time":1354354086,"description":"Hitman Absolution (PC) (Scene Release - SKIDROW)\n\nRelease Date: 21-11-2012\nProtection: Steam+CEG+Custom\nGame Type: Action\nDiscs: 1 BLURAY Image\n\nHitman: Absolution follows the Original Assassin undertaking his most personal contract to date. Betrayed by the Agency and hunted by the police, Agent 47 finds himself pursuing redemption in a corrupt and twisted world.\n\nShowcasing Glacier 2 technology - HITMAN: ABSOLUTION has been built from the ground up, boasting a cinematic story, distinctive art direction and highly original game and sound design.\n\nContracts Mode - Create your own custom hits by choosing the level targets, weapons and the rules of assassination in an innovative new online mode. Created contracts can be shared with friends or the whole Hitman community and the money that you earn will unlock weapons upgrades and disguises.\n\nFreedom of Choice - Stalk your prey, fight them head on or adapt as you go along. As Agent 47 the choice is yours thanks to highly evolved gameplay mechanics and a ground-breaking AI system.\n\nExperience a Living, Breathing World - In the world of Hitman: Absolution every moment can become a story as unique characters, rich dialogue and Hollywood standard performances combine to create a gameplay experience like no other.\n\nDisguises - As Agent 47, the identity of almost anyone you meet is yours for the taking. Immobilise your prey, steal their outfit and use your instinct to blend in and deceive your enemies.\n\nInstinct Mode - See the world through the eyes of Agent 47 and become the world's deadliest assassin. Using Hitman: Absolution's Instinct Mode you'll predict enemy movement, discover new ways to kill and use high powered weaponry with deadly accuracy.\n\n-----------------------------------SYSTEM REQUIREMENTS---------------------------\n\nHitman Absolution Minimum System Requirements:\n\nOperating system: Windows Vista\nCPU: 2.4 GHz dual core Intel or AMD processor\nRAM: 1GB of system memory\nGraphics: DirectX 10 compatible card with 512 MB RAM. Nvidia 8-series or AMD Radeon 3000 series graphics cards\nSound: DirectX compatible sound card\nHDD Space: 15 GB\nDirectX: DirectX 10\nInput: Keyboard and Mouse\n\nHitman Absolution Recommended System Requirements:\n\nOperating system: Windows 7\nCPU: 2.6 GHz quad core Intel or AMD processor, Core i5 or Phenom X2 or better\nRAM: 2GB or more\nGraphics: DirectX 10 compatible card with 1GB of video memory, Nvidia 400-series or AMD 5000-series or better\nSound: DirectX compatible sound card\nHDD Space: 15 GB\nDirectX: DirectX 10\nInput: Keyboard and Mouse\n\n----------------------------------------INSTALL------------------------------------\n\n1. Unpack the release with winrar or equal program.\n2. Mount or burn image.\n3. Install game.\n4. Copy everything from inside the SKIDROW folder into the game installation directory overwriting any existing files.\n5. Block the game in your firewall and mark our cracked content as secure/trusted in your antivirus program.\n6. Play the game and enjoy.\n7. Support the companies, which software you actually enjoy!\n\n---------------------------------------NOTE----------------------------------------\n\nYou must have STEAM installed and updated in order for the game to load, once STEAM is updated it will open, then just close it as it does not have to be open to load the game.","torrent":{"xt":"urn:btih:86f0b8bce69592b34dfb6849f98cb9aac3fa014b","amp;dn":"Hitman.Absolution-SKIDROW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"86f0b8bce69592b34dfb6849f98cb9aac3fa014b","infoHashBuffer":{"type":"Buffer","data":[134,240,184,188,230,149,146,179,77,251,104,73,249,140,185,170,195,250,1,75]},"announce":[],"urlList":[]}}