{"title":"The Chad Mitchell Trio - Singin' Our Mind &amp; Reflecting [flac","uid":9932524,"size":428991835,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:86f4085003e93c0150433e77098399f73d8ae5c5&amp;dn=The+Chad+Mitchell+Trio+-+Singin%27+Our+Mind+%26amp%3B+Reflecting+%5Bflac&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rambam1776","files":-1,"time":1397119808,"description":"---------------------------------------------------------------------\n          Chad Mitchell Trio - Singing Our Mind/Reflecting\n---------------------------------------------------------------------\n\nArtist...............: Chad Mitchell Trio\nAlbum................: Singing Our Mind/Reflecting\nGenre................: Folk\nYear.................: 2003\nCodec................: Free Lossless Audio Codec (FLAC)\nVersion..............: reference libFLAC 1.2.1 20070917\nQuality..............: Lossless, (avg. compression: 57 %)\nChannels.............: Stereo / 44100 HZ / 16 Bit\nTags.................: VorbisComment\n &lt;a href=&quot;\nhttp://www.allmusic.com/album/singin-our-mind-mw0000858857&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.allmusic.com/album/singin-our-mind-mw0000858857&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.allmusic.com/album/reflecting-mw0000868095&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.allmusic.com/album/reflecting-mw0000868095&lt;/a&gt;\n &lt;a href=&quot;\nhttp://image.bayimg.com/5bd52ecac406258d3a34782a9b52342a6a270cab.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/5bd52ecac406258d3a34782a9b52342a6a270cab.jpg&lt;/a&gt;\n\n---------------------------------------------------------------------\n                       Tracklisting\n---------------------------------------------------------------------\n\n   1. Chad Mitchell Trio - Dubarry Done Gone Again            [02:26]\n   2. Chad Mitchell Trio - Ain't No More Cane On This Brazos  [03:04]\n   3. Chad Mitchell Trio - Four Strong Winds                  [03:32]\n   4. Chad Mitchell Trio - Alma Mater                         [03:01]\n   5. Chad Mitchell Trio - An Irish Song                      [02:41]\n   6. Chad Mitchell Trio - If Feel So Good About It           [02:09]\n   7. Chad Mitchell Trio - The Marvelous Toy                  [02:46]\n   8. Chad Mitchell Trio - Maladyozhenaya                     [02:31]\n   9. Chad Mitchell Trio - Nobody Knows You When You're Down And Out[03:32]\n  10. Chad Mitchell Trio - Bonny Streets Of Fyve-Io           [03:08]\n  11. Chad Mitchell Trio - Willie Seton                       [02:21]\n  12. Chad Mitchell Trio - Twelve Days                        [05:40]\n  13. Chad Mitchell Trio - Barry's Boys                       [03:51]\n  14. Chad Mitchell Trio - The Virgin Mary                    [03:08]\n  15. Chad Mitchell Trio - The Tarriers Song                  [02:02]\n  16. Chad Mitchell Trio - What Did You Learn In School Today [02:13]\n  17. Chad Mitchell Trio - The Hip Song                       [03:33]\n  18. Chad Mitchell Trio - The Banks Of Sicily                [03:21]\n  19. Chad Mitchell Trio - Tell Old Bill                      [02:38]\n  20. Chad Mitchell Trio - Queen Elinor's Confession          [03:18]\n  21. Chad Mitchell Trio - Stewball                           [02:48]\n  22. Chad Mitchell Trio - The First Time Ever                [01:57]\n  23. Chad Mitchell Trio - The Sinking Of Reuben James        [03:12]\n  24. Chad Mitchell Trio - In The Summer Of His Years/Rally Round The Flag[02:15]\n\nPlaying Time.........: 01:11:17\nTotal Size...........: 409.05 MB\n\nDouble CD Release of two original LPs - Singing Our Mind [1963) / Reflecting (1964)\n\nCollectors' Choice Music - CCM-372-2\n\nSingin' Our Mind is perhaps the most interesting album of the Chad Mitchell Trio's career. The record was released in 1963, smack dab in the middle of a profound shift in the landscape of American popular music. With the growing mass appeal of Bob Dylan and his interpreters (most notably Peter, Paul &amp; Mary), the mainstream folk scene was swelling with a newly embraced social consciousness. The album's title reflects the Chad Mitchell Trio's efforts to firmly establish themselves as part of the new movement. The liner notes make this abundantly clear, purposely distancing the group from &quot;button-down&quot; folkies and describing Mitchell and his compatriots as &quot;young men of conscience, with a serious purpose.&quot; Luckily, however, the album is no mere marketing ploy. The material here is truly first rate, and is performed with loads of enthusiasm as well as the typically impeccable technique that has always made aficionados single out the Mitchell Trio as musically the best of their breed. In this respect, each member gets his spot in the limelight. The often-underrated Michael Kobluk gives the album's most stirring performance on Ian Tyson's now classic &quot;Four Strong Winds.&quot; Mitchell himself gives a surprisingly hip and jazzy reading of the Bessie Smith tune &quot;Nobody Knows You When You're Down and Out,&quot; and Joe Frazier's powerful tenor soars above it all, giving an extra boost of energy to even the weakest tunes. The only heavy-handed moment comes in a parody of &quot;The Twelve Days of Christmas&quot; inspired by the death of a Nazi war criminal. Though somewhat embarrassing due to the use of stereotyped German accents, the performance is also a fascinating glimpse into the early '60s, when wartime bitterness remained fresh in the American consciousness, nearly twenty years after the conflict's end.\n\n\nThe first Chad Mitchell Trio release of 1964 was self-consciously political and somewhat downbeat. The album opens with &quot;Barry's Boys,&quot; a now-dated political piece that was controversial when it was released. This piece, along with a cute throwaway song by Shel Silverstein, and the wonderful version of Tom Paxton's &quot;What Did You Learn in School Today&quot; are the only humorous pieces on the album. The rest of Reflections is highly varied and includes a sweet Caribbean religious song, an Elizabethan ballad, and a pair of songs from the Second World War. The highlight of the album, and a clue regarding why the rest of the release might have a somewhat somber mood, is the closing medley of &quot;In the Summer of His Years&quot; and &quot;Rally 'Round the Flag.&quot; This album was recorded just after the assassination of President Kennedy, and the combination of the song commemorating his life and death with one written just after the assassination of President Lincoln was an inspired decision. It is no wonder that several songs on this album are expressions of grief, as the Chad Mitchell Trio reflected their times in song, and those times had just been marred by tragedy. Modern listeners experiencing this album for the first time will find much to respect in the expressive vocals and good song selections throughout the album, but may find that other albums by the group are more enjoyable. Note: This was the group's last release as the Chad Mitchell Trio. Subsequent releases were under the name the Mitchell Trio.","torrent":{"xt":"urn:btih:86f4085003e93c0150433e77098399f73d8ae5c5","amp;dn":"The+Chad+Mitchell+Trio+-+Singin%27+Our+Mind+%26amp%3B+Reflecting+%5Bflac","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"86f4085003e93c0150433e77098399f73d8ae5c5","infoHashBuffer":{"type":"Buffer","data":[134,244,8,80,3,233,60,1,80,67,62,119,9,131,153,247,61,138,229,197]},"announce":[],"urlList":[]}}