{"title":"Politics in the Age of Austerity by Wolfgang Streeck","uid":14014702,"size":2651623,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:87dc2b84bf0eb06a22db78c98df56f4c46116434&amp;dn=Politics+in+the+Age+of+Austerity+by+Wolfgang+Streeck&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"PirateBook","files":1,"time":1458858763,"description":"In a world of increasing austerity measures, democratic politics comes under pressure. With the need to consolidate budgets and to accommodate financial markets, the responsiveness of governments to voters declines. However, democracy depends on choice. Citizens must be able to influence the course of government through elections and if a change in government cannot translate into different policies, democracy is incapacitated.\r\n\r\nMany mature democracies are approaching this situation as they confront fiscal crisis. For almost three decades, OECD countries have - in fits and starts - run deficits and accumulated debt. As a result, an ever smaller part of government revenue is available today for discretionary spending and social investment and whichever party comes into office will find its hands tied by past decisions. \r\n\r\nThe current financial and fiscal crisis has exacerbated the long-term shrinking government discretion; projects for political change have lost credibility. Many citizens are aware of this situation: they turn away from party politics and stay at home on Election Day.\r\n\r\nWith contributions from leading scholars in the forefront of sociology, politics and economics, this timely book will be of great interest to students and scholars throughout the social sciences as well as general readers.\r\n\r\nGenre: Non Fiction Economics Politics","torrent":{"xt":"urn:btih:87dc2b84bf0eb06a22db78c98df56f4c46116434","amp;dn":"Politics+in+the+Age+of+Austerity+by+Wolfgang+Streeck","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"87dc2b84bf0eb06a22db78c98df56f4c46116434","infoHashBuffer":{"type":"Buffer","data":[135,220,43,132,191,14,176,106,34,219,120,201,141,245,111,76,70,17,100,52]},"announce":[],"urlList":[]}}