{"title":"The Training of O----ToO-28929 Casey Calvert MP4","uid":8291821,"size":2682047095,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:880d842fa001d4abe57b34b5c49df36b6a627844&amp;dn=The+Training+of+O----ToO-28929+Casey+Calvert+MP4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"merzedes","files":-1,"time":1364061330,"description":"The Training of the Pretty Girl, Day One\n\nMar 22, 2013 - Performers: Casey Calvert \n\n\nMP4 + Pics.    \n\n\nThe Training of the Pretty Girl, Day One My initial assessment of this tramp: she needs to feel pretty. Let me count that ways... \nDay One: make her pretty in heels.\nDay two: make her pretty in lipstick.\nDay three: Make her pretty in a corset.\nDay four: make her pretty in a leather collar.\nPut it all together and we have a four day curriculum in basic slave elegance. \n\nDay one: Pretty in Heels\nIn my world, the standard issue slave footwear is simple black patent leather heels - pointy toe, no platform. I keep thinking about what she would look like, teetering around in those tall black heels: a pretty little slut. \n\nI the Slow Pull\nSome like when the zipper comes off fast, a few like when it comes off slow. I like to pop those torturous little pins off one by one. And she gives it up, right away. So satisfying. \n\nII the Burn\nI like the way the lines run up the back of a sleek, well stripped calf. My style of calf raises will make her truly appreciate the wonderful assets of well toned calf muscles. \n\nIII the Inspection\nI like to wee what I am working with. What better way than to tie her open and inspect her, inside and out. \n\nIV the Orgasms\nTo round out the day, I decide to deliver a stream of orgasms to reinforce the day's points. If she can get up after that, she can have her heels. \n\nAt the end of the day, she is fitted with a set of heels, and she strides her ass gracefully around the set to show us her assets. I like those heels. I think we will keep them on her for three more days. \n\nThis update includes: slave inspection, medical fetish, anal plug, high heels training, BDSM zipper pull, bondage orgasms, slave discipline\n\nScreens   &lt;a href=&quot;\nhttp://www.thetrainingofo.com/site/shoot.jsp?shootId=28929&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.thetrainingofo.com/site/shoot.jsp?shootId=28929&lt;/a&gt;\n\n10 000 uploads and counting, 11k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:880d842fa001d4abe57b34b5c49df36b6a627844","amp;dn":"The+Training+of+O----ToO-28929+Casey+Calvert+MP4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"880d842fa001d4abe57b34b5c49df36b6a627844","infoHashBuffer":{"type":"Buffer","data":[136,13,132,47,160,1,212,171,229,123,52,181,196,157,243,107,106,98,120,68]},"announce":[],"urlList":[]}}