{"title":"Stossel.2014.02.20.[Stossel University].Fox Business.CF.avi","uid":9652464,"size":339510244,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:885e1fd20b767b3d8c24bcc3f23caca082511e34&amp;dn=Stossel.2014.02.20.%5BStossel+University%5D.Fox+Business.CF.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"skJGZV6z","files":-1,"time":1393119690,"description":"----------\n\nSTOSSEL - [Stossel University] - Fox Business Network\n2014, February 20, Thursday\n\nXvid/MP3 AVI - encoded from medium quality ReplayTV stream\n\n----------\n\n[excerpted from John Stossel's blog:]\n\nISFLC: This week, I do my show in front of 1,500 college students at the International Students for Liberty Conference in Washington, D.C.\n\nECONOMICS 101: Economist Don Boudreaux says it's not government, but the market that helps the poor. In 1958, &quot;The typical American worker back then had to work 30 hours to buy this vacuum cleaner. Today, a worker has to work only six hours to buy a much better vacuum.&quot; Abby McCloskey of AEI talks about how a minimum wage raise would actually hurt the poor.\n\nCONSTITUTION 101: How often is the word &quot;democracy&quot; used in the Constitution? Answer: never. Tim Sandefur, author of &quot;The Conscience of the Constitution,&quot; says that's because the Constitution focuses on restricting government to secure individual liberty.\n\nFREE SPEECH 101: Robert Shibley of FIRE talks about rules limiting speech on campuses. At Wellesley College, some students demand that the Sleepwalker statue (below) be removed.\n\nPERSONAL RESPONSIBILITY 101: Kmele Foster of The Independents started his own consulting firm as a sophomore in college. He says college graduates should be entrepreneurial, even though most universities don't teach entrepreneurial skills.\n\nPERSONAL LIBERTY 101: Nearly all of the campuses in the University of California system have banned electronic cigarettes. Katherine Mangu-Ward of Reason Magazine argues that adults should be able to choose what they want to put in their own bodies-even if that includes &quot;vaping&quot; e-cigarettes, marijuana, alcohol, meth, cocaine, etc.\n\nCOMMUNICATIONS 101: Cathy Reisenwitz, Editor-in-Chief of Sex and the State, says libertarians should &quot;check their privilege&quot; when they talk to liberals. They talk to women about making birth control available over the counter, and to Blacks about school choice. Julie Borowski of FreedomWorks disagrees, and says we shouldn't &quot;box&quot; individuals in order to reach them.\n\nMY LESSON: If you learn anything at Stossel U, it should be that the best type of government is limited government. The students at ISFLC understand that. Old politicians and old voters may never change their minds. But libertarianism grows fastest among the young, and so groups like Students for Liberty give me hope.","torrent":{"xt":"urn:btih:885e1fd20b767b3d8c24bcc3f23caca082511e34","amp;dn":"Stossel.2014.02.20.%5BStossel+University%5D.Fox+Business.CF.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"885e1fd20b767b3d8c24bcc3f23caca082511e34","infoHashBuffer":{"type":"Buffer","data":[136,94,31,210,11,118,123,61,140,36,188,195,242,60,172,160,130,81,30,52]},"announce":[],"urlList":[]}}