{"title":"DropDMG","uid":4997867,"size":7925233,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:8923f7c2dc75f8d446ba2079aa882be0fc1bb74c&amp;dn=DropDMG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"troweprice05","files":399,"time":1247368395,"description":"MacUpdate:\n\nDropDMG is an easy way to create Mac OS X disk images. Just drag and drop a folder or file, and DropDMG will create an image in &quot;.dmg&quot;, &quot;.img&quot;, or &quot;.smi&quot; format--or a Tar, Zip, or StuffIt archive. Or, you can drag an existing image or archive file onto DropDMG to easily convert it to any of the other supported formats. DropDMG supports encryption, segmented images, and custom icons, and it can create images with rich-text license agreements in multiple languages. There are many time-saving features such as temporary preferences when you hold down Option, remembering recent folders, configurations to keep track of popular combinations of settings, and the ability to create more than one image or archive at a time. All the options are available from Automator, AppleScript, and from the &quot;dropdmg&quot; command-line tool. Use DropDMG to:\n\nBackup your important folders (you know you should) and archive your old files.\nBurn to CD or DVD, spanning multiple discs if necessary.\nPrepare Mac OS X software for distribution.\nCompress files before sharing them.\nCreate a disk image that stores a snapshot of an entire volume.\nEncrypt folders that you want to keep private.\n\nThis contains the application downloaded from the developer's website + a serial from Serial Box.","torrent":{"xt":"urn:btih:8923f7c2dc75f8d446ba2079aa882be0fc1bb74c","amp;dn":"DropDMG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8923f7c2dc75f8d446ba2079aa882be0fc1bb74c","infoHashBuffer":{"type":"Buffer","data":[137,35,247,194,220,117,248,212,70,186,32,121,170,136,43,224,252,27,183,76]},"announce":[],"urlList":[]}}