{"title":"The 13.5 Lives of Captain Bluebear - Walter Moers","uid":8510960,"size":702401089,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:89b0e9b51426a7113d82ebfe120fac1d144c558e&amp;dn=The+13.5+Lives+of+Captain+Bluebear+-+Walter+Moers&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"abvault","files":99,"time":1369584716,"description":"Captain Bluebear is a bear with blue fur, a creature as unique as the fantastic adventures he undergoes. Unlike cats, which have only nine lives, bluebears have twenty-seven. This is fortunate, because our hero is forever avoiding disaster by a paw's breadth. In this remarkable ook, Captain Bluebear tells the story of his first thirteen-and-a-half lives spent on the mysterious continent of Zamonia, where intelligence is an infectious disease and water flows uphill, where headless giants\nroam deserts made of sugar, and where only Captain Bluebear's courage and ingenuity enable him to escape the dangers that lie in wait for him around every corner. In company with our indomitable hero, we enter a realm of the imagination that combines the fantasy of The Lord of the Rings and The Neverending Story with the humour of Baron Munchausen, and where anything can exist except boredom. It's a land of imaginative lunacy and supreme adventure, wicked satire and epic fantasy, all mixed\ntogether and turned on its head. Playful enough for young adult readers, yet as intricate and engaging as any work of literary fiction, The 13 1/2 Lives of Captain Bluebear has the plot of a novel and the spontaneity and humor of a vintage comic book, making it an instant international cult classic.\nRead by Bronson Pinchot\nUnabridged.\n\n------------------------------\nVisit us for this and more. Book requests can also be made through the site:\n\nwww.audiobookvault.ws\n------------------------------","torrent":{"xt":"urn:btih:89b0e9b51426a7113d82ebfe120fac1d144c558e","amp;dn":"The+13.5+Lives+of+Captain+Bluebear+-+Walter+Moers","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"89b0e9b51426a7113d82ebfe120fac1d144c558e","infoHashBuffer":{"type":"Buffer","data":[137,176,233,181,20,38,167,17,61,130,235,254,18,15,172,29,20,76,85,142]},"announce":[],"urlList":[]}}