{"title":"Death Note.Cap 20.spanish.DVDrip.avi","uid":4859887,"size":244326400,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:8a81da4c57575209b2fa420e02a4e741ea017866&amp;dn=Death+Note.Cap+20.spanish.DVDrip.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sahae","files":1,"time":1240223725,"description":"Light Yagami es, al parecer, uno de los estudiantes mÃƒÂ¡s conspicuos de JapÃƒÂ³n, \ncomo bien dice ÃƒÂ©l. Detesta el crimen y la maldad que existe en el mundo, y \nsueÃƒÂ±a con un entorno utÃƒÂ³pico libre de tales lacras. Su vida cambia radicalmente \ncuando encuentra en el suelo un misterioso cuaderno en cuya portada se lee \nDEATH NOTE (cuaderno de muerte). DetrÃƒÂ¡s del cuaderno hay instrucciones \nsobre su uso, donde destaca el hecho de poder matar a una persona \n(siempre y cuando se conozca el rostro de ella) de cualquier causa que se \nespecifique entre los siguientes 6 minutos con 40 segundos, sino se especifica \nsimplemente muere de un ataque al corazÃƒÂ³n 40 segundos despuÃƒÂ©s de escribir el\n nombre de aquella persona en el Death Note. Light se mantiene escÃƒÂ©ptico de \nla autenticidad del cuaderno, pero despuÃƒÂ©s de probarlo en dos ocasiones, se da \ncuenta que su poder es real. Pasados 5 dÃƒÂ­as lo visita un shinigami llamado \nRyuk. Los shinigamis son seres de otra dimensiÃƒÂ³n que usan los Death Note para \nmatar personas y asÃƒÂ­ prolongar su propia existencia. Ryuk le explica a Light\n que el Death Note que encontrÃƒÂ³ le pertenece, pero cuando se extravÃƒÂ­a, en el \nmundo humano, automÃƒÂ¡ticamente pasa a ser posesiÃƒÂ³n de la persona que la encuentre,\n hasta que ÃƒÂ©sta ÃƒÂºltima muera o el cuaderno sea destruido. A su vez Light le \ncuenta a Ryuk que su objetivo es matar a los criminales, para asÃƒÂ­ limpiar al \nmundo de la maldad y convertirse en el dios de un mundo nuevo, libre de crimen.\n\nPronto, las numerosas muertes sin explicaciÃƒÂ³n atraen la atenciÃƒÂ³n de la policÃƒÂ­a, \nla cual pide ayuda a un misterioso detective mundialmente conocido como L. L se \nda cuenta que Kira (apodo con el cual se conoce al asesino, el cual es Light) \npuede matar a las personas con sÃƒÂ³lo conocer su nombre y su rostro.","torrent":{"xt":"urn:btih:8a81da4c57575209b2fa420e02a4e741ea017866","amp;dn":"Death+Note.Cap+20.spanish.DVDrip.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8a81da4c57575209b2fa420e02a4e741ea017866","infoHashBuffer":{"type":"Buffer","data":[138,129,218,76,87,87,82,9,178,250,66,14,2,164,231,65,234,1,120,102]},"announce":[],"urlList":[]}}