{"title":"Rage Against The Machine - Evil Empire(1996)[Eac Flac Cue][Rock","uid":5073643,"size":334179750,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:8aa9125e50b32603c2866ceefdfa0255ad908b19&amp;dn=Rage+Against+The+Machine+-+Evil+Empire%281996%29%5BEac+Flac+Cue%5D%5BRock+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Maste75","files":22,"time":1251627549,"description":"==================================================================\n                        Rock City Crew\n==================================================================\n\nReleaser: Maste75\nCrew: Rock City\n\nExtractor: EAC 0.99 prebeta 5 \nRead Mode: Secure with NO C2, accurate stream, disable cache.\nCodec: Flac 1.2.1;  Level 8  \nSource: Original CD\nArtwork: Front, Back, inside, inlay and CD (Web Found).\n\n\nGeneral Info:\n\n\nArtist: Rage Against The Machine\n\nAlbum Title: Evil Empire\n\nYear: 1996\n\n\n\nTracklist:\n\n1. People Of The Sun\n2. Bulls On Parade\n3. Vietnow\n4. Revolver\n5. Snakecharmer\n6. Tire Me\n7. Down Rodeo\n8. Without A Face\n9. Wind Below\n10.Roll Right\n11.Year Of Tha Boomerang\n\n\n\nReview taken from Rollingstone.com:\n\nHeavy metal has never been much of a forum for political discourse.\n Not that all razor-edged rockers are lunkheads, but many are just too\n narcissistic to see beyond their own narrow world Either they're obsessed\n with decadence and debauchery or consumed by misery and hatred.\n Neither situation leaves much room for intelligent discussion\n of the issues of the day.\n\nRage Against the Machine hope to change that with their inflammatory\n blend of roaring guitars, barked raps and political activism.\n Their lyrics lambaste government corruption, media manipulation, big business,\n complacency and ambivalence, and the band members practice what they preach.\n Since the release of their debut album in 1992, they've walked onstage\n naked at Lollapalooza with electric tape over their mouths to protest\n music censorship, played a benefit show for the death-row inmate\n Mumia Abu-Jamal and spoken out against the imprisonment of the American\n Indian Movement leader Leonard Peltier.\n\nRage's first album adhered a bit too closely to the band's influences,\n invoking the force of Black Sabbath, the swaggering stomp of Led Zeppelin and\n the confrontational rap style of Public Enemy. The lyrics lashed out against\n a range of domestic problems, including police brutality,\n the educational system and innercity violence. But while the album was ambitious,\n it failed to meet its lofty goals. Disaffected teens rallied behind\n the cries of &quot;Fuck you/I won't do what you told me,&quot; from &quot;Killing in the Name,&quot; but\n they seemed to view Rage's appeal as an excuse to skip school and take drugs.\n\nThat was four years ago, and since that time, Rage Against the Machine have\n honed their marksmanship and fine-tuned their agenda. If the band's first\n album was a call to arms, Evil Empire is a declaration of war, only this time,\n many of the group's diatribes are aimed at foreign soil. Vocalist and\n lyricist Zack De La Rocha has become involved with the continuing\n struggle of the Zapatistas, a group of Mexican farmers seeking emancipation\n from the ruling class, and at least three songs on Evil Empire address the issue.\n On &quot;Without a Face,&quot; which features tornado guitar gusts that build and dip over\n a sparse funk beat, De La Rocha outlines the dilemma: &quot;Maize was all we needed\n to sustain/Now her golden skin burns insecticide rain/Ya down with DDT, yeah, you\n know me/Raped for the grapes, profit for the bourgeois.&quot;\n\nElsewhere, the band focuses its sights on the U.S. military (&quot;Bulls on Parade&quot;),\n the American dream (&quot;Tire Me&quot;) and right-wing talk shows (&quot;Vietnow&quot;).\n De La Rocha has always been radical in his beliefs, but on Evil Empire,\n he comes off like a hybrid of the Terminator and Robin Hood, on a mission\n to annihilate the power elite and redistribute the wealth.\n\nOn a sonic level the band still anchors its sound in the music of Led Zeppelin\n and Red Hot Chili Peppers, but its horizons have widened, and it now incorporates\n influences like Fugazi and Helmet. Rage also have acquired a greater\n understanding of hip-hop and funk and have injected the techniques of artists\n such as Dr. Dre, Cypress Hill, and Sly and the Family Stone into their\n turbocharged rhythms. As a result, there's a greater synergy between\n the music and the message.\n\nMaking better use of dynamics, guitarist Tom Morello coaxes a startling array\n of sounds from his strings and effect pedals. At various moments the guitars\n resemble power drills, machine guns and fax machines. &quot;Bulls on Parade&quot; incorporates\n funky wah-wah guitar strums and an intricate record-scratching solo\n into a blasting rhythm. &quot;Wind Below&quot; is driven by a riff that recalls\n a slowed-down version of Zeppelin's &quot;Black Dog,&quot; and &quot;Revolver&quot; starts with\n underwater guitar echoes that sound like &quot;EXP,&quot; by Jimi Hendrix, before\n shifting into a murky, psychedelic section similar to Zeppelin's &quot;No Quarter&quot; and\n ending with a punk riff reminiscent of Beck's &quot;Mutherfuker.&quot;\n\nIn an era in which political candidates are weaker than Styrofoam and the American\n public grows more ambivalent by the minute, perhaps De La Rocha's radical\n rhetoric can make a difference. As Plato said, &quot;The introduction of a new kind\n of music must be shunned as imperiling the whole state, since styles of music\n are never disturbed without affecting the most important political institutions.&quot;\n\n \n--------------------------------------------------------------------\n\nEnjoy our releases and help us with sharing, please.\n\n\n\nPeak level 99.3 %\n     Track quality 100.0 %\n     Test CRC C58E44FB\n     Copy CRC C58E44FB\n     Accurately ripped (confidence 129)  [03034183]\n     Copy OK\n\nAll tracks accurately ripped\n\nNo errors occurred\n\nEnd of status report","torrent":{"xt":"urn:btih:8aa9125e50b32603c2866ceefdfa0255ad908b19","amp;dn":"Rage+Against+The+Machine+-+Evil+Empire%281996%29%5BEac+Flac+Cue%5D%5BRock+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8aa9125e50b32603c2866ceefdfa0255ad908b19","infoHashBuffer":{"type":"Buffer","data":[138,169,18,94,80,179,38,3,194,134,108,238,253,250,2,85,173,144,139,25]},"announce":[],"urlList":[]}}