{"title":"The Cardigans - Lovefool  (2nafish)","uid":5364201,"size":136187908,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:8c0f1836e24465b6efb2e561750ea2d8d6ac3b6c&amp;dn=The+Cardigans+-+Lovefool++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1266212142,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nNote: This video is a &quot;Movies &amp; Music&quot; video so it has 2 logos.\n\n\n&quot;Lovefool&quot; is a pop song written by Peter Svensson and Nina Persson for The Cardigans' third studio album First Band on the Moon, released as a single on 14 September 1996, in the United Kingdom and internationally on 5 October 1996. The song was featured in the film William Shakespeare's Romeo + Juliet. It was released as the album's lead single in 1996. The single topped the charts in New Zealand, and was certified gold in Australia. &quot;Lovefool&quot; has also been covered by The Hush Sound, and they have played the song at several of their shows. More recently the song has been covered by New Found Glory in their album &quot;From The Screen To Your Stereo Part II.&quot;\n\nThe song became the Cardigans' first real hit single, topping the Billboard Hot 100 Airplay chart and making appearances on six other Billboard charts. In 1997, the song found international success, peaking at #2 on the UK singles chart and finding moderate success on most European charts.\n\nThe song's US music video features Lemuel Gulliver from Gulliver's Travels being lost on an island holding a gold bottle being put in the water.\n\nFirst Band on the Moon is the third studio album by The Cardigans. It features the international hit-single &quot;Lovefool&quot;. It was first released on August 12, 1996 and later internationally on September 9, 1996. The song &quot;Happy Meal II&quot; can be viewed as either a partial rewrite or a sequel to &quot;Happy Meal,&quot; which appears in similar lyric and structure on the US version of their preceding album, Life.\n\nThe album was a major breakthrough for the band, both in their native Sweden and internationally. Before 1996 they had been seen in Sweden as one of many hopeful, slightly twee indie bands, but First Band on the Moon was greeted with rave reviews, pointing both to their more varied sound and to Nina Persson's new assuredness as singer and main lyricist. In Britain and the US the single Lovefool was the first track that truly got them noticed and this attention spread to the album itself.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:8c0f1836e24465b6efb2e561750ea2d8d6ac3b6c","amp;dn":"The+Cardigans+-+Lovefool++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8c0f1836e24465b6efb2e561750ea2d8d6ac3b6c","infoHashBuffer":{"type":"Buffer","data":[140,15,24,54,226,68,101,182,239,178,229,97,117,14,162,216,214,172,59,108]},"announce":[],"urlList":[]}}