{"title":"La storia in giallo 134 - Gabriele D Annunzio [Mp3 Ita] [TNTvill","uid":6603495,"size":69515098,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:8c2a8b7550a35ec1408f97108a7657890b568bbb&amp;dn=La+storia+in+giallo+134+-+Gabriele+D+Annunzio+%5BMp3+Ita%5D+%5BTNTvill&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"darayava","files":1,"time":1313313753,"description":"La storia in giallo 134 - Gabriele D_Annunzio [Mp3 Ita] [TNTvillage]\n\nLA STORIA IN GIALLO\n\nLa Storia in giallo  ÃƒÂ¨ un programma in onda su radio3 scritto e condotto da Antonella Ferrera, con la regia di Francesco Pannofino, regia del dibattito di Manuel de Lucia, musiche originali di Alessandro Molinari, assistenza tecnica di Fiore Liborio, cura di Diana Vinci.\nRedazione: Carlo Dellonte e Roberto Ritondale Paola Veneto\nDa poco ha subito il mutamento nel nome diventando: Cuore di Tenebra\n\nLa storia e le storie di personaggi celebri, le vicende tragiche o misteriose che hanno segnato I loro destini e a volte quelli di molti altri. Uomini della politica o del malaffare, uomini di fede o vissuti nel peccato, personalitÃƒÂ  borderline, mitomani o geni maledetti. Le devianze e I turbamenti di grandi artisti di tutti I tempi che hanno riversato nella loro opera la fatica o la follia del vivere.\nLa Storia in Giallo li racconta come in un film, attraverso le voci dei migliori doppiatori italiani. Dopo lo sceneggiato che catapulta l'ascoltatore al centro di una storia, segue l'intervista ad un personaggio della cultura che ne spiega e racconta dinamiche, curiositÃƒÂ  e risvolti inediti.\n\nLa storia in giallo - in onda il 08/10/2005\n\nGABRIELE D'ANNUNZIO\n\n\n&quot;Giudicatelo come volete, esaltatelo o condannatelo, voi non potete disconoscere che egli riempiva della sua personalitÃƒÂ  esuberante tutto il mondo della poesia, del romanzo e del teatro&quot;. \nCosÃƒÂ¬ Edoardo Scarfoglio ha voluto ricordare Gabriele D'Annunzio, il vate, l'eroe, l'amante, il patriota. Una vita sempre al limite, tra passioni struggenti e celebri imprese. La sua relazione con Eleonora Duse, l'attivitÃƒÂ  politica e mondana, ne hanno fatto un maestro di costume unico nel suo genere.\nAntonella Ferrera, per analizzare luci ed ombre di una vita tanto tumultuosa, ospita la Professoressa Anna Maria Andreoli, presidente della Fondazione Vittoriale degli Italiani.\nLa voce di Gabriele D'Annunzio ÃƒÂ¨ quella di Alessandro Pala.\n\nFile Details\n========================================\nName..........: 2005 - Gabriele D'annunzio.mp3\nFilesize......: 66Mb\n\nAudio Bitrate.: 192Kbps\nAudio Freq....: 44KHz\nAudio Channels: Mono\n\nVisit http://www.tntvillage.scambioetico.org/","torrent":{"xt":"urn:btih:8c2a8b7550a35ec1408f97108a7657890b568bbb","amp;dn":"La+storia+in+giallo+134+-+Gabriele+D+Annunzio+%5BMp3+Ita%5D+%5BTNTvill","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8c2a8b7550a35ec1408f97108a7657890b568bbb","infoHashBuffer":{"type":"Buffer","data":[140,42,139,117,80,163,94,193,64,143,151,16,138,118,87,137,11,86,139,187]},"announce":[],"urlList":[]}}