{"title":"Addictive Simulations Pitts Special S1 [FSX] [FS9]","uid":6911984,"size":164943473,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:8db67732db50156fd4ed40c6a6ec628961cfe844&amp;dn=Addictive+Simulations+Pitts+Special+S1+%5BFSX%5D+%5BFS9%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"alef1995","files":2,"time":1324857901,"description":"    Available for FSX and FS2004 immediately!\n\nPayment Methods\nThe Pitts Special S1 from Addictive Simulations - We promise you everything but the G-Forces!\nIf you are looking for the ultimate in high performance aerobatic aircraft then look no further than our Pitts Special S1. Developed for FS2004 and from the ground-up for FSX, this little aircraft is like no other that you have ever flown!\nFeaturing a raft of special features including:-\n\n    Flight model verified by active Pitts pilots to ensure absolute realism.\n    Custom high-poly, low frame rate modelling techniques that bring the aircraft to life without impacting your performance!\n    The FSX model features full bump mapping and specular lighting bringing every joint and rivet to life in vivid detail!\n    An accurate facsimile of a real Pitts Special that was made available to us for the life of product development to ensure ultimate realism, right down to the pilot!\n    Custom animations including an operable canopy, chocks and ties!\n    Three animated pilots, 2 male and 1 female!\n    Installer provides both FS2004 and FSX unique versions\n\n    An integral configuration manager that allows you to change animations on the fly without having to reload the aircraft\n    Six custom liveries and artwork crafted by industry supremo artist Daniel Dunn!\n    Custom smoke trails let you paint the sky as you loop and roll!\n    Purists will welcome the detailed performance charts and checklists. Yes, our Pitts flies by the book, so we give you the important pages of the book!\n    Spin, loop and twist as you achieve aerobatic heaven flying the Pitts Special S1 - the nimble aircraft that has won more aerobatic awards than any other!\n\n        ***************************alef1995****************************","torrent":{"xt":"urn:btih:8db67732db50156fd4ed40c6a6ec628961cfe844","amp;dn":"Addictive+Simulations+Pitts+Special+S1+%5BFSX%5D+%5BFS9%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8db67732db50156fd4ed40c6a6ec628961cfe844","infoHashBuffer":{"type":"Buffer","data":[141,182,119,50,219,80,21,111,212,237,64,198,166,236,98,137,97,207,232,68]},"announce":[],"urlList":[]}}