{"title":"The Politically Incorrect Guide to Global Warming-Christopher C.","uid":4001004,"size":243687152,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8f21ad7efe924d9b889f61b92d0e4bf97f8d6232&amp;dn=The+Politically+Incorrect+Guide+to+Global+Warming-Christopher+C.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"xofokim","files":16,"time":1201562762,"description":"Book Description\nThis latest installment in the P.I.G. series provides a provocative, entertaining, and well-documented expose of some of the most shamelessly politicized pseudo-science we are likely to see in our relatively cool lifetimes. \n\nFrom the Inside Flap\n\\&quot;Global warming\\&quot;:the Left\\&amp;#039;s last best chance to gain a stranglehold on our political system and economy\n\nFor decades, environmentalism has been the Left\\&amp;#039;s best excuse for increasing government control over our actions in ways both large and small. It\\&amp;#039;s for Mother Earth! It\\&amp;#039;s for the children! It\\&amp;#039;s for the whales! But until now, the doomsday-scenario environmental scares they\\&amp;#039;ve trumped up haven\\&amp;#039;t been large enough to justify the lifestyle restrictions they want to impose. With global warming, however, greenhouse gasbags can argue that auto emissions in Ohio threaten people in Paris, and that only \\&quot;global governance\\&quot; (Jacques Chirac\\&amp;#039;s words) can tackle such problems.\n\nNow, in The Politically Incorrect Guide(tm) to Global Warming and Environmentalism, Christopher C. Horner tears the cover off the Left\\&amp;#039;s manipulation of environmental issues for political purposes--and lays out incontrovertible evidence for the fact that catastrophic man-made global warming is just more Chicken-Little hysteria, not actual science. He explains why, although Al Gore and his cronies among the media elites and UN globalists endlessly bleat that \\&quot;global warming\\&quot; is an unprecedented global crisis, they really think of it as a dream come true. It\\&amp;#039;s the ideal scare campaign for those who hate capitalism and love big government. For, as Horner explains, if global warming really were as bad as the Leftist doomsayers insist it is, then no policy imaginable could \\&quot;solve\\&quot; it. According to the logic of the greens\\&amp;#039; own numbers, no matter how much we sacrifice there would still be more to do. That makes global warming the bottomless well of excuses for the relentless growth of big government.\n\nHorner (an attorney and senior fellow at the Competitive Enterprise Institute) reveals the full anti-American, anti-capitalist, and anti-human agenda of today\\&amp;#039;s environmentalists, dubbing them \\&quot;green on the outside, red to the core.\\&quot; He details how they use strong-arm legal tactics--and worse--against those who dare to point out the weakness of their arguments for global warming. Along the way, he explodes ten top global warming myths, carefully examining the evidence to determine how much warming there really is and what is actually causing it. He exposes the lies that the environmental lobby routinely tells to make its case; the ways in which it is trying to impose initiatives such as the Kyoto Protocol on an unwilling American public; and much more--including the green lobby\\&amp;#039;s favorite politicians (John Kerry, John McCain, Joe Lieberman, and others).\n\nIt\\&amp;#039;s time to stand up to the environmentalist industry and insist: human beings are not the enemy. In breezy, light-hearted, and always entertaining fashion, The Politically Incorrect Guide(tm) to Global Warming and Environmentalism gives you the facts you need to do so. \n\n","torrent":{"xt":"urn:btih:8f21ad7efe924d9b889f61b92d0e4bf97f8d6232","amp;dn":"The+Politically+Incorrect+Guide+to+Global+Warming-Christopher+C.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f21ad7efe924d9b889f61b92d0e4bf97f8d6232","infoHashBuffer":{"type":"Buffer","data":[143,33,173,126,254,146,77,155,136,159,97,185,45,14,75,249,127,141,98,50]},"announce":[],"urlList":[]}}