{"title":"Miranda","uid":6184940,"size":1218090604,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:8fd097cf7345f5f9ce2983f6df40bf5e8089be17&amp;dn=Miranda&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"d1rtd1ver2011","files":6,"time":1298086513,"description":"Uploaded by d1rtd1ver2011..... please seed thanx\n\n\n\nMiranda is a BBC television series written by and starring comedienne Miranda Hart, which first aired on BBC Two on 9 November 2009. The situation comedy also features Sarah Hadland, Tom Ellis, Patricia Hodge and Sally Phillips. The series is based on Hart's semi-autobiographical writing and followed a television pilot and the BBC Radio 2 comedy Miranda Hart's Joke Shop.\n\nDescribed as an &quot;old-fashioned&quot; sitcom, it received positive comments from critics and Hart won the 2009 Royal Television Society award for comedy performance for her role in the first series. A second series was commissioned and filming started in mid 2010. The series began airing on BBC Two and BBC HD on 15 November 2010. A third series has been comissioned and will air on BBC One.\n\nSituation\n\nMiranda (Miranda Hart) is 6 feet 1 inch (1.85 m) tall and gets called 'Sir' once too often. Since attending boarding school, she has never really fitted in with old girls Tilly (Sally Phillips) and Fanny (Katy Wix) and finds social situations awkward, especially around men. She is a constant disappointment to her mother Penny (Patricia Hodge), who is desperate for her to get a proper job and a husband. Although Miranda owns, and lives above, a joke shop, she lacks any real capacity for business, so it is managed by her childhood friend Stevie Sutton (Sarah Hadland). The restaurant next door is run by chef Gary Preston (Tom Ellis), a university friend whom Miranda fancies, and waiter Clive (James Holmes). The various episodes revolve around this set-up.","torrent":{"xt":"urn:btih:8fd097cf7345f5f9ce2983f6df40bf5e8089be17","amp;dn":"Miranda","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8fd097cf7345f5f9ce2983f6df40bf5e8089be17","infoHashBuffer":{"type":"Buffer","data":[143,208,151,207,115,69,245,249,206,41,131,246,223,64,191,94,128,137,190,23]},"announce":[],"urlList":[]}}