{"title":"Sleep My Love (1948) Xvid 1cd - Claudette Colbert, Robert Cummin","uid":10781160,"size":733904896,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8ffa75a90cf3c913dd7384648885724fdae0e569&amp;dn=Sleep+My+Love+%281948%29+Xvid+1cd+-+Claudette+Colbert%2C+Robert+Cummin&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"SaM","files":1,"time":1408163911,"description":"Sleep My Love (1948) Xvid 1cd - Claudette Colbert, Robert Cummings [DDR]\n\n    CAST:-\n    Claudette Colbert as Alison Courtland\n    Robert Cummings as Bruce Elcott\n    Don Ameche as Richard W. Courtland\n    Rita Johnson as Barby\n    George Coulouris as Charles Vernay\n    Queenie Smith as Mrs. Grace Vernay\n    Ralph Morgan as Dr. Rhinehart\n    Keye Luke as Jimmie Lin\n    Raymond Burr as Detective Sgt. Strake\n    Hazel Brooks as Daphne\n\nDirected by Douglas Sirk\nProduced by Ralph Cohn, Mary Pickford, Charles Rogers\nMusic by Rudy Schrager\nRunning time 97 minutes\n\nMOVIE PLOT:- Sleep My Love (1948)\nAlison Courtland, a wealthy New Yorker, hasn't a clue how she ended up on a train bound for Boston. When she phones her husband, Richard, the police listen in and learn from Richard that his wife has threatened him with a gun. On a flight home, fellow passenger Bruce Elcott falls in love with the married but unhappy Alison. Her husband makes Alison begin seeing Dr. Rhinehart, a psychiatrist. But it turns out that Rhinehart is a fake. He is actually Charles Vernay, a photographer hired by Richard Courtland, who is having an affair with another woman and hopes to get rid of Alison for good.\n\nThe scheme is to drive Alison to suicide and inherit her money. Elcott arrives just in time to find Alison, apparently under hypnosis, about to leap from a balcony to her death. Elcott discovers that Vernay is the man who pretended to be the doctor. Richard, meanwhile, attempts to drug Alison and make her kill the doctor herself. Vernay finds out he has been betrayed. Verney then shoots Richard and is later killed by falling through a skylight after being chased by Elcott. It appears Elcott and Alison live happily ever after.\n\nCRITICAL RESPONSE\nFilm critic Dennis Schwartz gave the film a mixed review, writing, &quot;Douglas Sirk's minor film noir thriller, produced by Mary Pickford and her husband Buddy Rogers, is much like Gaslight in plot (hubby tries to convince his wife she's going nuts), but ultimately the narrative sinks because the plot becomes increasingly too absurd to be believed. It's adapted from the novel by Leo Rosten. Cy Endfield contributed the Chinatown wedding scene, which was wonderful but added nothing to the story except a chance to introduce Keye Luke into the plot--his presence alone makes the film look much like a Charlie Chan episode ... Even Douglas Sirk (The Tarnished Angels/Written on the Wind/Shockproof) dismissed the film as a failure. It's certainly not up to his better works, but it's not that bad--it even does a good job evoking a nightmarish scenario of insanity (thanks in a large part to the expressionist photography of Joseph Valentine). The creepy Coulouris lurking around the spacious darkened house with the winding staircase provides the chills to go along with the spooky atmosphere.&quot;\n\nTECHNICAL SPECIFICATIONS:-\nVideo Bitrate: 1295 kbps\nVideo Resolution: 640x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 23.976\nAudio Codec: 0x2000 (Dolby AC3) AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams: 2\nAudio Languages: English\nRunTime: 97 mins\nSubtitles: NONE\nRipped by: Trinidad [DDR]   \nDuration: 97 mins","torrent":{"xt":"urn:btih:8ffa75a90cf3c913dd7384648885724fdae0e569","amp;dn":"Sleep+My+Love+%281948%29+Xvid+1cd+-+Claudette+Colbert%2C+Robert+Cummin","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8ffa75a90cf3c913dd7384648885724fdae0e569","infoHashBuffer":{"type":"Buffer","data":[143,250,117,169,12,243,201,19,221,115,132,100,136,133,114,79,218,224,229,105]},"announce":[],"urlList":[]}}