{"title":"Man-Eaters of Kumaon - Jim Corbett [PDF]","uid":12282343,"size":37260014,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:900040cb01c662511957481260c3a8ca444cec3d&amp;dn=Man-Eaters+of+Kumaon+-+Jim+Corbett+%5BPDF%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"perfect_stan","files":1,"time":1440430745,"description":"Man-Eaters of Kumaon\n\nby Jim Corbett\n\n\nMan-Eaters of Kumaon is a book written by hunter-naturalist Jim Corbett. It details the experiences that Corbett had in the Kumaon region of India from the 1900s to the 1930s, while hunting man-eating tigers and leopards. One tiger, for example, was responsible for over 400 human deaths. Man-Eaters of Kumaon is the best known of Corbett's books and contains 10 stories of tracking and shooting man-eaters in the Indian Himalayas during the early years of the twentieth century. The text also contains incidental information on flora, fauna and village life.\n\nBook Contents-\n\nIntroduction - by Sir Maurice Hallett.\n\nPreface - by Lord Linlithgow.\n\nAuthors Note - Causes of Man-eating in Tigers and Leopards.\n\n01. Champawat Man-eater - The story of the first man-eating tiger shot by Corbett in 1907. Reportedly the man-eater claimed 436 human victims in Nepal and India.\n\n02. Robin -  Stories of Corbett's hunting companion Robin, his faithful spaniel.\n\n03. The Chowgarh tigers - The first of three man-eaters Corbett was to shoot on government request at a 1929 district conference. It turned out to be a pair of two tigers, a mother and its grown cub, which had together killed 64 people between 1925-30. The cub was shot in April 1929 and the mother on 11 April 1930.\n\n04. The Bachelor of Powalgarh - The exciting tale of how Corbett shot the much sought after trophy tiger (non man-eater) in 1930.\n\n05. The Mohan Man-eater - The second of the three man-eaters Corbett was requested to shoot at the 1929 conference. Shot in May 1931.\n\n06. Fish of my Dreams - Corbett reflects on the joys of fishing for Mahseer (Indian river trout) in submontane rivers.\n\n07. The Kanda Man-eater - The third of the three man-eaters requested for dispatch at the 1929 conference. Shot in 1933.\n\n08 The Pipal Pani Tiger - Corbett traces 15 years of history of a local tiger (non man-eater), from its tracks in the mud as a cub, up until its death 15 years later.\n\n09. The Thak Man-eater - The last Man-eater Corbett shot in November 1938 (aged 63).\n\n10. Just Tigers - Corbett talks about the importance of conservation and his love of photographing tigers in the place of shooting them.\n\n\nEnjoy and please SEED!!!","torrent":{"xt":"urn:btih:900040cb01c662511957481260c3a8ca444cec3d","amp;dn":"Man-Eaters+of+Kumaon+-+Jim+Corbett+%5BPDF%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"900040cb01c662511957481260c3a8ca444cec3d","infoHashBuffer":{"type":"Buffer","data":[144,0,64,203,1,198,98,81,25,87,72,18,96,195,168,202,68,76,236,61]},"announce":[],"urlList":[]}}