{"title":"HISTORY OF POP AND ROCK MUSIC - part 435","uid":7826920,"size":287311223,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:90aeb3c3b68728d46647cb308143ae9ee2c23178&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+435&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pupovaczlatko","files":-1,"time":1352951691,"description":"\n                     PART  435\n\n\n\n           ROB ZOMBIE  -  Demonoid Phenomenon  (1998)\n\n\n\n     &quot;Demonoid Phenomenon&quot; is a single from Rob Zombie's solo debut &quot;Hellbilly Deluxe&quot;. The song was co-written by Charlie Clouser. &quot;Hellbilly Deluxe&quot; is the debut solo album by Rob  Hellbilly Deluxe was released on August 25, 1998. Album &quot;Hellbilly Deluxe&quot; was a commercial success, debuting at number 5 on the Billboard 200. The album went on to sell over three million copies in the United States alone, earning it a 3x Platinum Certification from the RIAA. Hellbilly Deluxe is Zombie's best selling album to date.  Hellbilly had success in numerous other countries as well. It debuted at number 2 on the Canadian Albums Chart and went on to be certified 2x Platinum in the country. In Australia, the album debuted at number 48 on the Australian Albums Chart. The album spent a total of four weeks on the chart, and rose to a peak of 37. The album debuted and peaked at number 42 in Austria, where it only stayed on the chart for one week. In New Zealand, Hellbilly Deluxe debuted at number 48 on the albums chart. It charted for a total of 14 weeks, rising to a peak of 19. The album charted in Sweden for two weeks, where it debuted and peaked at number 45. The album also charted in the United Kingdom, where it peaked at 37.","torrent":{"xt":"urn:btih:90aeb3c3b68728d46647cb308143ae9ee2c23178","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+435","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"90aeb3c3b68728d46647cb308143ae9ee2c23178","infoHashBuffer":{"type":"Buffer","data":[144,174,179,195,182,135,40,212,102,71,203,48,129,67,174,158,226,194,49,120]},"announce":[],"urlList":[]}}