{"title":"Corel VideoStudio Pro X2 v12.0.98.0-FULL","uid":4745959,"size":179461347,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:90f2da74dd9428b35f691a0a1e55c215bff40edb&amp;dn=Corel+VideoStudio+Pro+X2+v12.0.98.0-FULL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"wennZone","files":1,"time":1235882491,"description":"Corel VideoStudio Pro X2 12.0.98.0\nCorel VideoStudio? Pro X2 Ultimate is a complete digital media solution. Edit standard- or high-definition video with templates or hands-on creative tools. Share your movies on Blu-ray Disc?, DVD or iPhone?, or upload directly to YouTube?. Edit audio professionally, copy and convert video, and watch movies with WinDVD? 9 Plus Blu-ray!\n\nOverview\n\nVideoStudio is easy-to-use video editing and disc authoring software for creating professional-looking videos and slide shows. Produce complete movies with the time-saving Movie Wizard or use easy editing tools. Share your creation in any format from DVD to mobile phones to the latest high-definition home theater systems. Even upload directly to YouTube? to let the whole world in on the fun.\n\n* Grab photos and video from anywhere  camcorders, cameras or TV\n* Edit with the easy Movie Wizard, or with hands-on professional editing tools\n* Make movies pop by adding titles, music and special effects\n* Create movie &amp; slideshow discs to share with family and friends\n\nWhats Included\nVideoStudio Pro X2\n\n* VideoStudio Editor  powerful editing &amp; disc authoring in leading formats, including HDV? and AVCHD?\n* Movie Wizard  create complete movies in a few clicks\n* DV-to-DVD Wizard  the fastest way to record directly from tape to disc  you can even author Blu-ray and AVCHD discs\n* Supplementary content  extensive library of templates, overlay clips, title animations, menus and effects help personalize and enhance projects\n* Bonus NewBlue? Film Effects  5 filters with 81 presets that give videos the magic of an old-film appearance\n* Documentation  Help file and PDF User Guide\n\nKey included with program","torrent":{"xt":"urn:btih:90f2da74dd9428b35f691a0a1e55c215bff40edb","amp;dn":"Corel+VideoStudio+Pro+X2+v12.0.98.0-FULL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"90f2da74dd9428b35f691a0a1e55c215bff40edb","infoHashBuffer":{"type":"Buffer","data":[144,242,218,116,221,148,40,179,95,105,26,10,30,85,194,21,191,244,14,219]},"announce":[],"urlList":[]}}