{"title":"The Last Flight of the Sarah Mae - Science Fiction - scifi - Pay","uid":5550823,"size":421728,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9184d09f73139125e9399d2bbe88748e93ad09b5&amp;dn=The+Last+Flight+of+the+Sarah+Mae+-+Science+Fiction+-+scifi+-+Pay&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":6,"time":1273538782,"description":"Walsh McKeeg had tried before to salvage the wreck of the old bomber from the desolate planet where they'd crashed during the war.  Was the old girl up to one last flight when it really mattered -- and could Walsh overcome his own ghosts?\n\n--\nA &quot;Pay As You Like It&quot; ebook in .PDF, .EPUB, .HTML, .LIT, .MOBI formats.  (No DRM.)  Part of an experiment to see if people will voluntarily pay a reasonable price after reading for non-DRM ebooks as an alternative to being forced to pay high prices up front for DRM-locked ebooks.\n\n--\nDr. Andrew Burt ( www.aburt.com ), professional science fiction writer and former Vice President of Science Fiction and Fantasy Writers of America, Inc., has published dozens of short stories and one novel. You can find more of his fiction at http://aburt.com/fiction . He also herds Critters ( www.critters.org ), the first writers' workshop on the web, specializing in science fiction, fantasy, and horror, and home to other fun tools for writers and readers.  Outside of science fiction, he's been a computer science professor (research in networking, security, privacy, and free-speech/social issues), founder of Nyx.net, the world's first public Internet service provider, purveyor of the NewNewForum.com - The Innovation Forum, the &quot;Wishes for the Future&quot; Forum (&quot;If you could have anything in the future what would it be?&quot; - http://NewNewForum/wishes ), and a technology consultant/author/speaker. He's currently CEO of TechSoft, and President of GreenAroundYou.org. For a hobby, he constructs solutions to all the world's problems. Fortunately -- nobody listens. He lives in the Rockies with his wife and their two parrots.","torrent":{"xt":"urn:btih:9184d09f73139125e9399d2bbe88748e93ad09b5","amp;dn":"The+Last+Flight+of+the+Sarah+Mae+-+Science+Fiction+-+scifi+-+Pay","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9184d09f73139125e9399d2bbe88748e93ad09b5","infoHashBuffer":{"type":"Buffer","data":[145,132,208,159,115,19,145,37,233,57,157,43,190,136,116,142,147,173,9,181]},"announce":[],"urlList":[]}}