{"title":"The Call of Cthulhu: The Celebrated Story by H.P. Lovecraft - 20","uid":4430572,"size":4592418816,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:924f1d2fe75d79482349646f61aed5644dfb575d&amp;dn=The+Call+of+Cthulhu%3A+The+Celebrated+Story+by+H.P.+Lovecraft+-+20&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"SideSkroll","files":1,"time":1223265766,"description":"The Call of Cthulhu: The Celebrated Story by H.P. Lovecraft - 2007 - DVDR\n\n[b]Product Description[/b]\n\nWritten in 1926, just before the advent of &quot;talking&quot; pictures, The Call of Cthulhu is one of the most famous and influential tales of H.P. Lovecraft, the father of gothic horror. Now the story is brought richly to life in the style of a classic 1920s silent movie, with a haunting original symphonic score. Using the &quot;Mythoscope&quot; process \u001a a mix of modern and vintage techniques, the HPLHS has worked to create the most authentic and faithful screen adaptation of a Lovecraft story yet attempted. From the cultists of the Louisana bayous to the man-eating non-euclidean geometry of R'lyeh, the HPLHS brings Cthulhu to the screen as it was meant to be seen. Eighteen months of production and a cast of more than 50 actors went into making this film a period spectacle that must seen to be believed. The DVD includes The Call of Cthulhu (47 minutes, black and white), the high-fidelity and &quot;Mythophonic&quot; soundtracks, a 25 minute &quot;making-of&quot; documentary featurette, two slide shows, deleted footage, a prop PDF of the Sydney Bulletin and more. To appeal to Lovecraft fans throughout across the globe, this DVD provides intertitles in 24 languages including: Catalan, Croatian, Czech, Danish, Dutch, English, Euskera, Finnish, French, Galician, German, Hungarian, Irish, Italian, Lithuanian, Luxmbourgish, Norwegian, Polish, Portuguese, Romanian, Spanish, Swedish, Turkish and Welsh. These aren't just subtitles either \u001a they are the real title cards rendered tastefully in each language. If you thought the story was scary before, wait until you see it in Welsh!","torrent":{"xt":"urn:btih:924f1d2fe75d79482349646f61aed5644dfb575d","amp;dn":"The+Call+of+Cthulhu%3A+The+Celebrated+Story+by+H.P.+Lovecraft+-+20","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"924f1d2fe75d79482349646f61aed5644dfb575d","infoHashBuffer":{"type":"Buffer","data":[146,79,29,47,231,93,121,72,35,73,100,111,97,174,213,100,77,251,87,93]},"announce":[],"urlList":[]}}