{"title":"A Narmada Diary, India, 1995","uid":5565422,"size":2034488760,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:92e0d8cdc359a5c3c1cd0a0c5657685fea4b320a&amp;dn=A+Narmada+Diary%2C+India%2C+1995&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"nunicorn","files":1,"time":1273965475,"description":"A Narmada Diary\n\nAn Anand Patwardhan documentary, co-produced and directed with Simantini Dhuru\n\n(1995/Colour/57 mins/English Subtitles)\n\n\n\nSynopsis:\n\n\nThe Sardar Sarover Dam in western India, lynch-pin of a mammoth development project on the river Narmada's banks, has been criticized as uneconomical and unjust. It will benefit urban India at a cost borne by the rural poor.\n\nWhen completed, the dam will drown 37,000 hectares of fertile land, displace over 200,000 adivasis - the area's indigenous people -, and cost up to 400 billion rupees. Ecological, cultural, and human costs - as often is the case with &quot;mega&quot; projects - have never been estimated.\n\nA NARMADA DIARY introduces the Narmada Bachao Andolan (the Save Narmada Movement) which has spearheaded the agitation against the dam. As government resettlement programs prove inadequate, the Narmada Bachao Andolan has emerged as one of the most dynamic struggles in India today. With non-violent protests and a determination to drown rather than to leave their homes and land, the people of the Narmada valley have become symbols of a global struggle against unjust development.\n\n\nBut the dam building continues. If it's height is not checked, the entire adivasi region of the Narmada will drown. In the name of progress, a relatively self-sufficient, egalitarian and environmentally sound economy and culture will be destroyed and a proud people reduced to the status of refugees and slumdwellers.\n\n\nAwards\n* Filmfare Award, Best Documentary, India, 1996.\n* Grand Prize, Earth-Vision Film Festival, Tokyo, 1996.\n\n--------------------------------------\nPLEASE SEED AFTER YOU HAVE DOWNLOADED.\n--------------------------------------","torrent":{"xt":"urn:btih:92e0d8cdc359a5c3c1cd0a0c5657685fea4b320a","amp;dn":"A+Narmada+Diary%2C+India%2C+1995","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"92e0d8cdc359a5c3c1cd0a0c5657685fea4b320a","infoHashBuffer":{"type":"Buffer","data":[146,224,216,205,195,89,165,195,193,205,10,12,86,87,104,95,234,75,50,10]},"announce":[],"urlList":[]}}