{"title":"Psychiatry, 4E- Oxford Medical Publications [PDF] [StormRG]","uid":11079401,"size":4313801,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:93f08270c30c764b9261acfeb7664b650e08fed3&amp;dn=Psychiatry%2C+4E-+Oxford+Medical+Publications+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"0xmovva","files":2,"time":1411381547,"description":"Author: John Geddes (Author), Jonathan Price (Author), Rebecca McKnight (Author)\nSeries: Oxford Medical Publications\nPaperback: 488 pages\nPublisher: Oxford University Press; 4 edition (February 20, 2012)\nLanguage: English\nISBN-10: 0199233969\nISBN-13: 978-0199233960\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media,website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet. Please allow a couple seconds forthe seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n________________________________________________________________________________\n\n\nPsychiatry introduces medicine students to the subject in a concise, innovative and memorable way. Its patient-centred approach blends a discussion of the theoretical basis of different psychiatric disorders with an explanation of the management of these disorders in everyday clinical practice, using genuine case histories to place the content in a realistic context.\n\nRecognizing that having positive interactions with a patient is central to the provision of successful psychiatric care, the book includes guidance on history-taking and assessment, while also reflecting best practice as set out by current clinical guidelines.\n\nHaving undergone an extensive revision for this fourth edition, and covering all the major psychiatric conditions in a logically-structured way, the book is an invaluable guide to all individuals who are likely to encounter those with psychiatric problems, including students of medicine, healthcare, and social work. ","torrent":{"xt":"urn:btih:93f08270c30c764b9261acfeb7664b650e08fed3","amp;dn":"Psychiatry%2C+4E-+Oxford+Medical+Publications+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"93f08270c30c764b9261acfeb7664b650e08fed3","infoHashBuffer":{"type":"Buffer","data":[147,240,130,112,195,12,118,75,146,97,172,254,183,102,75,101,14,8,254,211]},"announce":[],"urlList":[]}}