{"title":"Most evil men and women in history XVID - SceneTime","uid":8770800,"size":8479564382,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:942a2ad572b2aaa1da9fbe61bffd42482df4ae60&amp;dn=Most+evil+men+and+women+in+history+XVID+-+SceneTime&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"scenetime55","files":23,"time":1375450307,"description":"\nGrigori Efimovich Rasputin\n\nGrigory Rasputin is without question one of the most scandalous figures in Russian history. This randy mystic from Siberia arrived in St. Petersburg in 1911 and within a few years had become one of the most influential men in government circles. His ability to remain in such a high position despite widely publicized bouts of drinking and womanizing is no doubt the source of tremendous envy among political figures around the world today\n\nTomas de Torquemada\n\nHe was an excellent precursor to Adolf Hitler. The Pope agreed to allow the Inquisition in 1481, and those arrested and given four choices. They could confess, pay a penalty, endure public torture, or be burned at the stake. Quite often, those arrested were subjected to all of the above. Torquemada's own grandmother was a converso, but he continued to elevate the level of his Inquisition to that of an ethnic cleansing or a full-blown massacre\n\nElisabeth Countess Bathory\n\nElisabeth Bathory was born in Hungary in 1560. At the age of 15 she married to Count Ferencz Nadasdy and took residence in castle Csejthe. The Countess Bathory and her husband took part in black magic and demonic rituals\n\nInside the Mind of Adolf Hitler (2005)\n\nA Documentary, with dramatised elements, looking at the psychological profile of Adolf Hitler compiled by a team of Harvard psychologists in 1943. Interviewing former colleagues and the former family doctor who had fled to the USA and using Freudian techniques and theories of the day they came up with a profile and predicted how he would react to certain situations, concluding that he would not surrender and would be most likely to commit suicide when faced with defeat. This led to future profiling of many world leaders and dictators\n\nIlse Koch\n\nDuring World War 2 the infamous Ilse Koch was known as the B*tch of Buchenwald for her bestial cruelty and sadistic behavior. She was the wife of Karl Koch, the Kommandant of Buchenwald, and struck fear into the inmates daily. She was especially fond of riding her horse through the camp, whipping any prisoner who attracted her attention\n\nVlad The Impaler\n\nVlad Dracolya, the fifteenth century voevod prince, also known as Vlad the Impaler, is best remembered as the inspiration for Bram Stoker's famous novel, Dracula. His true history, in fact, is far more facinating than any vampire story\n\nSee No Evil: The Moors Murders (2006)\n\nA powerful and thought provoking drama based on one of the most shocking crimes of the 20th century, the chilling story of child killers Ian Brady and Myra Hindley\n\nPol Pot\n\npol pot aka solath sar was a little man and a big monster killed 1/2 million people in cambodia or kampuchia as pol pot renamed it watch the movie killing fields pol pot was the man who caused it all\n\nRise and Fall of Idi Amin (1981)\n\nThis biographical movie begins with a short blurb about Uganda, followed by the joyous scenes surrounding Amin's military takeover from Milton Obote. He goes about arresting and torturing the rebels. In his freezer he keeps the heads of his rivals and says: &quot;It is a Kaqwa way. I talk to them&quot;. Amin then goes about having Asians expelled from Uganda saying: &quot;Uganda is for Ugandas. There will be no more Shahs and Patels\nDeclassified: Joseph Stalin\n\nJoseph Stalin remains a powerful and dark figure even 50 years after his death. His legacy as a personification of evil in the 20th century rivals Adolf Hitler s. Using newly unearthed materials and testimony, the episode reveals a never-before-seen Stalin\n\nKarl Rove: Evil Genius\n\nGeorge W. Bush couldn t have become President without the genius of Karl Rove, the Wizard of Oz behind the curtain and the man who has become known as Bush s Brain\n\nDeath of a President (2006)\n\nYears after the assassination of President George W. Bush in Chicago, an investigative documentary examines that as-yet-unsolved crime. mockumentary about the assassination of George W. Bush, the 43rd U.S. President, on 19 October 2007 in Chicago, Illinois\n\nCaligula\n\nDetails the graphic and shocking, yet undeniably tragic story of Rome's most infamous Caesar, Gaius Germanicus Caligula\n\nAdolf Eichmann\n\nBased upon the final confession of Adolf Eichmann, made before his execution in Israel as he accounts to Captain Avner Less, a young Israeli Police Officer, of his past as the architect of Hitler's plan for the final solution. Captured by intelligence operatives in Argentina, 15 years after World War II, Eichmann (Kretschmann), the World's most wanted man, must be broken down and the truth unveiled. As the world waits, two men must confront each other in a battle of wills- the result of which will change a nation forever\n\nBad King John\n\nHe murdered his nephew, inspired the legend of Robin Hood &amp; caused the creation of Magna Carta\n\nNero\n\nHis cruelty, violence and grotesque appetite for self-indulgence brought the Roman empire to the brink of financial and political ruin and he viciously persecuted the Christians. He may not have fiddled while Rome burned but actually set it aflame himself out of greed for land\n\nFrancisco Pizarro\n\nThe series that profiles history's most notorious figures profiles Francisco Pizzaro and his army of trained killers who conquered Peru and who were responsible for murderous acts of butchery\n\nBloody Mary Tudor\n\nShe was called Bloody Mary because in her attempt to return England Roman Catholicism, she had over three hundred Protestants burned at the stake \n","torrent":{"xt":"urn:btih:942a2ad572b2aaa1da9fbe61bffd42482df4ae60","amp;dn":"Most+evil+men+and+women+in+history+XVID+-+SceneTime","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"942a2ad572b2aaa1da9fbe61bffd42482df4ae60","infoHashBuffer":{"type":"Buffer","data":[148,42,42,213,114,178,170,161,218,159,190,97,191,253,66,72,45,244,174,96]},"announce":[],"urlList":[]}}