{"title":"Broforce Brodator Unleashed - Update 8 May 2015","uid":11988970,"size":152515143,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:945d1154c59e831a9c980365b2e3160c025f5d4a&amp;dn=Broforce+Brodator+Unleashed+-+Update+8+May+2015&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Docas14","files":1,"time":1433447824,"description":"Gif creation - You can now create GIFS easily in game by pressing &quot;Ctrl-Shift-G&quot;. Move the box over what you want to record, press &quot;G&quot; to begin recording and &quot;G&quot; to stop recording.\n BUG FIXES: Enemies\n\nFixed Xenomorph death frame that was too large &amp; obscured Xenos in front and behind. \nStunned facehuggers from eggs that get destroyed are less weird. \nFixed Xenomorph kill zone being too large when attacking. \nFixed Melters in level complete death tally, just explode, leaving no green blood. \nFixed the delay between hearing a sound and aliens investigating being slightly too long. \nFixed 2 tiles xenomorphs standing on a vertical 1 tile block \nStunned Facehuggers didn't affect other enemies (making the stunning less fun/less effective). \nMade thrown mooks temporarily catch mook bullets...\n Environment\n\nFixed squishy alien bouncing terrain: when shot, it didn't have the rounded edges, showed as basic squares.\nMade a version of alien doors that spawns melters.\nFixed alien doors. \nFixed small falling boulder floating after landing on diagonal descending elevator. \nMade running while in acid break cages. \nFixed delay before respawning and swinging camera away to come back. (The camera instantly moved to newly spawned bro now, you couldn't tell how you died sometimes).\nAlien music slightly louder. \nMade blood a bit more wet looking.\n Bosses\n\nFixed Mammoth tank boss showing health incorrectly. \nFixed death screen for original giant sandworm when killed with bullets.\n Bros\n\nBronan's special now drops through zip lines. \nGave Mr Anderbro a melting animation. \nFixed Double Bro 7's facehugger death. \nFixed Boondock Bros issue on Mech. \nFixed Double Bro 7 bug when he dies while using the watch and the buzzing noise goes on until you reach the next level. \nBros can no longer use their specials while being melted by acid. \nFixed Bronan's bug when using special and landing on a bed of spikes.\nIndi's whip sped up. \nFixed Ash Brolliam's bug when using his special on the tank. \nIndiana Brones' gun art changed! \nMade Broniversal Soldier's special cure acid. \nMade bro re-spawn delay longer (it was being decreased once for every player playing... so with 2 players the time was halved... with 4 players it was a quarter). \nBrobocop now shoots more responsibly. He can also target sandworms and bosses.\n Level Editor\n\nFixed bug where trigger move commands could lock bros in place.\n Online\n\nFixed game not starting when not logged into Steam.\nRefactored spawn code to fix some online issues","torrent":{"xt":"urn:btih:945d1154c59e831a9c980365b2e3160c025f5d4a","amp;dn":"Broforce+Brodator+Unleashed+-+Update+8+May+2015","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"945d1154c59e831a9c980365b2e3160c025f5d4a","infoHashBuffer":{"type":"Buffer","data":[148,93,17,84,197,158,131,26,156,152,3,101,178,227,22,12,2,95,93,74]},"announce":[],"urlList":[]}}