{"title":"Handbook of Office-based Buprenorphine Treatment of Opioid Depen","uid":6513383,"size":1850085,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:96f7fe7c3b031467d2adb9741c043149bc1287ac&amp;dn=Handbook+of+Office-based+Buprenorphine+Treatment+of+Opioid+Depen&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"_F1_","files":-1,"time":1309723488,"description":"John A. Renner, &quot;Handbook of Office-based Buprenorphine Treatment of Opioid Dependence&quot;\n Publisher: American Psychiatric Publishing | 2010 | ISBN: 1585623695 | PDF | 357 pages | 2.2 MB\n\n The Handbook of Office-Based Buprenorphine Treatment of Opioid Dependence will serve as a reliable guide for the addition of buprenorphine treatment into existing psychiatric practices and other primary care settings. The potential to improve the lives of patients with the disease of opioid addiction is great, and this book offers concrete and practical advice for managing patients in an office-based setting. Distinguished practicing psychiatrists, internists, and other clinical experts and researchers contribute their expertise with buprenorphine to this volume. It covers the subject matter thoroughly from the history of opioid abuse and assessment criteria for potential patients to clinical management and psychiatric comorbidity. This handbook provides the tools and guidelines necessary to help providers cultivate a therapeutic environment for treating opioid addiction that minimizes problem behaviors and optimizes treatment outcomes. The logistical requirements for setting up a successful office-based treatment program are provided in detail. Case vignettes, charts, and tables make the subject matter easily accessible for readers ranging from students to well-established practitioners.","torrent":{"xt":"urn:btih:96f7fe7c3b031467d2adb9741c043149bc1287ac","amp;dn":"Handbook+of+Office-based+Buprenorphine+Treatment+of+Opioid+Depen","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"96f7fe7c3b031467d2adb9741c043149bc1287ac","infoHashBuffer":{"type":"Buffer","data":[150,247,254,124,59,3,20,103,210,173,185,116,28,4,49,73,188,18,135,172]},"announce":[],"urlList":[]}}