{"title":"La gran final[DVDrip][Spanish]","uid":5164263,"size":733984768,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:98a0c7e5e6190bcb39ac01b10be2cb4e6574bca2&amp;dn=La+gran+final%5BDVDrip%5D%5BSpanish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sahae","files":1,"time":1258319158,"description":"DirecciÃƒÂ³n: Gerardo Olivares.\nPaÃƒÂ­ses: EspaÃƒÂ±a y Alemania.\nAÃƒÂ±o: 2006.\nDuraciÃƒÂ³n: 85 min.\nGÃƒÂ©nero: Comedia.\nInterpretaciÃƒÂ³n: Mahamadou Alzouma (AndrÃƒÂ©), Esentai Samer Khan (Kosan), Khoshibai Edil Khan (General), Kenshleg Alen Khan (Kumar Khan), Boshai Dalai Khan (Turkan), Ahmed Alansar (Aboubacar), Attibou Aboubacar (Hassan), Tano Alansar (Hamidou), Wirapitang Kaapor, Kinchiran Kaapor.\nGuiÃƒÂ³n: Chema RodrÃƒÂ­guez; basado en un argumento de Gerardo Olivares.\nProducciÃƒÂ³n: JosÃƒÂ© MarÃƒÂ­a Morales.\nMÃƒÂºsica: MartÃƒÂ­n Meissonnier.\nFotografÃƒÂ­a: Gerardo Olivares y Guy GonÃƒÂ§alves.\nMontaje: Rori Sainz de Rozas y Raquel Torres.\nEstreno en EspaÃƒÂ±a: 21 Abril 2006.\n\n\nSINOPSIS\nÃ‚Â¿CÃƒÂ³mo es posible que en lo mÃƒÂ¡s recÃƒÂ³ndito de las estepas mongolas los niÃƒÂ±os sepan quiÃƒÂ©n es Ronaldo? &quot;La gran final&quot; es una comedia que cuenta, a travÃƒÂ©s de tres historias paralelas, las peripecias de unos hombres que tienen dos cosas en comÃƒÂºn: vivir en regiones remotas del planeta y estar empeÃƒÂ±ados en ver la final de la copa del mundo de fÃƒÂºtbol JapÃƒÂ³n-Corea 2002 entre Alemania y Brasil. Una familia de nÃƒÂ³madas mongoles, una caravana de camelleros tuareg en el desierto del Sahara y un grupo de indios amazÃƒÂ³nicos serÃƒÂ¡n nuestros protagonistas. Todos viven a muchos kilÃƒÂ³metros de distancia del punto mÃƒÂ¡s cercano en el que es posible ver la televisiÃƒÂ³n o son mÃƒÂºltiples las dificultades que tienen para hacerlo. Sin embargo, estos hombres disponen del ingenio y la voluntad suficiente como para lograr su objetivo. En un mundo en el que el acceso a la informaciÃƒÂ³n pare-ce sencillo e inmediato, es posible vivir en tiempo real cualquier acontecimiento mundial desde el cÃƒÂ³modo sillÃƒÂ³n de nuestras casas. Pero... Ã‚Â¿quÃƒÂ© ocurre en los lugares mÃƒÂ¡s aislados de la tierra? Ã‚Â¿Vi-ven al margen de esta informaciÃƒÂ³n? Ã‚Â¿Tienen acceso a ella? En estos lugares no es fÃƒÂ¡cil disponer de una televisiÃƒÂ³n, un generador elÃƒÂ©ctrico y una antena parabÃƒÂ³lica. A pesar de ello, estÃƒÂ¡n al tanto de cuanto ocurre en el mundo, sobre todo, de las hazaÃƒÂ±as deportivas de sus ÃƒÂ­dolos. Ã‚Â¿CÃƒÂ³mo lo logran? De las formas mÃƒÂ¡s inverosÃƒÂ­miles. Esto es lo que pretende descubrir &quot;La gran final&quot;, las peripecias de unos hombres aislados en los confines del planeta, pero dispues-tos a todo por ver un partido de fÃƒÂºtbol.\n\n","torrent":{"xt":"urn:btih:98a0c7e5e6190bcb39ac01b10be2cb4e6574bca2","amp;dn":"La+gran+final%5BDVDrip%5D%5BSpanish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"98a0c7e5e6190bcb39ac01b10be2cb4e6574bca2","infoHashBuffer":{"type":"Buffer","data":[152,160,199,229,230,25,11,203,57,172,1,177,11,226,203,78,101,116,188,162]},"announce":[],"urlList":[]}}