{"title":"The General's Son, Peled - No.1 threat to Zionism","uid":10662638,"size":5916073,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:98bb2e944fa38fe73963a3f3d44c208f6deb646b&amp;dn=The+General%27s+Son%2C+Peled+-+No.1+threat+to+Zionism&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"UnviolentPeacemaker","files":2,"time":1406747434,"description":"The most dangerous book to the Zionist lunatics.\n\nIf you study at the world's leading universities Israel Palestine, for 30 months, you will see that this book is the single most important, relevant, summary of what you would have learned in those 30 months.  We, you, Palestine... don't have 30 months.  We have now.  Today.\n\n------------\n\nSUPPORT THIS GREAT MAN, MIKO PELED.  BUY THE BOOK. DONATE TO HIS WORK.\n\n------------\n\nIn 1997, a tragedy struck the family of Israeli-American Miko Peled: His beloved niece Smadar was killed by a suicide bomber in Jerusalem. That tragedy propelled Peled onto a journey of discovery. It pushed him to re-examine many of the beliefs he had grown up with, as the son and grandson of leading figures in Israel's political-military elite, and transformed him into a courageous and visionary activist in the struggle for human rights and a hopeful, lasting peace between Israelis and Palestinians.\n\nEsteemed African-American author Alice Walker has contributed a very moving and thoughtful Foreword to The General's Son.\n\nThe journey that Peled traces in this groundbreaking memoir echoed the trajectory taken 40 years earlier by his father, renowned Israeli general Matti Peled. In The General's Son, Miko Peled tells us about growing up in Jerusalem in the heart of the group that ruled the then-young country, Israel. He takes us with him through his service in the country's military and his subsequent global travels... and then, after his niece's killing, back into the heart of Israel's conflict with the Palestinians. The book provides a compelling and intimate window into the fears that haunt both peoples-- but also into the real courage of all those who, like Miko Peled, have been pursuing a steadfast grassroots struggle for equality for all the residents of the Holy Land.","torrent":{"xt":"urn:btih:98bb2e944fa38fe73963a3f3d44c208f6deb646b","amp;dn":"The+General%27s+Son%2C+Peled+-+No.1+threat+to+Zionism","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"98bb2e944fa38fe73963a3f3d44c208f6deb646b","infoHashBuffer":{"type":"Buffer","data":[152,187,46,148,79,163,143,231,57,99,163,243,212,76,32,143,109,235,100,107]},"announce":[],"urlList":[]}}