{"title":"Waiting to be Heard Amanda Knox Audiobook","uid":8592104,"size":631712693,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:98cd460b985cc7e40270ff796271b077fc023912&amp;dn=Waiting+to+be+Heard+Amanda+Knox+Audiobook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":41,"time":1371665997,"description":"Waiting to be Heard (Audiobook) by Amanda Knox\nEnglish | 2013 | 12 hours and 31 minutes | ISBN: 0062237616 | MP3 112 kbps | 602MB\n\nIn November 2007, Amanda Knox was twenty years old and had been studying abroad in Perugia, Italy, for only a few weeks when her friend and roommate Meredith Kercher was brutally murdered.\n\nYoung, naive, and grieving, and with only basic knowledge of the Italian language, she was arrested and subjected to harsh interrogations during which she struggled to communicate with the police. In 2009, after a trial that made headlines around the world, she was wrongly convicted of murder. But in October 2011, after Amanda spent four years in an Italian prison, the conviction was overturned.\n\nNow, in Waiting to Be Heard, Amanda Knox shares for the very first time the truth about her terrifying ordeal. Drawing from her journals and letters, she gives an unflinching account of what it was like to be imprisoned in a foreign country for a crime she did not commit, and about the impact it had on her family and loved ones as they traveled back and forth to be at her side. With grace and gratitude, Amanda describes the aftermath of the trial and her return home to the States, where she is able once again to look forward to the future.","torrent":{"xt":"urn:btih:98cd460b985cc7e40270ff796271b077fc023912","amp;dn":"Waiting+to+be+Heard+Amanda+Knox+Audiobook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"98cd460b985cc7e40270ff796271b077fc023912","infoHashBuffer":{"type":"Buffer","data":[152,205,70,11,152,92,199,228,2,112,255,121,98,113,176,119,252,2,57,18]},"announce":[],"urlList":[]}}