{"title":"Jennifer Lopez - Que Hiciste","uid":4603369,"size":150616068,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:9943b664dd7d0b6f7b96ecc05d6ca5460e0b4fff&amp;dn=Jennifer+Lopez+-+Que+Hiciste&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1230356757,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;QuÃƒÂ© Hiciste&quot; (English: &quot;What Have You Done?&quot;) is the first single released from Jennifer Lopez' first full-length Spanish-language album Como Ama una Mujer (2007). The song has become a major hit in Italy, Switzerland, Greece, Romania, Turkey, the U.S. Latin Chart, where it peaked at #1, and in Spain, where it has sold more than 260,000 ringtones and more than 120,000 digital downloads and this song has become one of the most notable hits in the last few years. Lopez performed the song on American Idol on April 11, 2007. She is the first artist ever to perform a Spanish song on the hit competition. Two days after the performance, the track debuted on the iTunes Top 100 at #100, and has since peaked at #91. It debuted on the Billboard Hot 100 at #86.\n\nThe music video for the song was filmed at Dumont Dunes, California and directed by Michael Haussman. The video starts with Lopez driving an old car down a dusty highway in the middle of the desert, leaning out of the window singing. She pulls over at what looks like a gas station and enters the bathroom to change clothes. As the chorus kicks in, she is seen dancing in the desert with flames in front and behind her. The view cuts between this and Lopez changing into new clothes and dying her hair at the washbasin. She then continues driving, but this time across the desert sand, away from the highway. She stops and gets a can of gasoline out the trunk, then pours it over the car. When the chorus kicks in for a second time, the car explodes behind Jennifer as she walks away. In the following scenes, she is dancing in a change of clothes in the sand, cutting between her back in the car and in the desert with the flames. This theme of a woman escaping from a man in an old car and firing it after was also the theme of the music video of Rester femme, a song in French by Belgian singer Axelle Red released in 1997.\n\nThis music video was the first ever in a language other than English to reach the top-spot of MTV's Total Request Live countdown. It was also the first ever by a female artist to reach the top-spot of MTV Tres' Mi TRL.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:9943b664dd7d0b6f7b96ecc05d6ca5460e0b4fff","amp;dn":"Jennifer+Lopez+-+Que+Hiciste","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9943b664dd7d0b6f7b96ecc05d6ca5460e0b4fff","infoHashBuffer":{"type":"Buffer","data":[153,67,182,100,221,125,11,111,123,150,236,192,93,108,165,70,14,11,79,255]},"announce":[],"urlList":[]}}