{"title":"A Vampyre Story [DotEmu]","uid":7508970,"size":5699164895,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:9a161272f367ee9c102cb338ffe07a72a51d86de&amp;dn=A+Vampyre+Story+%5BDotEmu%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"esharoth","files":-1,"time":1344260666,"description":"Title: A Vampyre Story\nGenre: adventure / puzzle-solving / 3rd-person\nReleased: 14th November 2008\nDeveloper: Autumn Moon Entertainment\nPublisher: Strategy First\nDescription:\nThe point-and-click adventure game A Vampyre Story tells the tale of the beautiful, gifted opera singer Mona De Lafitte, whose life is brought to an abrupt end by a vampire baron named Shrowdy Von Kiefer. Henceforth, she is doomed to a miserable existence as a creature of the night in Von Kiefer's gloomy castle in Draxsylvania. Confronted with her seemingly hopeless fate, she decides to run away and try to fulfill her dream of singing at the Paris Opera. Accompanied by her mischievous bat Froderick, Mona must face a number of challenges in her odyssey and learn not only to accept her vampire nature, but also to use the abilities she has acquired to her advantage. In more than 50 hand-drawn locations, the player's task is to guide Mona through Draxsylvania and to Paris by using his powers of deduction. Having a bent for extremely dark humor also helps... Along the way, Mona meets a wealth of partly endearing, partly frightening, but often just plain weird characters, including the inventor Dr. Riga Mortus, the gypsy Madame Strigoi, and Carpathia the wolfwoman.\n\nBonus content: concept art, soundtrack, storyboards, Von Kiefer journal, wallpaper.\n\nHow to play:\n1) Run Setup.exe and install the game;\n2) Start the game using its main executable or shortcuts (DRM free).\n\n! Notice\nThe game is already patched to version 1.1.\n\nIf you like the game, BUY it!","torrent":{"xt":"urn:btih:9a161272f367ee9c102cb338ffe07a72a51d86de","amp;dn":"A+Vampyre+Story+%5BDotEmu%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9a161272f367ee9c102cb338ffe07a72a51d86de","infoHashBuffer":{"type":"Buffer","data":[154,22,18,114,243,103,238,156,16,44,179,56,255,224,122,114,165,29,134,222]},"announce":[],"urlList":[]}}