{"title":"David Papineau - Philosophical Naturalism","uid":10843371,"size":13723562,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9a1dbbd071e7c8bf728515dbdea0dc3c2827e061&amp;dn=David+Papineau+-+Philosophical+Naturalism&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"philosophi","files":-1,"time":1408752268,"description":"David Papineau - Philosophical Naturalism\n\nDavid Papineau defends the naturalist view that human beings and their mental powers are normal parts of the natural world described by science. The first part of the book shows why this naturalist perspective is an inescapable consequence of certain physical truisms. However, far from this diminishing human beings, Papineau then shows how the central features of mind - consciousness, meaning and knowledge - can still be accommodated within the naturalist perspective. He exposes the widespread intuition that consciousness is non-physical as a confusion occasioned by the special structure of human imagination. Meaning is explained as a biological phenomenon, arising from the need for our actions to be directed towards and guided by features of the external world. And knowledge is understood in terms of the active pursuit of truth, a perspective which yields a realist solution to traditional sceptical problems, and carries important implications for the interpretation of mathematics, modality and morality. This book aims to offer original solutions to the central philosophical problems of mind and knowledge.","torrent":{"xt":"urn:btih:9a1dbbd071e7c8bf728515dbdea0dc3c2827e061","amp;dn":"David+Papineau+-+Philosophical+Naturalism","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9a1dbbd071e7c8bf728515dbdea0dc3c2827e061","infoHashBuffer":{"type":"Buffer","data":[154,29,187,208,113,231,200,191,114,133,21,219,222,160,220,60,40,39,224,97]},"announce":[],"urlList":[]}}