{"title":"Make.Me.a.Supermodel.Au.S1E01.HDTV.XviD-MrHaapy","uid":4331248,"size":367757312,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:9a7abc8437556bfbbcd3635e41794302201a3ee2&amp;dn=Make.Me.a.Supermodel.Au.S1E01.HDTV.XviD-MrHaapy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"circlensess","files":1,"time":1218050275,"description":"\n--- Video Information ---\nVideo Codec Name: XviD 1.1.2 Final\nDuration: 47:49.440\nVideo Bitrate: 887kb/s\nBits / Pixel: 0.115\nResolution: 640x480\nFrames Per Second: 25.000\n\n--- Audio Information ---\nNo of Audio Streams: 1\nAudio Codec: 0x0055 MPEG-1 Layer 3\nAudio Bitrate: 128kb/s CBR 48000 Hz\nAudio Channel Count: 2\nInterleave: 40ms\nPreload: 504ms\nAudio alignment: Aligned\n\nAired: 06/08/2008, 7:30pm\nGenre: Reality TV\nCountry: Australia &lt;a href=&quot;\nhttp://au.tv.yahoo.com/b/make-me-a-supermodel/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://au.tv.yahoo.com/b/make-me-a-supermodel/&lt;/a&gt;\n\nSeason 1, Episode 01\n\nMake Me A Supermodel\n\nYou know the old joke; if I bring you the parts will you make me a man? Doesn't quite work like that. 24 gorgeous young men and women vie for the 100,000 bucks and the chance to be represented by the same modeling agency that has Elle McPherson on its books. Niki Taylor and Tyson Beckford host. And oh yeah, it's 'reality' TV\n\nThe show info\n\nThe call time has come for the most glamorous reality show ever to hit Australian TV screens, Channel Seven's Make Me A Supermodel\n\nIn an Australian first, male and female models will go head-to-head in a bid to win the ultimate audition, the Make Me A Supermodel challenge\n\nAfter an exhaustive nationwide search, in which thousands of hopeful supermodels strutted their stuff, 14 of the hottest undiscovered talents in Australia were told they may just have the raw materials to be a supermodel\n\nNow it's time to find out. The top 14 will be housed in a luxury compound and subjected to the rigorous regime of a real-life top-flight model - early mornings, long days and constant appraisal from those who know best\n\nThey will be guided and supported by Make Me A Supermodel's super host, former Miss Universe Jennifer Hawkins, a prime example of what can happen when a laid-back surfie chick gets a break\n\nJennifer will also serve as a judge with the Queen of Australian fashion media, marie claire editor and publisher Jackie Frank, and Martin Walsh, a former international model who returned to Australia to take over the agency that first signed him, Chadwick Models and Management. Guest judges will also be mentors to the fledgling models, starting with American male supermodel Tyson Beckford\n\nIt will be Martin and his agency who will guide the career of Make Me A Supermodel's eventual winner, the model deemed to possess the characteristics that will make them the next Australian to turn the head of the international fashion fraternity\n\nContestants have been plucked from all walks of life and while some have limited experience on a catwalk or in front of a photographer's lens, they are all rough diamonds waiting to be shined\n\nMake Me A Supermodel has enlisted the best designers, stylists, photographers and other experts to shape the finalists into people even they never thought they could become\n\nEach week, a series of assignments and challenges will test the models looks, versatility and mental steel before one of their hearts is broken when they are told Australia can not make them a supermodel\n\nThe result will be Make Me A Supermodel's champion, the next Travis Fimmel or Elle Macpherson, a new Australian face to light up around the world and make this beautiful country full of beautiful people proud","torrent":{"xt":"urn:btih:9a7abc8437556bfbbcd3635e41794302201a3ee2","amp;dn":"Make.Me.a.Supermodel.Au.S1E01.HDTV.XviD-MrHaapy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9a7abc8437556bfbbcd3635e41794302201a3ee2","infoHashBuffer":{"type":"Buffer","data":[154,122,188,132,55,85,107,251,188,211,99,94,65,121,67,2,32,26,62,226]},"announce":[],"urlList":[]}}