{"title":"Fastball - The Harsh Light of Day [2000]","uid":9690859,"size":402543155,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:9ae66c9032e6481625b418f556dbc698d4f05c09&amp;dn=Fastball+-+The+Harsh+Light+of+Day+%5B2000%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GenXRock","files":-1,"time":1393860830,"description":"Review by Bryan Buss  [-]\nWhen a band breaks through the way Grammy-nominated Fastball did with 1998's platinum All the Pain Money Can Buy and its two hit singles &quot;The Way&quot; and &quot;Out of My Head,&quot; it's easy for music critics and cynics to write the group off as a one-album wonder. However, with the expansive The Harsh Light of Day, Miles Zuniga (on guitar and vocals), Tony Scalzo (on bass and vocals), and Joey Shuffield (on drums) show enormous growth as musicians and songwriters. To release an album with rock songs this tight in a year of boy bands, pop rap, and teen nymphs is brave, but when you need to live up to the album's predecessor as well, the move might even be considered foolish, but Fastball pulls the trick off with vastly different songs that are able to stand on their own but also form a cohesive unit. With each multi-layered cut, the trio shows pop songwriting skills not often seen in such cookie-cutter times -- especially in the particularly staid field of alt-rock. Employing piano courtesy of Billy Preston (on You're an Ocean) and a mariachi orchestra courtesy of Jose Hernandez and guitar courtesy of Brian Setzer (on &quot;Love Is Expensive and Free&quot;), this bold album takes you on an aural adventure of strings, guitars, and hooks paired with intelligent lyrics and taut instrumentation. It's nice to see a band that is more than a one-trick pony. Fastball may just be the harsh light of day the alternative market needs. (3/5)","torrent":{"xt":"urn:btih:9ae66c9032e6481625b418f556dbc698d4f05c09","amp;dn":"Fastball+-+The+Harsh+Light+of+Day+%5B2000%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9ae66c9032e6481625b418f556dbc698d4f05c09","infoHashBuffer":{"type":"Buffer","data":[154,230,108,144,50,230,72,22,37,180,24,245,86,219,198,152,212,240,92,9]},"announce":[],"urlList":[]}}