{"title":"Pam Ryan Munoz (4) ebooks epub mobi fiction children&amp;rsquo;s","uid":11219948,"size":9681507,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9b356b6c879fa3fa03ee713bae0abf00f13fab33&amp;dn=Pam+Ryan+Munoz+%284%29+ebooks+epub+mobi+fiction+children%26rsquo%3Bs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"KiwiSue49","files":-1,"time":1413369169,"description":"\nTHANK YOU FOR DOWNLOADING AND SEEDING THIS TORRENT.\n\n\nTitle 1: ESPERANZA RISING\n\nEsperanza thought she'd always live with her family on their ranch in Mexico--she'd always have fancy dresses, a beautiful home, and servants. But a sudden tragedy forces Esperanza and Mama to flee to California during the Great Depression, and to settle in a camp for Mexican farm workers. Esperanza isn't ready for the hard labor, financial struggles, or lack of acceptance she now faces. When their new life is threatened, Esperanza must find a way to rise above her difficult circumstances--Mama's life, and her own, depend on it.\n\n\nTitle 2: PAINT THE WIND\n\nA sheltered girl. A wild horse. An unforgettable journey. Maya lives like a captive. At Grandmother's house in California, everything is forbidden: friends, fun, even memories. And her life is built on lies: lies Grandmother tells her about her dead mother, lies Maya tells to impress or manipulate. But then she moves to the vast Wyoming wilderness where her mother's family awaits - kind, rugged people who have no tolerance for lies. They challenge Maya to confront the truth about who she is. And a mysterious mustang called Artemisia waits, too. She holds the key to Maya's freedom. But to find it, Maya will have to risk everything, including her life.\n\n\nTitle 3: RIDING FREEDOM\n\nIn this fast-paced, courageous, and inspiring story, readers adventure with Charlotte Parkhurst as she first finds work as a stable hand, becomes a famous stage-coach driver (performing brave feats and outwitting bandits), finds love as a woman but later resumes her identity as a man after the loss of a baby and the tragic death of her husband, and ultimately settles out west on the farm she'd dreamed of having since childhood. It wasn't until after her death that anyone discovered she was a woman.\n\n\nTitle 4: BECOMING NAOMI LEON\n\nNaomi Soledad Leon Outlaw has had a lot to contend with in her young life, her name for one. Then there are her clothes (sewn in polyester by Gram), her difficulty speaking up, and her status at school as &quot;nobody special.&quot; But according to Gram, most problems can be overcome with positive thinking. And with Gram and her little brother, Owen, Naomi's life at Avocado Acres Trailer Rancho in California is happy and peaceful...until their mother reappears after seven years of being gone, stirring up all sorts of questions and challenging Naomi to discover and proclaim who she really is.\n\n\nNote: Have checked chapter links with the epub file in Calibre for PC","torrent":{"xt":"urn:btih:9b356b6c879fa3fa03ee713bae0abf00f13fab33","amp;dn":"Pam+Ryan+Munoz+%284%29+ebooks+epub+mobi+fiction+children%26rsquo%3Bs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9b356b6c879fa3fa03ee713bae0abf00f13fab33","infoHashBuffer":{"type":"Buffer","data":[155,53,107,108,135,159,163,250,3,238,113,59,174,10,191,0,241,63,171,51]},"announce":[],"urlList":[]}}