{"title":"Battle Chasers","uid":4965866,"size":226198374,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:9b7586f177e20960c09ddec0bceee17c4283ff1c&amp;dn=Battle+Chasers&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"brodahisou","files":-1,"time":1245527769,"description":"The series stars a quintet of main characters, including a nine-year-old girl named Gully, whose father mysteriously vanishes, leaving behind a pair of magical gloves. A pulchritudinous warrior named Red Monika tries to enlist a swordsman haunted by the death of his wife, Garrison, to assist in freeing a prisoner, which Garrison turns down. Red Monika accidentally releases four extremely powerful villains during the breakout. Garrison overcomes his grief and joins Gully, the wizard Gnolan, and the towering war golem Calibretto to stop the villains' rampage.\n\nBattle Chasers from Cliffhanger as created, co-written and illustrated by Joe Madureira. Battle Chasers was one of the most popular comics in the late 1990s, but suffered from extreme lateness, with an average of about half a year between issues. The last issue, #9, was published in September 2001 and had a cliffhanger-ending that never was concluded, as #10 (scheduled for November 2001) was never released and Joe Madureira left the comic industry to pursue a career as a video game designer.\n\nMadureira has stated that Battle Chasers is &quot;one of those things that I think about every once in a while, and not having finished it bums me out... I would love to do it at some point, but it would be very far out.&quot;\n\n\nReleased on http://ComicPirates.info","torrent":{"xt":"urn:btih:9b7586f177e20960c09ddec0bceee17c4283ff1c","amp;dn":"Battle+Chasers","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9b7586f177e20960c09ddec0bceee17c4283ff1c","infoHashBuffer":{"type":"Buffer","data":[155,117,134,241,119,226,9,96,192,157,222,192,188,238,225,124,66,131,255,28]},"announce":[],"urlList":[]}}