{"title":"ray davies - other people's lives","uid":4329967,"size":88641024,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:9c2c531894efa548f8572728f2603a1f4d70a35f&amp;dn=ray+davies+-+other+people%5C%27s+lives&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"kras77","files":13,"time":1217984598,"description":"Produced by: Ray Davies\nRelease date: 6 Feb, 2006\nRecord label &amp; catalog #: V2 Music VVR1035352\n\nFrom Rolling Stone :\nhttp://www.rollingstone.com/artists/raydavies/albums/album/9284549/review/9316761/other_peoples_lives\n&quot;Things are gonna Change (the Morning After)&quot; -- the opening track on Ray Davies' first album of new original songs since the quiet death of the Kinks in 1996 -- starts with peals of sea-gull-cry feedback and the surprised grunt of a guy who sounds like he's been shaken awake for a new day of hard luck and trouble. &quot;My turn to get punched in the face,&quot; Davies sings, and he's just getting started. &quot;You feel shite/ The air bites/Oh, will I ever learn/Your ear's deaf/Your girl's left/Never to return.&quot; No one should have to face all that before the first cup of coffee.\n\nBut when the rock kicks in, it is with reassuring familiarity: a chunky metallic heft hearkening back to the Kinks' arena-era winners Misfits (1978) and Low Budget (1979). And there is, Davies swears in the song, light at the end of the bruises: &quot;You've paid your debt/Get up, you wreck/And crawl out through the door/Love will return.&quot; It's hardly a warm bedside manner, but nearly everything Davies wrote and recorded in the Kinks' three decades came with a sting in the tale, slugging guitars or both. In that way, Other People's Lives is a typical, welcome Kinks album -- with no other Kinks.\n\nIt is hard not to miss them, especially the slightly loose, animal-instinct crack of drummer Mick Avory and the combative crunch-and-shove guitar of Ray's brother Dave. The straightforward arrangements and well-groomed playing of the studio hands on Other People's Lives(recorded and mixed over four years) all but scream &quot;solo album&quot; compared to the pub-combo charge and fighting tension in even the Kinks' most sophisticated Sixties art pop. But there are jolts of expertly conjured deja vu: the &quot;Waterloo Sunset&quot;-style background ooo's in &quot;After the Fall&quot;; the blowsy Preservation-flavor horns on the recent single and hidden bonus track, &quot;Thanksgiving Day.&quot; And Davies, who turns sixty-two in June, sings with the bright, slightly sour force and thespian's flair of his greatest hits. He doesn't sound a day over &quot;Lola.&quot;\n\nThis is, however, a darker Davies than you remember. &quot;I just had a really bad fall/And this time it was harder to get up than before,&quot; he sings in &quot;After the Fall,&quot; a song actually cut in late 2002 but now impressively prophetic, given Davies' subsequent encounter with a mugger's gun in New Orleans in 2004. In &quot;All She Wrote,&quot; what seems like your basic Dear John letter with punchy guitars -- &quot;So don't pretend to be a new man/Be chauvinistic, that's your way/Now you're free to make your play/For that big Australian barmaid&quot; -- turns out, at the very end, to be a suicide note. And the disgust in &quot;The Tourist&quot; (&quot;Checking out the slums/With my plastic Visa&quot;) runs both ways; the locals, bitter and greedy, are as jive as the day-trippers.\n\nThe pessimism is no surprise. Davies' bluntness is. The most endearing quality of his incisive Sixties studies of Britain's class system and stiff upper lip -- the fallen noble of &quot;Sunny Afternoon&quot;; the prancing fops in &quot;Dandy&quot; and &quot;Dedicated Follower of Fashion&quot;; the prisoners of suburbia in &quot;A Well Respected Man&quot; and &quot;Shangri-La&quot; -- was Davies' ambiguity, his curiosity for foible and sympathy for dreamers. In contrast, the title track here is just cannon fire, a cantina-noir broadside against tabloid journalism: &quot;Can't believe what I just read/Excuse me, I just vomited.&quot; Well, scandal sheets are as old as printing itself, and there is profit in hurtful gossip only when someone buys and believes it.\n\nMore often, Davies is at his best on this album: as a melody man in the bruised romance &quot;Over My Head&quot;; a portrait artist in &quot;Thanksgiving Day,&quot; a sharp, bemused look at American myths of bounty and family; and a power-chord Noel Coward in &quot;Stand Up Comic.&quot; When he played the latter song live in New York last fall, Davies acted the part in full -- a cockney nightclub joker stuck doing low-rent gags for low-brow joes -- the way he used to do the lovable boozer in the Kinks' &quot;Alcohol.&quot; But &quot;Stand Up Comic&quot; is less about cheap laughs than how far we are willing to sink for the sake of sensation. &quot;Style/Never was much/ Never has been/But the little bit that was/Was all that we had,&quot; Davies laments before bidding his audience good riddance. &quot;You've all been watching too much television,&quot; he snipes on his way to a nice stiff drink. &quot;Well, I'll be in the public bar, minding my own business.&quot;\n\nIt is a cocky, winning performance by a singer-songwriter who, on this album, for the first time in his rock &amp; roll life, is truly on his own. But Davies is, as he once wrote and sang, &quot;one of the survivors.&quot; We are lucky to still have him.\n\n\nDAVID FRICKE\n\nMy other torrents: &lt;a href=&quot;\nhttp://thepiratebay.se/user/kras77&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/kras77&lt;/a&gt;","torrent":{"xt":"urn:btih:9c2c531894efa548f8572728f2603a1f4d70a35f","amp;dn":"ray+davies+-+other+people%5C%27s+lives","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9c2c531894efa548f8572728f2603a1f4d70a35f","infoHashBuffer":{"type":"Buffer","data":[156,44,83,24,148,239,165,72,248,87,39,40,242,96,58,31,77,112,163,95]},"announce":[],"urlList":[]}}