{"title":"Presence- (1999) All systems gone","uid":7309801,"size":75619808,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:9c8d2fb51ce253eeeb807aec3a35e3fd0e208610&amp;dn=Presence-+%281999%29+All+systems+gone&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"klinho","files":13,"time":1338311879,"description":"          1. Future Love\t                     6:19\n\t  2. This is you                             5:49\t                                     \t                     \t\t \n\t  3. Been 2 Long\t                     7:58\t\t \n\t  4. Matter Of Fact\t                     5:22\t\t \n\t  5. Your Spirit\t                     4:58\t\t \n\t  6. Keeping Count\t                     6:03\t\t \n\t  7. Sense Of Danger\t                     7:10\t\t \n\t  8. Favour Nothing\t                     4:45\t\t \n\t  9. The Strengh (Within)\t             4:28\t\t \n\t 10. Better Day\t                             5:01\t\t \n\t 11. Far Far Away From My Heart              4:43\n\n\n\n\n\nPresence, much like Massive Attack, functions as a collective of artist - like mind, singular purpose, and banding together as comrades by a thriving underground music scene. Sara Nelson, Sara Jay, Steve Edwards, Fiona, Matthew Herbert, and P K Joyce all gathered and contributed essential parts to an original whole penned and produced by tech - house guru Charles Webster. Based on the &quot;club hit&quot; singles - Sense of Danger and Better Day, the buzz word in early 1999 was All Systems Gone would be the first essential release of the year. For what was anticipated to be essentially a &quot;house music&quot; album, this collection of proper songs resembled something more akin to electronic folk/soul. Influenced by the likes of Natalie Merchant and Rickie Lee Jones, Webster's songs strike chords of deep emotion, sublime energy, and curious optimism. Its low key approach threw a lot of critics off course until a few spins could bring them front and center. What they were hearing was one the best LPs to come out under the &quot;electronica&quot; moniker as All Systems Gone was written as much for the head and heart as moving feet and shaking butts. Songs like Future Love, Been 2 Long, Matter of Fact, Favor Nothing, The Strength Within, and Far Far Away From My Heart easily took command of coffee tables and dance floors of every trendy hotspot in London and beyond. Quietly maneuvering through all expectation, demand, club phenomena, and critical acclaim, ASG ground new respect and regard for what a dance music album could be. Subtle washes of sound come and go like tides, deft, soulful vocals belt and weave polished production of substance and sonic appeal. Presence has established many voices - all of them eloquently with spark and fervor. Recognition overdue, Charles Webster moved into that sacred ground of true songsmith. The All Systems Gone album has gone on to achieve what all great ones do - never copy, never imitate, always initiate a true original being born. Five years after this fact I still revel in its growth and maturity. With each spin, All Systems Gone never fails to make me feel that inexplicable, my favorite feeling.","torrent":{"xt":"urn:btih:9c8d2fb51ce253eeeb807aec3a35e3fd0e208610","amp;dn":"Presence-+%281999%29+All+systems+gone","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9c8d2fb51ce253eeeb807aec3a35e3fd0e208610","infoHashBuffer":{"type":"Buffer","data":[156,141,47,181,28,226,83,238,235,128,122,236,58,53,227,253,14,32,134,16]},"announce":[],"urlList":[]}}