{"title":"I-Doser You-Choose","uid":4754925,"size":365362098,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:9cc0914658d87860fbb1d91c5ad778c71cbeb287&amp;dn=I-Doser+You-Choose&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"alvinacres4848","files":1,"time":1236400597,"description":"I-Doser You-Choose. Highest Quality. Dose converted from .drg to .wav &amp; saved in Apple Lossless format. Read or play from iTunes convert to your favorite format from there. Keep your bitrate up!\n\nIf you prefer another format let me know. (FLAC is BS, IMO)\n\nI'll do one at a time and keep the quality up. Coming from Mac. No virus.\n\n\n\nYou-Choose\n(3 to 25 Hz) (VERY STRONG!)\n1 Hour\n\nYou-Choose is one of our most advanced I-Doser Doses! It puts the power of the Dose in your hands, because sometimes you just want to dose until you feel good. This is where the powerful You-Choose Dose comes in. This is an hour long dose, but it is not intended to be used for the full hour. The concept is simple: Start the dose, and then only dose until you feel the effect you want. If you feel the powerful change of Delta after only 10 minutes, then shut the dose off. If you hit full Gamma after 50 minutes and peak, then stop. You do not need to dose for the full hour of the dose, only until you reach the level you want. Included with each You-Choose dose is a DETAILED user manual that outlines what effects You-Choose can achieve. The You-Choose Dose travels through all levels: Alpha, Beta, Delta, Gamma, Theta - You WILL hit one level somewhere in this dose and things will just click, you will shut the dose off, and feel like you have never felt before. That amazing point where the right level is achieved feels like nothing you have felt before: Your brain snaps into place, and you know you have reached the exact perfect point in the dose. Yes, it is slightly more expensive, but you will FEEL IT in the EXPERIENCE. NOTE! Because of the extreme powerful nature of this dose, it is intended for ADVANCED I-Doser users ONLY!\n\nDirections: Start playing the You-Choose dose. The Dose will play for an hour if left going, but it is meant to be stopped when you feel your brain and body CLICK into a level that makes you feel how you want. When you feel this full-body CLICK, simply stop the dose and do not continue through the whole hour. SIMPLE! The unconventional mixing of the levels in a non-linear mix have taken those dose to a level never before reachable. \n\nBelow is a rough guideline of the levels the You-Choose will take you through. This is meant for a rough estimate only. LISTEN TO YOUR MIND, above all else. It will tell you when to stop the dose.\n\nSTART DOSE PLAYING (in MIN/SEC format:)\n\nFROM 00:00-12:00 you will be in: DELTA:\nThis is normally generated in deep sleep, or when unconsious. Those experienced in deep trance states can generate these waves whilst remaining conscious. Conducive to miracle type healing, divine knowledge, inner being and personal growth, rebirth, trauma recovery, one with the universe experiences (samadhi), near death experience, characterized by unknowing merely a blissful being state such as deep sleep or coma. High level mediation, Delta can assit you reach peak monk-type levels.\n\nFROM 12:30-24:00 you will be in: THETA:\nThis is the region between sleep and wakefulness, in which dreaming and other dream-like or hypnagogic experiences occur.  It's that bit just before you actually fall asleep at night, or just before you are really awake in the morning. They say it's in this band that the unconscious talks to the conscious mind.  It also seems to be connected with psychic or ESP-type functioning. Found in states of deep relaxation, theta activity is also associated with bursts of creative insight, twilight sleep, learning and vivid mental imagery. It is also found in more advanced meditators.\n\nFROM 24:30-36:00 you will be in: ALPHA:\nThis is produced when you are awake and fully conscious, but with your awareness focussed inside, such as when trying to remember something, or when your eyes are closed. For beginner meditation, etc, Alpha is the perfect starting point in moving forward in meditation. Alpha causes Slower brain waves that are conducive to creative problem solving, accelerated learning, mood elevation, stress reduction, etc, characterized by intuitive insights, creative juice, inspiration, motivation, daydreams etc. Relaxed, yet alert.\n\nFROM 36:30-48:00 you will be in: BETA:\nThis is normally generated when you are awake, with the attention focussed outside, dealing with the outside world. It is also generated when you are solving logical problems, such asmental arithmetic. Alert focusing, vitality, concentration on tasks. Earth resonance. Beta causes an increase mental ability, focus, alertness, and IQ.\n\nFROM 48:30-60:00 you will be in: GAMMA:\nGamma is associated with information-rich task processing and high-level information processing &quot;A New Theory of Consciousness&quot; For scientists who study the human brain, even its simplest act of perception is an event of astonishing intricacy. Gamma brain activity may be a kind of binding mechanism. Gamma waves serve to connect structures in the cortex where advanced information processing occurs, and the thalamus, a lower brain region where complex relay and integrative functions are carried out. Gamma pulses are thought to lead to synchronization and coordination of neurons assigned to the processing of incoming sensory stimulation. Put in computerese, Gamma may be the brain's operating system frequency.\n","torrent":{"xt":"urn:btih:9cc0914658d87860fbb1d91c5ad778c71cbeb287","amp;dn":"I-Doser+You-Choose","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9cc0914658d87860fbb1d91c5ad778c71cbeb287","infoHashBuffer":{"type":"Buffer","data":[156,192,145,70,88,216,120,96,251,177,217,28,90,215,120,199,28,190,178,135]},"announce":[],"urlList":[]}}