{"title":"Animals Behaving Badly by Linda Lombardi","uid":9620200,"size":700495,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9d84f38c50b045a825861ae17d5340d03eb8a0d4&amp;dn=Animals+Behaving+Badly+by+Linda+Lombardi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"PirateBook","files":1,"time":1392489852,"description":"\nThere's a lot that animals don't want you to know, and the better their public image, the worse their secrets are: gang-rapist dolphins; lazy, infanticidal lions; and, of course, our own dogs, who eat our money, set our houses on fire, and in more than one case, actually shoot their owners with guns.\n\nAnimals Behaving Badly shows that animals are just like us: gluttonous, selfish, violent, lustful, and always looking out for number one. Using anecdotes from the news and from scientific research, Linda Lombardi pokes fun at our softhearted preconceptions about animals, makes us feel a little better about humanity's basest impulses, and painlessly teaches us a bit more about our furry and feathered friends.\nYou'll learn:\n\nBees love alcohol: even, says one researcher, more than college students Pandas enjoy pornographic movies-they're particularly aroused by the soundtrack-and macaques will pay with juice to look at dirty pictures A rabbit who lives in a pub in England is addicted to gambling with a slot machine African elephants raised by teenage mothers form violent youth gangs\n\nGenre: Non Fiction , Humor ","torrent":{"xt":"urn:btih:9d84f38c50b045a825861ae17d5340d03eb8a0d4","amp;dn":"Animals+Behaving+Badly+by+Linda+Lombardi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d84f38c50b045a825861ae17d5340d03eb8a0d4","infoHashBuffer":{"type":"Buffer","data":[157,132,243,140,80,176,69,168,37,134,26,225,125,83,64,208,62,184,160,212]},"announce":[],"urlList":[]}}