{"title":"GetFLV 9.0.9.5 (x64) - Work 100% - Full","uid":7558127,"size":22234676,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:9d9256eed4a48572a5c78b6b764696f1f2b733e7&amp;dn=GetFLV+9.0.9.5+%28x64%29+-+Work+100%25+-+Full&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"IFBTJB","files":1,"time":1345672006,"description":"This program does not support Windows 8 becuse of different flash player integrated in Windows 8.\n\n- Download Flash movies flawlessly:\nMost web-sites with Flash movies don't allow you to download them. With GetFLV it's easy to download FlashSimply launch the FLV browser, and visit your favorite video site. Select and play a video, and click &quot;download&quot; to save it to your hard drive.\n\n- Supports HTTP, RTMP, RTMPT, RTMPE, RTMPTE protocols.\n\n- Download on-demand flash movies faster than in real time:\nGetFLV reduces the time that it takes to download on-demand FlashThe program splits the file into sections, and downloads multiple sections simultaneously, efficiently optimizing whatever Internet connection you're using.\n\n- Convert Flash movies to watch on portable devices:\nYou can convert movies to MP4 (for Apple iPod), AVI, MPEG, 3GP, MOV, and WM formats. No external codecs required.\n\n- Convert other video to Flash movies:\nGetFLV can convert formats such as MPEG, AVI, WMV, MOV, ASF, MP4, 3GP and etc. into Flash files.\n\n- Extract music from Flash movies:\nGetFLV's can extract the music track from any Flash movie. You can also convert these music tracks into MP3, WMA, WAV, AAC, and other popular music formats.\n\n- Repair damaged Flash movies:\nGetFLV can repair damaged FlashThe built-in FLV Fixer and MetaData Injector will analyze and repair Flash files that won't play properly.\n\n- FLV player:\nA built-in FLV Player helps you play FLV Files on any PC.\n\n- Video Site Library:\nGetFLV web site includes a video web site library that lists the most popular general-interest sites, as well as movies, television, sports, news, music, health, travel, science, and many more.\n","torrent":{"xt":"urn:btih:9d9256eed4a48572a5c78b6b764696f1f2b733e7","amp;dn":"GetFLV+9.0.9.5+%28x64%29+-+Work+100%25+-+Full","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d9256eed4a48572a5c78b6b764696f1f2b733e7","infoHashBuffer":{"type":"Buffer","data":[157,146,86,238,212,164,133,114,165,199,139,107,118,70,150,241,242,183,51,231]},"announce":[],"urlList":[]}}