{"title":"Magicians - Jeff McBride - Art of Card Manipulation vol.3 DVDRip","uid":7564009,"size":733926408,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:9dfaed34413d915533d2f0e1fc2e32e870835916&amp;dn=Magicians+-+Jeff+McBride+-+Art+of+Card+Manipulation+vol.3+DVDRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MagicManPC","files":4,"time":1345769379,"description":"\nJeff McBride - Art of Card Manipulation vol.3 DVDRip Xvid\n &lt;a href=&quot;\nhttp://www.penguinmagic.com/p/91&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.penguinmagic.com/p/91&lt;/a&gt;\n\nA Step-by-Step Guide to Creating Real Magic at your Fingertips\n\nJeff McBride, renowned performer and one of the finest card manipulators of our time, teaches you the inside secrets of professional card manipulation. Routines, sleights, productions and flourishes are clearly taught and demonstrated, along with sample routines and the seasoned advice that only a working professional can provide. Many of these sleights and techniques have been closely guarded for years - never published, but only passed on from one professional to another. These can only be found exclusively on this set of studio - quality DVDs. Jeff leads you through each and every item, while giving you the little tips that make learning easier and performing more entertaining.\n\nNever has video instruction been more valuable. You see how the sleights should look, precisely how they are timed and how they are performed in the real world. Now with the help of Jeff McBride, you can learn the baffling and sophisticated card manipulations you have always dreamed of performing! \n\nVolume 3 contains:\n\nOne Handed Shuffle; Triple Cut; Paul Draylin Cut; Butterfly Cut; Curly - Q Move; Auto Cut - Rolo - Deck; Boomerang Card; Card Spinning; Garcia's Eclipse Production; Card Production; Japanese Card Production; Del Rosso Buffo; Garcia's Million Dollar Production; Cardini's Cards and Silk with Tenkai Palm; Packet Vanish; Single Card Production; Squeeze Production; Card Production Routine; Euro Edge - Palm Production; Tenkai Toss Vanish and Transfer; McBluff Production; Mercury Card Production; Diminishing Cards; Interlock Production; History of Playing Cards.\n\n----------------------------------------------\nYou can download the full DVDs and the rest \nof the volumes on Usenet at alt.binaries.magic \n(see the included pdf in this download).\n----------------------------------------------\n\nEnjoy!","torrent":{"xt":"urn:btih:9dfaed34413d915533d2f0e1fc2e32e870835916","amp;dn":"Magicians+-+Jeff+McBride+-+Art+of+Card+Manipulation+vol.3+DVDRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9dfaed34413d915533d2f0e1fc2e32e870835916","infoHashBuffer":{"type":"Buffer","data":[157,250,237,52,65,61,145,85,51,210,240,225,252,46,50,232,112,131,89,22]},"announce":[],"urlList":[]}}