{"title":"Raul Malo - Sinners &amp; Saints [2011][EAC,log,cue. FLAC]","uid":8265707,"size":284550290,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:9e055eaba056a5677bda9eae5e8465b724d8a8ee&amp;dn=Raul+Malo+-+Sinners+%26amp%3B+Saints+%5B2011%5D%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":12,"time":1363492301,"description":"Artist: Raul Malo\nRelease: Sinners &amp; Saints\nMusicBrainz: 6fa0ad3d-27b9-43d7-a91d-88d70505bd51\nFormat: CD\nReleased: 2011-01-24\nLabel: Concord Records\nCatalog#: 7232794\nCountry: GB\n\nTracklisting:\n\n01. Sinners &amp; Saints (05:34)\n02. Living for Today (05:17)\n03. San Antonio Baby (04:00)\n04. 'Til I Gain Control Again (06:14)\n05. Staying Here (04:33)\n06. Superstar (03:15)\n07. Sombras (04:00)\n08. Matter Much to You (03:52)\n09. Saint Behind the Glass (03:39)\n10. Mrs Brown (04:07)\n11. Better Off in Texas (feat. Ray Benson) (04:37)\n\nSelf-produced in his home studio, Sinners &amp; Saints is the most intimate, honest and complex album Raul Malo has made in an already distinguished career. One hears in it a lifetime's journey, from the singer-songwriter's youth in Cuban neighborhoods of Miami through his years as one of the most intriguing talents in the Americana scene.\n\nRooted in Malo's lifelong connection to Latin music but infused with his wide-ranging love of country, blues, jazz and vintage rock 'n' roll, Sinners &amp; Saints combines sonic ingenuity with emotional sincerity.\n\nIn a departure from his past albums, Malo took his tracks from his home studio in Nashville to Austin, where an incredible musical cross-pollination took place. Malo has spent much time playing in Texas with the Lone Star State's wealth of legendary musicians. He entered longtime friend Ray Benson's Bismeaux Studios and finished the album with the help of Sir Douglas Quintet and Texas Tornado veteran Augie Meyers on the Vox Continental organ and, on the song &quot;Superstar,&quot; guitarist Shawn Sahm, Sir Douglas' son. The Trishas (Savannah Welch, Kelley Mickwee, Liz Foster and Jamie Wilson) provided background vocals. And hotshot accordionist Michael Guerra, known for his work with the Tex-Mex Experience, lent further Tejas authenticity to the sound.\n\nThe title track opens the record, setting the album's tone thematically and musically. From his boyhood and through his years of coming of age in Miami, Malo spent many nights in neighborhood music rooms listening to local artists perform their Flamenco zarzuelas. Malo wrote &quot;Sinners &amp; Saints&quot; by conjuring up those nights in his head, and playing his electric guitar with a cross between Flamenco melodicism and retro surf-twang. &quot;It has no chorus, no repeatable line,&quot; he says, &quot;And it's long. Purposefully long.&quot;\n\nThe second track, &quot;Living for Today,&quot; ventures into socio-political territory against an upbeat sound that includes chiming guitars, Meyers' Vox organ and the Trishas' backing vocals. In a musical space that includes the biting observations of Rodney Crowell, James McMurtry or Todd Snider, this song is a welcome addition. Speaking of Crowell, Malo provides a heart-felt reading of his modern-day standard &quot;Til I Gain Control Again.&quot;\n\nThe disc's other songs are also full of special moments. In Austin Malo recorded an original song called &quot;Superstar&quot; with several pals from the Texas Tornados. That and several other tracks feature Guerra's blazing Tex-Mex accordion, as in &quot;San Antonio Baby.&quot; In a more serious vein, Malo delivers the classic Spanish song &quot;Sombras&quot; in the stunning tenor voice that made him famous. He also offers an innovative cover of Los Lobos' &quot;Saint Behind the Glass,&quot; whose rich mix of percussion, guitars and Mexican instruments will leave audiophiles deeply absorbed. The cryptic lyrics offer an unexpected finale to the album.\n\nRaul Malo has seen and done a great deal in his career but Sinners &amp; Saints demonstrates there is much more inside him. &quot;This is the hardest I've ever worked on an album,&quot; he says with a mixture of relief and pride. That includes the physical labor of confronting the studio alone day after day as well as the emotional courage to challenge his listeners and speak his mind. &quot;This really is about me and my point of view. I realized that after I'd done it. It reflects really how I feel about a lot of things. That's why this is as much of me as I've ever put on a record.","torrent":{"xt":"urn:btih:9e055eaba056a5677bda9eae5e8465b724d8a8ee","amp;dn":"Raul+Malo+-+Sinners+%26amp%3B+Saints+%5B2011%5D%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e055eaba056a5677bda9eae5e8465b724d8a8ee","infoHashBuffer":{"type":"Buffer","data":[158,5,94,171,160,86,165,103,123,218,158,174,94,132,101,183,36,216,168,238]},"announce":[],"urlList":[]}}