{"title":"Torchlight.Retail.READNFO-ViTALiTY","uid":5395695,"size":1244344146,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:9eaaa5276b86841f6375408669717940568b3db1&amp;dn=Torchlight.Retail.READNFO-ViTALiTY&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"thenoobish","files":26,"time":1267222561,"description":"Torchlight (c) Runic Games\n\nProtection .....:\n\nDate ...........: February 2763   Number of Discs .........: 1\n\nGAME NOTES\n\nThis is the RETAIL boxed edition of Torchlight\nand not  a  homemade  iso  or  preview  build.\nThe difference is quite clear as  ONLY  RETAIL\ngets a bonus pet, the Ferret, as well  as  the\nthe full editor on a DVD. Install the optional\neditor seperately after the main game setup.\n\n\nTorchlight is an exciting new action  role  playing  game,\nwhere players explore randomly generated  dungeon  levels,\nbattle a variety of monsters, and pursue endless fame  and\nfortune. From the designers and leads  of  Diablo,  Diablo\nII, Fate, and Mythos! This hack-and-slash adventure is set\nin the mining settlement of Torchlight, a town founded  on\nthe  discovery of a rare and mysterious ore called  Ember.\nThis valuable ore has the power to enchant and corrupt but\nits value is such that many  are  willing  to  risk  their\nlives for it. Now,  miners  have  uncovered   Torchlights\nburied past: a dangerous labyrinth of  caverns,  monsters,\nand ruined civilizations beneath the ground that have been\ncorrupted by Embers dark influence. As Evil threatens  to\noverrun the town, a Champion is needed. Players will  have\nthe opportunity to save the town of  Torchlight,  battling\nthrough rock and fire, through  lost  cities,  and  across\nancient tombs on a perilous journey to cleanse the  mines.\nAs one of three Character Classes,  Players  will  explore\nrandomly  generated  dungeon levels, battle a huge variety\nof  monsters,  and  pursue  endless  variations  of   fame\nand fortune. The Ember beckons...how will you answer?\n\n\n\n\n\nINSTALL NOTES\n\n\n\nUnpack\nBurn or mount\nInstall","torrent":{"xt":"urn:btih:9eaaa5276b86841f6375408669717940568b3db1","amp;dn":"Torchlight.Retail.READNFO-ViTALiTY","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9eaaa5276b86841f6375408669717940568b3db1","infoHashBuffer":{"type":"Buffer","data":[158,170,165,39,107,134,132,31,99,117,64,134,105,113,121,64,86,139,61,177]},"announce":[],"urlList":[]}}