{"title":"Soft Mac Emulator For XP","uid":3742956,"size":21058810,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:9f076bef691983ca4179dc5f281b4da6e2a21550&amp;dn=Soft+Mac+Emulator+For+XP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"vethaveth","files":112,"time":1184524357,"description":"Applications : Windows : English\nMacintosh Emulator for Microsoft Windows - includes both the SoftMac XP \n\nClassic Edition for Windows 95/98/200 and SoftMac XP Xpress Edition for \n\nWindows XP\n\nOperating systems:\n\n* Windows 95/98/Me\n* Windows NT 4.0\n* Windows 2000\n* Windows XP *\n* Windows 2003 *\n* Windows Longhorn *\n\n* - 32-bit OS editions only\n\nDisk devices supported:\n\n* IDE and SCSI CD-ROM drives\n* 3.5 inch 1.44M floppy disks\n* 120M LS-120 floppy disks\n* Iomega ZIP and Jaz disks\n* external SCSI hard disks\n* external USB drives\n* Sony Memory Stick drives\n\nAdditional drivers required:\n\n* Users of Windows NT 4.0 and Windows 2000 need to install Adaptec&amp;#039;s latest \n\nASPI SCSI drivers for accessing Macintosh SCSI and CD-ROM devices.\n\nThis is the full release of the SoftMac XP Suite version 8.2. It replaces all \n\nearlier releases of SoftMac 2000 and adds compatibility with Windows XP and \n\nWindows 2003. Use it to run System 7 and Mac OS 8 on your Windows computer at \n\nspeeds that rival most Power Macintosh computers!\n\nWindows users: the SOFTMAC.ZIP file is an executable self-extracting ZIP file. \n\nWe recommend that you click on the link to SOFTMAC.ZIP. When prompted by your \n\nbrowser, select Save to save the file to your computer as the file \n\nSOFTMAC_SETUP.EXE. Then run that file to install the SoftMac XP product suite \n\nto your Windows computer and set up the appropriate Start menu shortcuts.\n\nIf you wish to save the SoftMac release as a ZIP file, the SOFTMAC.ZIP file \n\ncan be saved to disk and extracted using PKUNZIP, WinZIP, StuffIt Expander, \n\nthe Windows XP Explorer, or other ZIP file extractor .\n\nThis setup program installs two versions of SoftMac XP. If you are using an \n\nolder PC (Pentium II or earlier, Windows 98 or earlier) we recommend using the \n\nSoftMac XP Classic Edition, as it is smaller and memory efficient. If you are \n\nusing a more current PC, we recommend using the SoftMac XP Xpress Edition \n\nwhich is optimized for the Intel Pentium 4 and Windows XP, and also offers \n\nhigher limits on memory and graphics emulation. A 30-day trial activation is \n\nrequired.\n\nPlease read the full SoftMac documentation before trying to run SoftMac XP. \n\nSevere damage to your PC can result if SoftMac XP is used improperly.\n\nWindows 95, Windows NT 4.0, and Windows 2000 users: You need to make sure ASPI \n\n(the Windows driver WNASPI32.DLL) is installed on your system for Windows to \n\nbe able to read your Macintosh CD-ROMs and ZIP disks. Various versions of the \n\nASPI driver can be downloaded from Adaptec&amp;#039;s web site and from here.\n\nUsers of Windows 98, Windows Millennium, Windows XP, and Windows 2003 do not \n\nneed to download or install ASPI as your Windows release can already read \n\nMacintosh CD-ROMs.\n\nIt is also recommended that you update your video drivers and DirectX drivers \n\nto their latest versions. Some older ATI RAGE PRO video drivers (used by \n\nAll-In-Wonder-Pro and similar cards) are known to be buggy and will cause \n\ndisplays problems in SoftMac as well as Internet Explorer and other Windows \n\napplications.\n\n\nGemulator Explorer 2.03\n\nOperating systems:\n\n* Windows 95/98/Me\n* Windows NT 4.0\n* Windows 2000\n\nDisk devices supported:\n\n* IDE and SCSI CD-ROM drives\n* 3.5 inch 1.44M floppy disks\n* 120M LS-120 floppy disks\n* Iomega ZIP and Jaz disks\n* external SCSI hard disks\n\nAdditional drivers required:\n\n* Adaptec&amp;#039;s latest ASPI SCSI drivers for accessing SCSI and CD-ROM devices.\n\n\nith Gemulator Explorer, you can access and copy files from any Macintosh 1.44M \n\nfloppy disk, Macintosh CD-ROM, Macintosh ZIP disk, external Macintosh SCSI \n\nhard drive, Atari ST formatted floppy disk, Atari ST ZIP disk, Atari ST \n\nformatted hard drive, and even disk image files.\n\nThis utility is also great for creating disk images of your floppies and even \n\nCD-ROMs, as these images can later be mounted in a Macintosh emulator. Floppy \n\ndisk images can also be copied back to a real floppy disk for fast disk \n\nduplication or quick formatting of Macintosh floppy disks on your PC.\n\nSupports disk image files created by Mac OS Disk Copy, by various Macintosh \n\nemulators (.DSK files from SoftMac 2000, .HFX/.HFV files from Executor, \n\nFusion, vMac, and Basilisk II), and by Atari emulators. Use Gemulator Explorer \n\nto read disks and disk images that MS-DOS and Windows normally won&amp;#039;t!\n\nTo install, unZIP the contents of GEMXPLOR.ZIP and make sure you that you&amp;#039;re \n\npreviously installed ASPI. Then run GEMXPLOR.EXE. The program will display a \n\nlist of available disk drives, including any SCSI devices such as CD-ROMs and \n\nZIP drives. Click on any drive and on the right half of the window you&amp;#039;ll see \n\na disk directory of the files on that disk. Navigate the directory just like \n\nany Windows directory, by double clicking on directory icons to go into a \n\ndirectory, and pressing backspace to exit a directory.\n\nThis free release is limited to copying a single file at a time from the Mac \n\nor Atari disk to your PC&amp;#039;s disk.\n\n\nDisk Image Creation Utilities\n\nMAKEDSK\n\n\nOperating systems:\n\n* Windows 95/98/Me\n* Windows NT 4.0\n* Windows 2000\n* Windows XP\n* Windows 2003\n* Windows Longhorn\n\n\nUtilities to create blank disk image files. The main use for this is to create \n\nblank Macintosh hard disk images for use with SoftMac 2000 and other Macintosh \n\nemulators, or to create blank Atari ST hard disk images for use by Gemulator. \n\nTo install, unZIP the contents of MAKEDSK.ZIP. There are two similar utilities \n\nprovided - MAKEDSK.EXE and MAKEIMG.EXE.\n\nMAKEDSK.EXE is used to create a large zero-filled file on your hard disk. This \n\ncan then be mounted by SoftMac 2000 and formatted using the Mac OS disk \n\nformatting utility as a large Macintosh hard disk partition.\n\nMAKEIMG.EXE is used to create pre-formatted Macintosh hard disk and floppy \n\ndisk images. The images are formatted in standard HFS format and contain a \n\nblank root directory. The files can then be mounted as .HFX files by SoftMac \n\n2000 and other Macintosh emulators.\n\nFrom a command line prompt type MAKEIMG or MAKEDSK followed by the name of the \n\nimage file to create and the size in kilobytes. For example, to create a blank \n\nformatted Macintosh floppy disk image, type:\n\nMAKEIMG UNTITLED.IMG 1440\n\nYou can then use the Gemulator Explorer utility to write this image to a real \n\nfloppy disk, thus being able to format a Macintosh floppy disk on your PC! \n\nAnother example, to create a 500 megabyte Macintosh hard disk image for use \n\nwith SoftMac 2000, (which you can mount and format with the Mac OS).\n\n\n\n\nQEMU is an emulator for various CPUs. It works on Linux, Windows, FreeBSD and \n\nMac OS X. Windows version is in an alpha stage.\n\nWhat&amp;#039;s New!\nPatches for VNC and VVFAT are added. (2006/11/25)\nBinary for all patches is updated.\nDebugging Tips is updated. (2006/11/08)\nBinary for SPARC with all patches is added. (2006/11/03)\nBinary for all patches is updated. (2006/10/30)\nBinary for keyboard is updated. (2006/10/28)\nBinary for all patches is updated. (2006/10/26)\nBinary for keyboard is updated. (2006/10/23)\nBinary for all patches is added. (2006/10/21)\nBinary for keyboard is added.\n\nPlease Seed If You Can Thanks","torrent":{"xt":"urn:btih:9f076bef691983ca4179dc5f281b4da6e2a21550","amp;dn":"Soft+Mac+Emulator+For+XP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9f076bef691983ca4179dc5f281b4da6e2a21550","infoHashBuffer":{"type":"Buffer","data":[159,7,107,239,105,25,131,202,65,121,220,95,40,27,77,166,226,162,21,80]},"announce":[],"urlList":[]}}