{"title":"Up + Running with AutoCAD 2012, 2nd Ed.2D+3D Drawing+Modeling","uid":7835887,"size":27848772,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a08e227fbd3363cef0e14e9f4fda984b00bed828&amp;dn=Up+%2B+Running+with+AutoCAD+2012%2C+2nd+Ed.2D%2B3D+Drawing%2BModeling&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2010kaiser","files":2,"time":1353186784,"description":"  Up + Running with AutoCAD 2012, 2nd Ed.2D+3D Drawing+Modeling-2010kaiser\n\n\n\n\nGindis introduces AutoCAD with step-by-step instructions, stripping away complexities to begin working in AutoCAD immediately. All concepts are explained first in theory, and then shown in practice, helping the reader understand what it is they are doing and why, before they do it.\n\nDivided into three parts, the book covers beginning through advanced AutoCAD, including 3D features. Also included is an extensive appendix for each part, detailing additional useful CAD-related information not often found in other textbooks. The book contains supporting graphics (screenshots) and a summary with a self-test section at the end of each chapter. Also included are drawing examples and exercises, and two running &quot;projects&quot; that the student works on as he/she progresses through the chapters.\n\n1. Strips away complexities, both real and perceived and reduces AutoCAD to easy-to-understand basic concepts.\n2. Teaches only what is essential to operating AutoCAD first, thereby immediately building student confidence.\n3. All basic commands are documented step-by-step, meaning that what the student needs to type in and how AutoCAD responds is all spelled out in discrete and clear steps with screenshots added as needed.\n4. Using the author's extensive multi-industry knowledge of what is important and widely used in practice versus what is not, the material is presented by immediately immersing the student in practical, critically essential knowledge, with no padding of text or filler material.\n5. All concepts are explained first in theory, and only then is AutoCAD introduced and the actual &quot;button pushing&quot; discussed. This is one of the key concepts in having students understand exactly what it is they are doing and why, before they do it.\n\n\nENJOY AND SEED!!!","torrent":{"xt":"urn:btih:a08e227fbd3363cef0e14e9f4fda984b00bed828","amp;dn":"Up+%2B+Running+with+AutoCAD+2012%2C+2nd+Ed.2D%2B3D+Drawing%2BModeling","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a08e227fbd3363cef0e14e9f4fda984b00bed828","infoHashBuffer":{"type":"Buffer","data":[160,142,34,127,189,51,99,206,240,225,78,159,79,218,152,75,0,190,216,40]},"announce":[],"urlList":[]}}