{"title":"Jacques Vallee and Chris Aubeck - Wonders In The Sky (2011)","uid":6217448,"size":11185699,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a0e99e1fc0acd691d2b3c60d64e5659692c7fc31&amp;dn=Jacques+Vallee+and+Chris+Aubeck+-+Wonders+In+The+Sky+%282011%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"geogaddi000","files":-1,"time":1299213529,"description":"One of the most ambitious works of paranormal investigation of our time, here is an unprecedented compendium of pre-twentieth-century UFO accounts, written with rigor and color by two of today's leading investigators of unexplained phenomena.\n\nIn the past century, individuals, newspapers, and military agencies have recorded thousands of UFO incidents, giving rise to much speculation about flying saucers, visitors from other planets, and alien abductions. Yet the extraterrestrial phenomenon did not begin in the present era. Far from it. The authors of Wonders in the Sky reveal a thread of vividly rendered-and sometimes strikingly similar- reports of mysterious aerial phenomena from antiquity through the modern age. These accounts often share definite physical features- such as the heat felt and described by witnesses-that have not changed much over the centuries. Indeed, such similarities between ancient and modern sightings are the rule rather than the exception.\n\nIn Wonders in the Sky, respected researchers Jacques Vallee and Chris Aubeck examine more than 500 selected reports of sightings from biblical-age antiquity through the year 1879-the point at which the Industrial Revolution deeply changed the nature of human society, and the skies began to open to airplanes, dirigibles, rockets, and other opportunities for misinterpretation represented by military prototypes. Using vivid and engaging case studies, and more than seventy-five illustrations, they reveal that unidentified flying objects have had a major impact not only on popular culture but on our history, on our religion, and on the models of the world humanity has formed from deepest antiquity.\n\nSure to become a classic among UFO enthusiasts and other followers of unexplained phenomena, Wonders in the Sky is the most ambitious, broad-reaching, and intelligent analysis ever written on premodern aerial mysteries.\n","torrent":{"xt":"urn:btih:a0e99e1fc0acd691d2b3c60d64e5659692c7fc31","amp;dn":"Jacques+Vallee+and+Chris+Aubeck+-+Wonders+In+The+Sky+%282011%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a0e99e1fc0acd691d2b3c60d64e5659692c7fc31","infoHashBuffer":{"type":"Buffer","data":[160,233,158,31,192,172,214,145,210,179,198,13,100,229,101,150,146,199,252,49]},"announce":[],"urlList":[]}}