{"title":"lingo  2Lions-Team","uid":4854256,"size":105625953,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:a20e1ff1ff71c3a47d0798d1af3be22c4e06bb58&amp;dn=lingo++2Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"calke74","files":-1,"time":1239995475,"description":"Lingo Bekend van de tv (rs)\n\n\n\nSpel is gewoon tespelen vanaf de hd zonder op cd tezetten.\n\n\nOorspronkelijk kreeg elk team 5 pogingen om een 5-letterwoord te raden. Tegenwoordig wordt er gespeeld om 6-letterwoorden. Het team dat de beurt krijgt, krijgt de beginletter van het te raden woord. Bij het laatste woord is dit de eindletter. De spelers van het team dat aan de beurt is dienen om en om een woord beginnend met de gegeven beginletter of eindigend met de gegeven eindletter te noemen. Dit woord dient een correct Nederlands woord te zijn en dient te worden genoemd binnen een gegeven tijdslimiet. Het woord moet bovendien juist gespeld worden. Het spellen is hierbij bepalend en mag afwijken van het genoemde woord. De spelers mogen niet overleggen.\n\nAls het woord op tijd genoemd en correct gespeld is, zal de computer aangeven welke letters op de juiste plek staan en welke letters niet op de juiste plek staan maar wel op een andere plek in het woord zitten. De letters die op de juiste plek staan, worden bij de volgende beurt automatisch ingevuld.\n\nWanneer een speler niet op tijd een woord weet te noemen of wanneer een woord verkeerd gespeld wordt, gaat de beurt naar het andere team. Dat team krijgt een bonusletter, een ingevulde letter op de eerste nog open plek in het woord. Daarbij mag niet worden overlegd.\n\nAls het woord niet binnen het toegekende aantal beurten geraden wordt, krijgt het andere team een bonusletter en mag men wel overleggen.\n\nmeer info zit erbij \n\nVeel game plezier\n\n\n** Na het downloaden blijven seeden A.U.B \n** After downloading seed pleas\n\n******************************************\n\nBrought to you by \n2Lions Team\n\nmeer zien??\nKom dan eens kijken op ons forum \n                &lt;a href=&quot;\nhttp://www.2lions.ons-forum.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions.ons-forum.nl&lt;/a&gt;\n\n******************************************\n","torrent":{"xt":"urn:btih:a20e1ff1ff71c3a47d0798d1af3be22c4e06bb58","amp;dn":"lingo++2Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a20e1ff1ff71c3a47d0798d1af3be22c4e06bb58","infoHashBuffer":{"type":"Buffer","data":[162,14,31,241,255,113,195,164,125,7,152,209,175,59,226,44,78,6,187,88]},"announce":[],"urlList":[]}}