{"title":"Mind Power Math HighSchool","uid":3817196,"size":579923674,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:a2716a175147cb03a4792e8509c08f43154e6fa5&amp;dn=Mind+Power+Math+HighSchool&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"dragonlady1973","files":2,"time":1190602376,"description":"Mind Power Math\nHigh School \nAlgebra 1&amp;2\n\nVisualize, experience, and fully understand an entire spectrum of math concepts.\nLearn Math the easy way - with information graphics, written and audio explanations, and step-by-step concept simulations.\nAlgebra I - Learn powerful problem solving skills, from order of operations, rules of exponents, to systems of equations, the quadratic formula, word problems and graphing methods.\nAlgebra II - Master Algebra II skills and concepts, from factors, radicals, formulas, and functions, to quadratic equations, graphs, word problems and logarithms.\n\nNote a program disc must be in your computer\\&amp;#039;s CD drive at all times during installation and game play.\n\nInstalling on Windows\nThese instructions assume that the AutoPlay feature of Windows is turned on. (AutoPlay is usually enabled when you install Windows on your computer. See your Windows documentation for more information.)\n1. Start Windows and insert the Mind Power Math CD into your CD-ROM drive.\n2. You will be asked if you want to install. Select yes and follow on-screen prompts.\n3. When installation is complete, the Options Screen appears. Select the unit title to begin the program.\n4. The installation process creates a shortcut in the Start menu that can be used to start the program anytime the Mind Power Math CD is in the CD-Rom drive.\n\nStarting the program.\n1. Insert the Mind Power Math CD into your CD-ROM drive.\n2. Select the unit title to begin the program (for systems with autoplay)\n3. (For systems without autoplay) go to the start menu and choose the shortcut under the Programs/The learning company/Mind Power\n4. The options screen appears. From the options screen, select the unit title to begin the program\n\n","torrent":{"xt":"urn:btih:a2716a175147cb03a4792e8509c08f43154e6fa5","amp;dn":"Mind+Power+Math+HighSchool","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a2716a175147cb03a4792e8509c08f43154e6fa5","infoHashBuffer":{"type":"Buffer","data":[162,113,106,23,81,71,203,3,164,121,46,133,9,192,143,67,21,78,111,165]},"announce":[],"urlList":[]}}