{"title":"The Discovery of Genesis - C.H. Kang, Ethel R. Nelson","uid":11773415,"size":1592157,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a2a81ab9cf3248ad91a95ff498dfbfdc539d6302&amp;dn=The+Discovery+of+Genesis+-+C.H.+Kang%2C+Ethel+R.+Nelson&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"starxteel","files":1,"time":1427167165,"description":"\nThis linguistic analysis of the Chinese language suggests the ancient Chinese were well aware of the God of Abraham. Readers will discover the possibility that the Chinese were a remnant of the Tower of Babel dispersion. The authors start with the observance of some astonishing points of correspondence between certain characters in the Chinese language and elements of the Genesis account of man's early beginnings. They go on to analyze dozens of the ideographic pictures that make up words in the Chinese language. The evidence they compile supports the thesis that the ancient picture writing of the Chinese language embodies memories of man's earliest days. The characters when broken down into component parts, reflect elements of the story of God and man recorded in the early chapters of Genesis. Man and woman, the garden, the institution of marriage, the temptaton and fall, death, Noah's flood, the tower of Babel - they are all there in the tiny drawings and strokes that make up the Chinese characters.\n\n\nAbout the author:\nC. H. Kang is a former missionary to China, now retired. His previous work, Genesis and the Chinese, published in 1950, forms the basis for this new inquiry with Dr. Nelson. Dr. Kang now lives in Singapore, Malaysia.\n\nEthel R. Nelson is a medical pathologist, having served for many years in Thailand. Dr. Nelson now lives in Reading, MA","torrent":{"xt":"urn:btih:a2a81ab9cf3248ad91a95ff498dfbfdc539d6302","amp;dn":"The+Discovery+of+Genesis+-+C.H.+Kang%2C+Ethel+R.+Nelson","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a2a81ab9cf3248ad91a95ff498dfbfdc539d6302","infoHashBuffer":{"type":"Buffer","data":[162,168,26,185,207,50,72,173,145,169,95,244,152,223,191,220,83,157,99,2]},"announce":[],"urlList":[]}}