{"title":"PBS - Communism: The Promise and the Reality","uid":3432170,"size":1222492160,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a2d053b059b31e574ec8f0fe3024b3713a280406&amp;dn=PBS+-+Communism%3A+The+Promise+and+the+Reality&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ReVIsed","files":6,"time":1137360707,"description":"Communism was the most cataclysmic social experiment of the century--a mass movement whose ideals promised hope to millions but whose methods claimed millions as its victims. Now, at the end of the century that it trasformed, the time has come to document Communism's rise and fall.\n\nIn Communism: The Promise and the Reality, ordinary people describe how and why they were mesmerized by the promises of Communist regimes. With those regimes collapsing around the world, they are now able to speak openly and with perspective. Theirs are extraordinary stories--stories that describe courageous acts of rebellion and heroic endurances of hardship. Never before have so many paid a price for their idealism.\n\nThese witnesses participated in the most dramatic moments in the history of Communism--from the Bolshevik assault on the Winter Palace to the smashing of the Berlin Wall; from Mao's Great Leap Forward to Castro's invasion of Cuba; from the Tet Offensive to the Gdansk Shipyard strike. They also beheld the response to revolution--the crushing power of American and Soviet forces, the international arms build-up, the threat of nuclear weapons.\n\nTheir voices speak of Communism's horrors, but they remind us that there was hope--for education in Ukraine, self-determination in post-colonial Vietnam, land ownership in Cuba, religious freedom in Afghanistan, national strength in China, relief from poverty in Eastern Europe.\n\nCommunism did not achieve what it set out to do, but its unintended legacy, as evidenced by these witnesses, shows the power of human resilience.\n\nRuntime......: appr.: 360 min\nVideo Codec..: DivX5\nVideo Bitrate: ~ 440 kb/s\nAudio Codec..: mp3\nAudio Bitrate: 64 kb/s\nFrame Size...: 320 x 240\nSource.......: VCD","torrent":{"xt":"urn:btih:a2d053b059b31e574ec8f0fe3024b3713a280406","amp;dn":"PBS+-+Communism%3A+The+Promise+and+the+Reality","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a2d053b059b31e574ec8f0fe3024b3713a280406","infoHashBuffer":{"type":"Buffer","data":[162,208,83,176,89,179,30,87,78,200,240,254,48,36,179,113,58,40,4,6]},"announce":[],"urlList":[]}}