{"title":"GWAR - The Next Mutation","uid":4322538,"size":4293599232,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:a2d42080bab434de330a3d8c83462410faf8e807&amp;dn=GWAR+-+The+Next+Mutation&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"AntonCrowley","files":8,"time":1217568871,"description":"Also known as &quot;RAWGWAR: The Next Mutation&quot; (it is probably a kind of sequel). This was sent out to promoters and the like, prior to GWAR signing to Metal Blade. It is a compilation of early MTV &amp; cable TV appearances and a live show from 1989. Track 1 is from Fangoria&amp;#039;s video magazine, 2 is ?, 3-5 are live, 6 is a video filmed in the studios where they made their appearance on Dr. Gruesome&amp;#039;s Movie Morgue and features a demo version of the song, 7-14 are live, 15 is another Dr. Gruesome video, 16 &amp; 17 are live, and 18 is a video featuring the &quot;Hell-o&quot; version of &quot;Black And Huge&quot;.\n\nIn the live portions, we&amp;#039;re treated to many of the same things that we see in the &quot;Live From Antarctica&quot; video: Melvin Fleebish comes out and gets decapitated during &quot;World O Filth&quot;, they bring out a big body and pull its guts out during &quot;Sexecutioner&quot;, they parade around with and fuck dead animals during &quot;Slutman City&quot;, they fight the Redneck and the Bad Biker Bitch during &quot;Dead Dog/Bone Meal/Ollie North&quot;, a pregnant Bitch comes back out during &quot;Captain Crunch&quot; and they rip the baby out of her belly and smack it around, and finally of course the show ends with the two Techno Destructos facing off against GWAR. The interview segments come from the classic 1989 MTV Week In Rock feature from the New Music Seminar, from Dr. Gruesome&amp;#039;s, and from a cable access TV show. Also worth mentioning: the version of &quot;King Queen&quot; they perform is significantly different than the &quot;Scumdogs of the Universe&quot; version, with completely different lyrics and a very different song structure.\n\nDescription taken from gwarfuq.com","torrent":{"xt":"urn:btih:a2d42080bab434de330a3d8c83462410faf8e807","amp;dn":"GWAR+-+The+Next+Mutation","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a2d42080bab434de330a3d8c83462410faf8e807","infoHashBuffer":{"type":"Buffer","data":[162,212,32,128,186,180,52,222,51,10,61,140,131,70,36,16,250,248,232,7]},"announce":[],"urlList":[]}}