{"title":"The Dragon King Trilogy","uid":9457898,"size":1694797654,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:a34acd06545063ae78a6c7c02027d474f934516c&amp;dn=The+Dragon+King+Trilogy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"k1ll3rc0w80y","files":-1,"time":1389301224,"description":"In The Hall of The Dragon King:\n\n\nA kingdom hangs in the balance...and a young boy answers the call.\n\nCarrying a sealed message from the war-hero Dragon King to the queen, Quentin and his outlaw companion, Theido, plunge headlong into a fantastic odyssey and mystic quest. Danger lurks everywhere in the brutal terrain, and particularly in the threats from merciless creatures, both human and not-so-human.\n\nWhile at the castle, the wicked Prince Jaspin schemes to secure the crown for himself, and an evil sorcerer concocts his own monstrous plan. A plan that Quentin and Theido could never imagine.\n\nIn the youth's valiant efforts to save the kingdom and fulfill his unique destiny, he will cross strange and wondrous lands; encounter brave knights, beautiful maidens, and a mysterious hermit; and battle a giant, deadly serpent.\n\n\n-----------------------------------------------------------------------------------\n\n\nThe Warlords of Nin:\n\nIt has been ten years since Quentin helped Eskevar, the Dragon King, battle the monstrous sorcerer Nimrood. Since that time, there has been peace in the land of Mensandor. But everything is about to change.\n\nAn urgent message summons Quentin to Castle Askelon. The king, who is dying, wishes to name the brave young man his successor. But first, he sends him on an unfathomable mission.\n\nWhat Quentin and his friend Toli, the Jher horseman, discover is not for the cowardly. The brightening Wolf Star is an omen of impending evil that might herald the beginning of the end of mankind on earth. It signifies Nin, a fearsome giant of a man who hopes to add Mensandor to his growing empire. Along with his merciless warlords, they are the fulfillment of a nightmarish prophecy.\n\n\n-----------------------------------------------------------------------------------\n\n\nThe Sword and The Flame:\n\n\nThe Dragon King who rules the land of Mensandor is none other than Quentin, whose courage and heroism have slowly transformed him from an orphaned servant into a war hero, respected leader and a fierce man of faith.\n\nBut even the powerful can fall prey to weakness. The world is turned upside-down when the dark sorcerer Nimrood--long thought dead after a battle with the previous Dragon King--returns with a fearsome plan. Shattered by the death of a dear and trusted friend, the abduction of his beloved son and the loss of his enchanted sword, Quentin finds his faith tested like never before.\n\nIn The Sword and the Flame, the final volume of Stephen R. Lawhead's captivating Dragon King Trilogy, the fate of the entire world depends on the outcome of this climactic battle between good and evil.","torrent":{"xt":"urn:btih:a34acd06545063ae78a6c7c02027d474f934516c","amp;dn":"The+Dragon+King+Trilogy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a34acd06545063ae78a6c7c02027d474f934516c","infoHashBuffer":{"type":"Buffer","data":[163,74,205,6,84,80,99,174,120,166,199,192,32,39,212,116,249,52,81,108]},"announce":[],"urlList":[]}}