{"title":"Drinking: A Love Story (EPUB, MOBI)","uid":7612394,"size":757613,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a43419ff36624c69a1e2de3c163385dcf2375a50&amp;dn=Drinking%3A+A+Love+Story+%28EPUB%2C+MOBI%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Djofullinn","files":3,"time":1347105537,"description":"Amazon.com Review\nThe roots of alcoholism in the life of a brilliant daughter of an upper-class family are explored in this stylistic, literary memoir of drinking by a Massachusetts journalist. Caroline Knapp describes how the distorted world of her well-to-do parents pushed her toward anexoria and then alcoholism. Fittingly, it was literature that saved her: She found inspiration in Pete Hamill's A Drinking Life and sobered up. Her tale is spiced with the characters she's known along the way. --This text refers to an out of print or unavailable edition of this title.\n\nFrom Publishers Weekly\nFreelance journalist Knapp began drinking in her early teens and continued unabatedly until she &quot;hit bottom&quot; in 1995 and checked herself into a rehab at the age of 36. During that time she managed to graduate with honors from Brown and have a successful career as a journalist, and few people suspected she had a problem with the bottle. Here she recounts the years of denial that helped her rationalize the blackouts, innumerable hangovers, broken relationships and family tensions characteristic of the alcoholic's story. Knapp interweaves her personal history with factual information about alcohol abuse, including frequent references to the AA meetings she's attended. Here's a confession utterly devoid of self-pity, an extraordinarily lucid and very well-written personal account of a common addiction that is filled with insights as well as a comprehensive treatment of the subject. The text reproduces a questionnaire for alcoholism made up by the National Council on Alcoholism and Drug Dependence. First serial to the New York Times Magazine and Cosmopolitan; Literary Guild selection; author tour.\nCopyright 1996 Reed Business Information, Inc. --This text refers to an out of print or unavailable edition of this title.\n &lt;a href=&quot;\nhttp://www.amazon.com/Drinking-Love-Story-Caroline-Knapp/dp/0385315546/ref=sr_1_1?ie=UTF8&amp;qid=1347098034&amp;sr=8-1&amp;keywords=drinking+a+love+story&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Drinking-Love-Story-Caroline-Knapp/dp/0385315546/ref=sr_1_1?ie=UTF8&amp;qid=1347098034&amp;sr=8-1&amp;keywords=drinking+a+love+story&lt;/a&gt;","torrent":{"xt":"urn:btih:a43419ff36624c69a1e2de3c163385dcf2375a50","amp;dn":"Drinking%3A+A+Love+Story+%28EPUB%2C+MOBI%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a43419ff36624c69a1e2de3c163385dcf2375a50","infoHashBuffer":{"type":"Buffer","data":[164,52,25,255,54,98,76,105,161,226,222,60,22,51,133,220,242,55,90,80]},"announce":[],"urlList":[]}}