{"title":"Culbert - AIDS - Terror, Truth, Triumph (1986)","uid":4540141,"size":991103,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a4e0c585812aef9c8d2b125782182e15bf5d4e44&amp;dn=Culbert+-+AIDS+-+Terror%2C+Truth%2C+Triumph+%281986%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"red_gonzo","files":1,"time":1227907295,"description":"This is dr. Michael L. Culbert&amp;#039;s shocking book AIDS - Terror, Truth, Triumph (1986) which explains the nature and multifactorial aspects of the most severe killer disease introduced in this century - AIDS. The Bradford Research Institute/Bradford Foundation of California and Mexico research which went into the preparation of this book has linked together, for the first time in one place, all the the various elements of the AIDS puzzle. The author notes, for example, the links between AIDS and drug use of all kinds, the connection between AIDS, ARC (AIDS-Related Complex) and fluoridated water, the role of food processing (particularly hydrogenated fats) in suppressing the immune system, the threat to immunity presented by modern medicine (antibiotics, corticosteroids, etc.) in immune depression, the role of multiple viral and venereal infections in helping set the stage for the devastating syndrome, the specific challenge of anal lubricants in the overall picture, the parasite connection - and the reality that AIDS is NOT a &quot;gay&quot; disease. The chilling possibilities of insect-borne transmission and of possible biochemical warfare aspects in the elaboration of the so-called &quot;AlDS virus&quot; are also covered in this landmark book. Culbert also notes optimistic results of holistic/eclectic therapy in ARC, pre-AIDS and AIDS cases and sets forth common-sense approaches to prevention. Heavily documented this rare book might offer answers to some of the most pressing questions on AIDS as it goes further than any other. 130 pages. A must read for everyone.\n","torrent":{"xt":"urn:btih:a4e0c585812aef9c8d2b125782182e15bf5d4e44","amp;dn":"Culbert+-+AIDS+-+Terror%2C+Truth%2C+Triumph+%281986%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a4e0c585812aef9c8d2b125782182e15bf5d4e44","infoHashBuffer":{"type":"Buffer","data":[164,224,197,133,129,42,239,156,141,43,18,87,130,24,46,21,191,93,78,68]},"announce":[],"urlList":[]}}