{"title":"Bembeya Jazz National - Hommage a Demba Camara [FLAC] TQMP","uid":6374121,"size":240558562,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a4f0d80cc55e58fb2d7ec72c24805aa814b4f32e&amp;dn=Bembeya+Jazz+National+-+Hommage+a+Demba+Camara+%5BFLAC%5D+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"pastafari","files":-1,"time":1304791292,"description":"Bembeya Jazz National - Hommage a Demba Camara\n1968-1973\nRe-release 2000\n\nAfter listening to Bembeya Jazz' The Syliphone Years, an amazing compilation of Bembeya's work, you may think there's nothing else worth listening to. But you might want to reconsider. This album covers Bembeya's best period when their charismatic and talented singer Demba Camara was still alive. He later died in a car accident in 1973 and Bembeya was never the same again. Demba Camara was one of the best African singers and his presence, along with guitar wizard Sekou Diabate, was pivotal in the success of Bembeya Jazz National. I guess what I'm trying to say is this is my favourite Bembeya compilation, and if you're new to them you should start right here. If you're a fan already, you wouldn't want to miss this.\n\n* * * * * * * * * * * * * * * * * * *\n\nDuring the 1960s and '70s, Guinea's all-powerful president Sekou Toure created a system of state-sponsored national orchestras and instructed them to create modern interpretations of the country's folkloric music. Toure's policy of authenticitÃƒÂ© forced bands to meld traditional music with the Cuban styles and Congolese rumba popular at that time. Guitarists learned to echo the fluid melodies of the kora and balafon. Horn sections harmonized ancient airs. Rhythm sections learned how to make indigenous music danceable, arriving at the sound called Manding Swing. Singers affected the grand vocal dynamics of the griots. From the ranks of the National Orchestra came supergroups Keletigui Traore et ses Tambourinis and Bala et ses Balladins. But the great Bembeya Jazz National from northern Guinea proved the most popular of the new dance bands. Formed in the town of Beyla, far from Guinea's capital, Bembeya's success ultimately spread throughout the countries of the old Manding Empire--Mali, Guinea, Gambia and Senegal--legitimizing Toure's cultural renaissance. In 1973, after a long run of blockbuster concerts and recordings, Bembeya suffered the loss of its fabulously charismatic lead singer, Aboubacar Demba Camara in a car accident in Senegal. Down, but not out, Bembeya continued until 1991, largely relying on the strength of Sekou &quot;Diamond Fingers&quot; Diabate, one of African pop's most innovative guitar virtuosos. Today, a few Bembeya veterans carry on the roots pop tradition, notably singer Sekouba &quot;Bambino&quot; Diabate, who has become a major Guinean star, playing with his mostly acoustic ensemble.\n-- afropop.org\n\n* * * * * * * * * * * * * * * * * * *\n\nTrack List\n01 - Moussogbe\n02 - Beni Barale\n03 - La Guinee\n04 - Dagna\n05 - Fatoumata\n06 - Armee Guineenne\n07 - Ballake\n08 - Alla Lake\n09 - Waraba\n10 - N'Borin\n11 - N'Watoi M'Barale\n12 - Mami Wata\n13 - Festival National\n14 - Whisky Soda\n\n* * * * * * * * * * * * * * * * * * *\n\nArtwork, EAC log and CUE sheet included.\nAudio format: FLAC (Free Lossless Audio Codec) &lt;a href=&quot;\nhttp://flac.sourceforge.net/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://flac.sourceforge.net/index.html&lt;/a&gt;\n\nPastafari &lt;a href=&quot;\nhttp://thepiratebay.se/user/pastafari/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/pastafari/&lt;/a&gt;","torrent":{"xt":"urn:btih:a4f0d80cc55e58fb2d7ec72c24805aa814b4f32e","amp;dn":"Bembeya+Jazz+National+-+Hommage+a+Demba+Camara+%5BFLAC%5D+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a4f0d80cc55e58fb2d7ec72c24805aa814b4f32e","infoHashBuffer":{"type":"Buffer","data":[164,240,216,12,197,94,88,251,45,126,199,44,36,128,90,168,20,180,243,46]},"announce":[],"urlList":[]}}