{"title":"Your Happy Healthy Pet - Turtle, Leopard Gecko, Bearded Dragon","uid":4865003,"size":23583205,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a55c007b9e0a71a0fe70912f6d7cbbdbf674109c&amp;dn=Your+Happy+Healthy+Pet+-+Turtle%2C+Leopard+Gecko%2C+Bearded+Dragon&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"iornix","files":4,"time":1240452551,"description":"Turtle\n\nWith their interesting shells and slow, deliberate demeanors, turtles are intriguing creatures. The more you know about turtles, the more fascinated you'll be as you watch your pet enjoy life in the slow lane. With colorful photos, charts, and tables, this guide covers the basics, including:\n\n* Choosing your turtle--terrestrial or aquatic\n*Setting up a tank with the right environment\n*Essential equipment and supplies\n*Maintaining the proper temperature, lighting, and humidity\n*Feeding and caring for your turtle\n\nLeopard Gecko\n\nLeopard geckos are attractive and easy to care for, making them popular pets. There's lots to know before you bring home a gecko, and this guide fills you in with information on:\n\n* Choosing your Leopard gecko\n* Must-have supplies\n* Setting up and equipping your vivarium\n* Feeding, handling, and caring for your pet\n* Breeding geckos and hatching and raising babies\n\nLeopard geckos can live twenty years or more, so be sure you're ready to commit to your fascinating creature. You'll enjoy years of slinky live entertainment.\n\nBearded Dragon\n\nBearded dragons are increasingly popular; they may soon overtake the green iguana as the most popular reptile in the U.S. With their unique appearance, docile nature, and minimal care requirements, beardies make a great introduction to reptile keeping. With colorful photos, charts, and tables, this guide covers the basics, including:\n\n* The beardie's background and the various breeds of bearded dragons\n* Choosing your bearded dragon\n* Setting up and maintaining your beardie's home, complete with a basking area and lighting\n* Feeding and caring for your bearded dragon ","torrent":{"xt":"urn:btih:a55c007b9e0a71a0fe70912f6d7cbbdbf674109c","amp;dn":"Your+Happy+Healthy+Pet+-+Turtle%2C+Leopard+Gecko%2C+Bearded+Dragon","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a55c007b9e0a71a0fe70912f6d7cbbdbf674109c","infoHashBuffer":{"type":"Buffer","data":[165,92,0,123,158,10,113,160,254,112,145,47,109,124,187,219,246,116,16,156]},"announce":[],"urlList":[]}}