{"title":"Paul Desmond - Bossa Antigua (1964) - FLAC","uid":6222829,"size":382578464,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a6618b3e2822d0645a281692cf070272556386e4&amp;dn=Paul+Desmond+-+Bossa+Antigua+%281964%29+-+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":27,"time":1299404420,"description":"eac secure cue log scans\n\nPaul Desmond - Bossa Antigua \nYear: 1964\nAudio CD: May 18, 1999 \nFormat: Original recording reissued, Original recording remastered \nLabel: RCA \n\nBossa Antigua picks up the samba-based rim shots of drummer Connie Kay on Take Ten and tries to make a whole new record out of them.  While the title track duplicates the original percolating groove of &quot;El Prince,&quot; other tracks like &quot;Samba Cantina&quot; revert to a typical bossa nova rhythm of the period, which leads one to conclude that &quot;bossa antigua&quot; is merely whatever Desmond says it is.  Of the album's two non-originals, &quot;The Night Has a Thousand Eyes,&quot; of course, is made-to-order for Desmond's wistful, sophisticated temperament, and he delivers exactly what a Desmond devotee would expect and love; and &quot;A Ship Without a Sail&quot; has some memorable off-the-cuff solo ideas.  Jim Hall is around again to lend subtle rhythm support and low-key savvy in his solos, and like many Desmond companions of this period, he makes a fine sparring partner in the contrapuntal exchanges.  The Brubeck Quartet's Gene Wright again lends a sturdy hand on bass. The playing is wonderful throughout, though just missing the full-throttle inspiration of Take Ten. ~ Allmusic.com\n\nOriginal Album Notes:\nIt's me, Paul Desmond, rapidly aging sax player with the Brubeck Quartet, sometimes called the John P. Marquand of the alto, and again playing hookey from the mother lode with the same group of sturdy compatriots that made TAKE TEN such a joy to record. On bass is the jovial presence of Eugene Wright, without whom the entire Brubeck operation would grind to a halt in a matter of hours. On drums, the master time-keeper of the Modern Jazz Quartet, Connie Kay -- who, if he didn't exist, would be much too perfect ever to be imagined by anyone. And on guitar, the redoubtable ( that means the first time you hear it you don't believe it, and when you hear it again later you still don't believe it ) Jim Hall. \n\nThe term bossa antigua ( it means, or at least it should, &quot;old thing,&quot; as opposed to &quot;new thing&quot; ) began as a slightly rueful play on words because by the time I got around to doing a few bossa nova tunes on TAKE TEN it was several years after the first flash from Brazil and couldn't properly be called a new thing any more. This album carries the term a step further, in that the rhythm on several tracks is a sort of skeletal bossa nova with various old-timey flavors added.  ALIANCA, for instance, has Jim Hall functioning as the only accredited Brazilian delegate, accompanied by routinely impeccable Connie Kay shtick and a nice comfortable New York 2 from Eugene Wright. A SHIP WITHOUT A SAIL and THE NIGHT HAS A THOUSAND EYES contain other variations, ranging from Early Calumet City Strip to a subliminal fraelich. ( If any of you feel creative out there, you could get together some rainy night and figure out an Old Thing dance to go along. ) \n\nThe tunes, except for SHIP and NIGHT, are mostly originals. O GATO was written by Jim Hall's friend Jane Herbert, and it's as charming as she is, which is saying a lot.  The others are tunes I wrote.  One is based on a minor adaptation of a melody indigenous to early American coffee houses, a few are extensions of themes that have been wandering through my head recently, and the one called CURACAO DOLOROSO is a sort of three-stage operation. Originally I'd wanted to do HEARTACHES, because it seemed so incongruous and because the original record of it had something of the same neolithic connection to bossa nova as early marching bands had to Gerry Mulligan.  I wrote a different set of changes for it and we tried it, and it was so horrible that George Avakian emerged from the control room in the middle of the first take, waving his arms and shuddering.  ( This is a musical milestone of sorts, since George usually smiles serenely thru the most disastrous takes imaginable, hoping that something good will somehow happen and he'll be able to splice it in later. I think the only other time he walked out in the middle of a take, the studio was on fire. )  So on a later date we used the chords and avoided the melody, which is what you're supposed to do in jazz anyhow, come to think of it, and it worked out nicely.  ( Since it's a different melody and a different set of chords, the writers of HEARTACHES won't be around looking for royalties -- but if they ever feel like dropping by for a drink, I'm usually home between 4 and 6. ) \n\nAs always, George Avakian masterminded the entire operation effortlessly, even with a telephone more or less permanently installed in one ear.  ( There was one point, I must admit, when the only way I could get his attention was to go out to the phone booth and call him. ) I don't know how the phone calls worked out, but I love the album. \n \nPersonnel:\nPaul Desmond (alto saxophone); \nJim Hall (guitar); \nEugene Wright, Gene Cherico (bass); \nConnie Kay (drums)\n\nPaul Desmond - Bossa Antigua Tracks:\n01  Bossa Antigua\n02  The Night Has a Thousand Eyes\n03  O Gato\n04  Samba Cantina\n05  Curacao Doloroso\n06  A Ship Without A Sail\n07  Alianca\n08  The Girl From East 9th Street\n09  The Night Has a Thousand Eyes (Alternate Take)\n10  Samba Cepeda\n11  O Gato (Alternate Take)\n\nThis 1999 reissue contains three bonus tracks (9-11) not on the original release.","torrent":{"xt":"urn:btih:a6618b3e2822d0645a281692cf070272556386e4","amp;dn":"Paul+Desmond+-+Bossa+Antigua+%281964%29+-+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a6618b3e2822d0645a281692cf070272556386e4","infoHashBuffer":{"type":"Buffer","data":[166,97,139,62,40,34,208,100,90,40,22,146,207,7,2,114,85,99,134,228]},"announce":[],"urlList":[]}}