{"title":"Office_2010_Installer_Channel_Switcher_1.4.3.rar","uid":7704556,"size":19658706,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:a7a7061b5f2c26e4368fbb482c71bec354352d46&amp;dn=Office_2010_Installer_Channel_Switcher_1.4.3.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"anarchist9027","files":1,"time":1349648749,"description":"What it does\nIt combines all the input files into one iso which contains all the inputed installers.\nIt can convert the activation channel of the input products from retail into volume or visa versa.\n\n\nWhat it doesn't\nIt doesn't activate/crack the products, unless you do it yourself with an unattended file.\nIt doesn't add any other crap to the installer.\n\n\nGuide\n1) Input all the installers you want. Those can be exe files or iso images. Only trusted installers should be used, with unmodded files (original Microsoft installers, Wzor select editions and installers made by this program are ok). If you use installers with modded/corrupted files, this can result in a corrupted output installer. You can also add for example two x86 Visio installers with a different language, you will then have the choice between these languages during setup. (This requires the note at the bottom of the post!)\n\n2) Choose one activation channel for all the output files, or check &quot;Use advanced options&quot;. If you didn't check &quot;Use advanced options go to step 5, otherwise proceed with step 3.\n\n3) On the Advanced options tab select the desired activation channel for all inputted products.\n\n4) If you want to add additional files or folders or want to make moddifications to the files then you can check &quot;Add additional files/folders to the installer&quot;. This option will open an explorer window in the right directory before creating the output iso image.\nNever give an already moddified input installer, if you want to make moddifications always use this option or do it afterwards.\n\n5) Specify an output file.\n\n6) Click &quot;Start channel switching&quot; and wait until you iso is created.\n\nSupported products\n- Office Professional Plus\n- Office Standard\n- Office Small Business Basics\n- Office Single Image, this is Office Home and Student, Office Home and Business and Office Professional in 1 installer. (integration only, volume versions of this product don't exist)\n- Visio\n- Project Professional\n- Project Standard\n- Access*\n- InfoPath*\n- Publisher*\n- OneNote*\n- Excel*\n- Word*\n- Powerpoint*\n- Outlook*\n- SharePoint Workspace*\n- SharePoint Designer (integration only, this product does not require any form of activation)\n\nFor all these products both x86 and x64 and all languages are supported.\n* These products are also available in the office suits like Office Professional Plus, but now also the separate versions are supported.\n\nAll Credit goes to Stannieman from MDL","torrent":{"xt":"urn:btih:a7a7061b5f2c26e4368fbb482c71bec354352d46","amp;dn":"Office_2010_Installer_Channel_Switcher_1.4.3.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a7a7061b5f2c26e4368fbb482c71bec354352d46","infoHashBuffer":{"type":"Buffer","data":[167,167,6,27,95,44,38,228,54,143,187,72,44,113,190,195,84,53,45,70]},"announce":[],"urlList":[]}}