{"title":"Mariah Carey - Mariah The Elusive Chanteuse (LDE) 2014 FLAC","uid":10249709,"size":537123903,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a891ef7e24991107e64ac6e83617cc77316f7ae7&amp;dn=Mariah+Carey+-+Mariah+The+Elusive+Chanteuse+%28LDE%29+2014+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"vtwin88cube","files":-1,"time":1401333866,"description":"Mariah Carey\nMe I Am Mariah\nThe Elusive Chanteuse\n(Limited Deluxe Edition) (2014)\n\n\n\n\n\nallmusic.com...\n\nMariah Carey's first proper album since 2009 is a couple covers away from being as nostalgic as the Glitter soundtrack. Its title -- well, the part that precedes the ellipses -- is taken from a self-portrait, reproduced on the back, drawn at the age of three and a half. &quot;I'll just sit right here and sing that good old school shit to ya,&quot; she sings on &quot;Dedicated,&quot; a song seasoned with a Wu-Tang sample, a Nas throwback verse, and reminiscent chatter. Like many other songs on the album, flashbacks are laced through the music as well as in the lyrics, with Carey reflecting upon happier moments in a relationship while either pining or scolding. The feel-good &quot;You Don't Know What to Do,&quot; one of a few songs made with Jermaine Dupri and Bryan-Michael Cox, cleverly interpolates Inner Life's 1979 disco classic &quot;I'm Caught Up (In a One Night Love Affair)&quot; and has Carey channeling the group's Jocelyn Brown throughout, especially in the intro. In sharp contrast with Memoirs of an Imperfect Angel, a set produced strictly by Carey, Tricky Stewart, and the-Dream, this involves numerous co-writers and co-producers who bring distinct material, from the dusty and dreamy feel of &quot;#Beautiful&quot; (with Miguel) to the pumping, Eddie Kendricks-sampling &quot;Meteorite&quot; (a Q-Tip co-production). Additional co-producers Hit-Boy and Mike WiLL Made-It provide up-to-date elements, while the latter half involves a couple of gospel-flavored standouts, the latter of which is an inspired tribute to the Reverend James Cleveland. The quality level is as varied as the sounds -- a quality that makes the set play out like a collection of songs that could have been edited and/or sequenced in innumerable ways. The standard edition could have done without the clumpy and jumbled &quot;Money ($ * / ...),&quot; the oddly cheap-sounding cover of George Michael's &quot;One More Try,&quot; and the stiff and empty &quot;Thirsty,&quot; all of which weigh down the hour-plus program. Carey unfortunately doesn't feel nostalgic for the succinctness of her early albums, but this shows that she's still capable of delivering 40 minutes of strong, supremely voiced R&amp;B when she's up for it. \n\n\nGenre................: R&amp;B\nSource...............: CD\nYear.................: 2014\nQuality..............: Free Lossless Audio Codec (FLAC)\nIncluded:............: Cover, Cue, Audiochecker\n\n\n\n\nTracklist:\n\n01.Cry.\n02.Faded\n03.Dedicated (Feat. Nas)\n04.#Beautiful (Feat. Miguel)\n05.Thirsty\n06.Make It Look Good\n07.You're Mine (Eternal)\n08.You Don't Know What To Do (Feat. Wale)\n09.Supernatural\n10.Meteorite\n11.Camouflage\n12.Money ($   ...) (Feat. Fabolous)\n13.One More Try\n14.Heavenly (No Ways TiredCan't Give Up Now)\n15.It's A Wrap (Feat. Mary J. Blige)\n16.Betcha Gon' Know (Feat. R. Kelly)\n17.The Art Of Letting Go\n18.America The Beautiful\n\n\n\n\nSupport The Artists.\nBuy it if you like it!\n\nThanks for Seeding\nCheers... \t","torrent":{"xt":"urn:btih:a891ef7e24991107e64ac6e83617cc77316f7ae7","amp;dn":"Mariah+Carey+-+Mariah+The+Elusive+Chanteuse+%28LDE%29+2014+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a891ef7e24991107e64ac6e83617cc77316f7ae7","infoHashBuffer":{"type":"Buffer","data":[168,145,239,126,36,153,17,7,230,74,198,232,54,23,204,119,49,111,122,231]},"announce":[],"urlList":[]}}