{"title":"Solidworks Bible 2010 with Excersize Files","uid":5966570,"size":488645370,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a91699431fa62ca68e4afcc32cf9a904f06ba554&amp;dn=Solidworks+Bible+2010+with+Excersize+Files&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"russ0943","files":669,"time":1290125244,"description":"\nThis is the pdf e-book of Solidworks Bible 2010 by Matt Lombard\n\nThe CDROM of exercise files is included.\n\nEnjoy.\n\n========================================================\nProduct Description\nThe only guide you need to learn the leading 3D solid modeler program, SolidWorks.\n\nThis in-depth guide goes into extensive detail, not just on &quot;how&quot; the software works, but in many cases &quot;why&quot; it works the way it does.\n\n    * SolidWorks is a powerful 3D solid modeling system that is popular with CAD users everywhere, but to become really proficient at the more involved functionality in SolidWorks one really needs specialized training or a comprehensive book like the SolidWorks Bible\n    * Thoroughly covers SolidWork features using real-world examples\n    * Author, Matt Lombard, is well known and well respected in the SolidWorks community and host a popular SolidWorks blog called dezignstuff \n\nGet the guidance you need to efficiently learn and master SolidWorks.\n\nNote: CD-ROM/DVD and other supplementary materials are not included as part of eBook file.\nFrom the Back Cover\nThe detail and depth you need to get the most out of SolidWorks\n\nWhether you're new to SolidWorks or want to expand your current skills, this is the SolidWorks book you need. Offering in-depth content that exceeds most other publications on the subject, this book is a complete desk reference. Well-known SolidWorks consultant Matt Lombard covers all features, explains best practices, and provides pages of step-by-step tutorials and advanced techniques that will soon have you successfully using this powerful software for your own CAD projects.\n\n    *\n\n      Understand feature- and history-based modeling, and sketching with parametrics\n    *\n\n      Create sketches, parts, assemblies, and drawings\n    *\n\n      Master the user interface, including menus, toolbars, macros, and more\n    *\n\n      Work with mold tools, plastic and sheet metal parts, and weldments\n    *\n\n      Learn advanced techniques for multibody modeling\n    *\n\n      Build animations with SolidWorks MotionManager \n\nWhat's on the CD-ROM?\nThe CD includes many examples files of drawings, parts, and assemblies. You'll also find part templates and before-and-after files that follow the tutorials in the book.\n\nSystem Requirements: See the CD Appendix in the book for details and complete system requirements.\n\n    *\n\n      Master all features, functions, and tools\n    *\n\n      Explore best practices and cautionary data\n    *\n\n      Learn specialized and advanced techniques ","torrent":{"xt":"urn:btih:a91699431fa62ca68e4afcc32cf9a904f06ba554","amp;dn":"Solidworks+Bible+2010+with+Excersize+Files","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a91699431fa62ca68e4afcc32cf9a904f06ba554","infoHashBuffer":{"type":"Buffer","data":[169,22,153,67,31,166,44,166,142,74,252,195,44,249,169,4,240,107,165,84]},"announce":[],"urlList":[]}}