{"title":"[epub] Jony Ive - The Genius Behind Apple's Greatest Products (L","uid":9212904,"size":1277158,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a988f682efac4b8b043360a926d3a57282644769&amp;dn=%5Bepub%5D+Jony+Ive+-+The+Genius+Behind+Apple%27s+Greatest+Products+%28L&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"cl1n5","files":-1,"time":1384819905,"description":"In 1997, Steve Jobs returned to Apple as CEO with the unenviable task of turning around the company he had founded. One night, Jobs discovered a scruffy British designer toiling away at AppleÎ“Ã‡Ã–s corporate headquarters, surrounded by hundreds of sketches and prototypes. It was then that Jobs realized he had found a talent who could reverse the companyÎ“Ã‡Ã–s long decline.\n\nThat young designer was Jony Ive. \n\nJony IveÎ“Ã‡Ã–s collaboration with Jobs would produce some of the worldÎ“Ã‡Ã–s most iconic technology products, including the iMac, iPod, iPad, and iPhone. The designs have not only made Apple a hugely valuable company, theyÎ“Ã‡Ã–ve overturned entire industries, built a loyal fan base, and created a globally powerful brand. Along the way, Jony Ive has become the worldÎ“Ã‡Ã–s leading technology innovator, won countless design awards, earned a place on the 2013 Time 100 list, and was even knighted for his Î“Ã‡Â£services to design and enterprise.Î“Ã‡Â¥\n\nYet despite his triumphs, little is known about the shy and soft-spoken whiz whom Jobs referred to as his Î“Ã‡Â£spiritual partnerÎ“Ã‡Â¥ at Apple. Jony Ive reveals the true story of AppleÎ“Ã‡Ã–s real innovator-in-chief.\n\nLeander Kahney, the bestselling author of Inside SteveÎ“Ã‡Ã–s Brain, offers a detailed portrait of a creative genius. He shows us how Jony Ive went from an English art school student with dyslexia to the man whose immense insights have altered the pattern of our lives. From his early interest in industrial design, fostered by his designer father, through his education at Newcastle Polytechnic and meteoric rise at Apple, we discover the principles and practices that he developed to become the designer of his generation.\n\nBased on interviews with Jony IveÎ“Ã‡Ã–s former colleagues and KahneyÎ“Ã‡Ã–s own familiarity with the world of Apple, this book gives insight into how Jony Ive (now senior vice president of design) has redefined the ways in which we work, entertain, and communicate with one another.\t","torrent":{"xt":"urn:btih:a988f682efac4b8b043360a926d3a57282644769","amp;dn":"%5Bepub%5D+Jony+Ive+-+The+Genius+Behind+Apple%27s+Greatest+Products+%28L","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a988f682efac4b8b043360a926d3a57282644769","infoHashBuffer":{"type":"Buffer","data":[169,136,246,130,239,172,75,139,4,51,96,169,38,211,165,114,130,100,71,105]},"announce":[],"urlList":[]}}