{"title":"Halo Reach Beta XBOX360 XBLOG-360DOTCOM","uid":5528812,"size":1069624322,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:aa8048d7b5b6d0275aa7866a826a41539068998d&amp;dn=Halo+Reach+Beta+XBOX360+XBLOG-360DOTCOM&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MAFIAA.","files":-1,"time":1272868421,"description":"This tutorial will teach you how to unlock the Halo: Reach beta on  your JTAG'd Xbox 360. It will allow you to run around on all maps  including two that haven't been released yet(one of which is a Firefight  map) and will also make modifying those .map files possible.\n\nRequirements:\nA JTAG'd Xbox 360 or a developement kit\nHalo:  Reach Beta (Available for download May 3rd on xbox.com)\nForceload XeX's -WxPirs - \nAuto Xbins to download XeXmenu or  Xplorer360 - \n\nOnce you have all those files, you may start. You will need to use all  of them and if you are missing one, then you can not complete this  tutorial.\n\n\nDownloading the Beta\n\n1. Get torrent\n2. Once the beta is done downloading, either put your hardrive on your  JTAG'd Xbox and boot into XeXmenu and FTP the 4D53885C folder to your  computer. Or you can connect your hardrive to your computer and open  Xplorer360. Then in Xplorer360 go to Partition  3&gt;Content&gt;00000000000&gt;4D53885C&gt;00080000&gt;725EC55D55   2A4DEDDE69466A0BA490B2CB496EF74D and extract that file to somewhere on  your computer.\n\n\nExtracting the maps, default.xex, waves, etc.\n\n1. Now open WxPirs.\n2. In the top left hand corner, click file&gt;open or click the folder  with an arrow above it button.\n3. Locate your where you saved your Halo 3 Beta to(aka the  725EC55D552A4DEDDE69466A0BA490B2CB496EF74D file). And open the file.\n4. You should now be presented with bink, maps, and waves folders and a  default.xex, WaveShell-Xbox.dll and WavesLibDLL.dll\n5. Click file&gt;extract all or click the repeating floppy disc icon in  the top left hand corner.\n6. Pick a folder to extract all of those files and folders to and wait  until they are all done(it was will say\n&quot;done&quot; next to every folder and file).\n\n\nDownloading the Forceload XeX's\n(Credit to DeToX for the XeX's and Halo: Reach modding  research)\n\n1. Download the Forceload XeX's\n2. Extract all contents of the  halo_reach_beta_forceload.rar to a folder.\n\nPutting the Beta on your Hardrive and Playing it\n\n1. Open Xplorer360 and navigate to your Partition  3&gt;Content&gt;0000000000&gt;and make a new folder called &quot;Games&quot; if  you don't already have that folder.\n2. Inside that folder make a new folder called &quot;Halo Reach Beta&quot;.\n3. Inside of the Halo Reach Beta folder, put your  reach-30_settlement.xex, reach-ff10_prototype.xex,  reach-20_sword_slayer.xex, reach-70_boneyard.xex, reach-mainmenu.xex,  WaveShell-Xbox.dll, WavesLibDLL.dll, and waves folder that you got from  the halo_reach_beta_forceload.rar. Make sure that you put EVERY file  that came in the halo_reach_beta_forceload.rar folder.\n4. Once those files are on your hardrive, go to the folder that contains  all the files and folders that you extracted using WxPirs. Take the  &quot;maps&quot; and &quot;bink&quot; folders and all of their contents and put those in  your Halo Reach Beta folder on your hardrive.\n4. Put your hardrive on your Xbox and go to Game Library&gt;XeXmenu.  Then go to Hdd1&gt;Content&gt;000000000&gt;Games&gt;Halo Reach Beta&gt;  Then click on either reach-30_settlement.xex, reach-ff10_prototype.xex,  reach-20_sword_slayer.xex, or reach-70_boneyard.xex to load whichever  one of those maps you want.\n5. Once you have clicked one of those, you should be in the main menu.  Your game will appear to freeze on a black screen. Just wait a few  seconds and then the map will load.\n6. To go to another map, repeat step 4.\n\nEnjoy! PS: The Firefight map is reach-ff10_prototype.xex and the other  unreleased map is reach-70_boneyard.xex","torrent":{"xt":"urn:btih:aa8048d7b5b6d0275aa7866a826a41539068998d","amp;dn":"Halo+Reach+Beta+XBOX360+XBLOG-360DOTCOM","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aa8048d7b5b6d0275aa7866a826a41539068998d","infoHashBuffer":{"type":"Buffer","data":[170,128,72,215,181,182,208,39,90,167,134,106,130,106,65,83,144,104,153,141]},"announce":[],"urlList":[]}}