{"title":"Bar Exam Preparation - BarBri PMBR MBE MPT MEE","uid":4933871,"size":5202447372,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:aadb86e22e5042aa4bbdc19dbcc44f0a400e0d16&amp;dn=Bar+Exam+Preparation+-+BarBri+PMBR+MBE+MPT+MEE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"x_Darkstorm_x","files":1,"time":1244157060,"description":"NOTE: for some reason, this .zip file has had some problems with WinRAR and Windows but has NO problem if opened using 7zip\n\nThis is a very thorough and comprehensive set of recycled preparation materials for persons who don't want to pay $6000 to study for the bar exam. First year students may also find this material useful when trying to learn the law instead of listening to professors pontificate on theories that won't matter when it comes time to pass their exam or practice as a lawyer.\n\nDon't buy into the high pressure sales pitch about bar prep course prices going up every year. Don't pad the pockets of professors and schools who act as pushers for companies with a stranglehold monopoly on the market because they get kickbacks. Most importantly, don't chalk up more student loans to pay for bar prep unnecessarily.\n\nAn attorney who passed the bar did so because he or she was disciplined with a rigorous study schedule and because he or she learned the material through repetition and regular testing under exam conditions, NOT because he or she attended bar prep classes that read back the outline right in front of them. The law doesn't change THAT much from year-to-year. Bar examiners are testing on general principles in relatively settled areas of law, not novel issues and controversies that some students might unfairly have or have not learned.\n\nYou CAN study at home for the bar exam. Much of this collection is compiled from separate torrent files downloaded on TPB. Materials included in this torrent:\n\n\nFleming's Multistate Examination Workbook Volume I &amp; II\n\nPMBR Multistate Early Bird MBE Q&amp;A\n\nBarBri Drills and NCBE Released Questions\n\nAnswer Sheets that you can print with multiple choice blanks\n\nBar Outlines - MBE and NY - with 60 day and 3 week study schedules\n\nLEXIS area of law outlines\n\nBarBri Outlines\n\nConviser Mini Review Outlines\n\nBarBri Audio Lectures\n\nPMBR Outlines\n\nPMBR Audio Lectures\n\nPMBR Flash Cards\n\nNew York Distinctions outlined\n\nLawDecks flashcards\n\nMicromash Reviews for the Multistate Bar Examination, Multistate Essay Examination, and Multistate Proficiency Test\n\nPeiper Mnemonics (NY Essays)\n\n\n\nSubjects covered:\n\nCivil Procedure\nCommunity Property\nConflicts of Laws\nConstitutional Law\nContracts\nContracts Remedies\nCorporations\nCriminal Law\nCriminal Procedure\nEvidence\nProfessional Responsibility\nReal Property\nTorts\nTrusts\nWills","torrent":{"xt":"urn:btih:aadb86e22e5042aa4bbdc19dbcc44f0a400e0d16","amp;dn":"Bar+Exam+Preparation+-+BarBri+PMBR+MBE+MPT+MEE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aadb86e22e5042aa4bbdc19dbcc44f0a400e0d16","infoHashBuffer":{"type":"Buffer","data":[170,219,134,226,46,80,66,170,75,189,193,157,188,196,79,10,64,14,13,22]},"announce":[],"urlList":[]}}