{"title":"Unity 5 Beta 9 Win x64","uid":11271657,"size":1591291495,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:ab1f2a26b52116ce5b529173de4f48e924dd7d02&amp;dn=Unity+5+Beta+9+Win+x64&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ihatethisrecaptcha","files":2,"time":1414088237,"description":"Unity 5.0 Beta 9\n\nFeature\n\n\t* Android: Support for x86 as a build target.\n\t* Android: Fat binary support (x86+ARMv7).\n\nChange\n\n\t* Editor always runs in background when a debugger is attached. \n\t* Players always run in background when &quot;Script Debugging&quot; is enabled.\n\nImprovement\n\n\t* Android: Support for profiling Intel GPU using the Unity Editor.\n\t* Android: Added support for BGRA textures.\n\t* Graphics: Dynamic batching can batch non-uniform scaled objects together when normals/tangents are unused. Helps with shadow caster batching, and unlit shaders.\n\t* Asset Importing: Faster texture conversion into cubemaps &amp; HDR image processing, by multithreading parts of the process.\n\t* Shadows: Added PCF (5x5) filtering for soft directional light shadows.\n\t* \n\t\t* Pick it in Quality Settings.\n\t\t* We're considering maybe replacing the old &quot;screenspace blur&quot; with 5x5 PCF as the only built-in option, so feedback is welcome!\n\n\nFixes\n\n\t* Android: Compensate for polygonOffset bug on Mali 400 GPU.\n\t* TouchInput: Switched timestamps from ms to us internally, to avoid 0-length delta times.\n\t* Android: Avoid reading expensive metrics in DisplayInfo more than once per frame.\n\t* Android: Fixed frame rate on Tegra devices when doing GPU profiling.\n\t* Android: Fixed crash on Xperia Play.\n\t* Android: Disabled shadows for Intel PowerVR devices to avoid graphics artifacts.\n\t* Android: Dropped support for OpenGL ES 3 auto selection for devices running Android 4.1 and 4.2.\n\t* Android: Fixed some old devices that crashed when target graphics API was set to &quot;Auto&quot;.\n\t* Graphics: Fixed occasional crash on creating and immediately deleting particle renderer.\n\t* Graphics: Fixed crashes on toggling Direct3D 11 mode.\n\t* Graphics: Fixed linear lighting mode being preserved but not editable when opening Pro project in the free version of Unity.\n\t* Editor: Empty animation window no longer increases CPU usage\n\t* Editor: Fixed: Error thrown when closing asset label list with escape key\n\t* Editor: Fix keyboard shortcuts (home/end/page up/page down) in object selector\n\t* Version Control: Revert recursively.\n\t* Version Control: Auto connect when connection is dropped\n\t* Version Control: Fix plugin stop when reading a recent deleted file\n\t* Version Control: Fix case handling on windows when downloading files\n\t* Version Control: Remove out-of-sync state when file is deleted on server\n\t* Version Control: Do not print a warning when saving scene and file is not opened for edit unless necessary\n\t* VFS: Fix double slashes when enumerating directories on mac and posix\n\t* Editor: Opening multiple locked inspectors works\n\t* Editor: Select Dependencies operation no longer breaks editor fonts\n\t* Editor: Tooltips use current skin instead always using light skin\n\t* Editor: Fix errors thrown when pressing Esc to close asset label popup\n\t* Editor: Fix navigation keyboard shortcuts in object selector\n\t* Editor: Ensure screen width and height in player settings is at least 1\n\nKnown issues\n\n\t* Android: No Runtime GI support on x86 devices.\n\nUpgrade guide\n\nThe following are changes and fixes to 5.0 features and regressions...\n\nImprovement\n\n\t* GI: Added ability to adjust how much processing power (CPU only) is allocated to realtime GI. Exposed in Editor UI.\n\t* AudioMixer: Auto dock AudioMixer window together with project browser and use vertical layout by default\n\nFixes\n\n\t* Shaders: Fixed scene load time regressions in Editor, due to excessive shader compilation.\n\t* Scene View: Fixed garbage background when legacy deferred &amp; shadows are used\n\t* Shaders: Fixed crash in shader loading code when not meeting GPU requirements.\n\t* Editor: Double click on GO in scene view now frames selected\n\t* Editor: Fix Hierarchy custom sorting broke in beta8\n\t* Editor: Warn when deleting prefab child GO's\n\t* Editor: Double click on GO in scene view now frames selected again","torrent":{"xt":"urn:btih:ab1f2a26b52116ce5b529173de4f48e924dd7d02","amp;dn":"Unity+5+Beta+9+Win+x64","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab1f2a26b52116ce5b529173de4f48e924dd7d02","infoHashBuffer":{"type":"Buffer","data":[171,31,42,38,181,33,22,206,91,82,145,115,222,79,72,233,36,221,125,2]},"announce":[],"urlList":[]}}