{"title":"Rich Mullins - Unconditional Access [2009][mp3@128]","uid":5438954,"size":72185620,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ab369d3a1d98b9e70381129e9b4e63abe3b450d1&amp;dn=Rich+Mullins+-+Unconditional+Access+%5B2009%5D%5Bmp3%40128%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"verifire","files":-1,"time":1268820501,"description":"Hi there..\n\n\nIt's been a while since I've made an upload, and the reason is I've been occupied in the co-work of getting a new site up for all those that hunger and need fellowship in their Christian life, or are interested in finding out what Christianity really is. And I mean true Christianity, not some &quot;DenomiNational&quot; mock-up and blasphemy.\n\nIn there, on that site, the ones with the most stars are the humblest servants, and those who want are given the equal and unique opportunity to tell their story, make bonds, ask for help, post and discuss, download Christian material..\n\nIt's your site for the taking and free use, or borrowing, as we like to look at it, no ratio watch etc. Do you want it? Then go to:\n &lt;a href=&quot;\nhttp://www.blazefire.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.blazefire.org&lt;/a&gt;\n\nNow about this upload; it is a GREAT compilation I have made from diverse albums by the late, as said, great, but underestimated artists, that you sing the songs of, never realising who wrote it to begin with. His songs have been covered and sung by artists on CDs, and been sung in very many churches. This is really good.\nYou miss out if you don't hear this..\n\nWell back to the site I'm promoting right now. :-)\n\nYou'll be met with the info you need to request an invite, and an invite will come, as soon as someone is awake and get your mail.\n\nAfter a while, the invites will be set to open, but until a good members base is established, we keep it small and safe for all those that's been hurt or otherwise need to find a safe place to grow and be appreciated.\n\nAnd all you have to do to get invited and become a member, is ask. :-)\n\nThe place will remain safe and a good place to be and hang out. That's why this vision of it emerged between myself and some other people I've met through the Internet in the first place.\n\nAnd we have NEVER asked each other what &quot;church&quot; we go to or not. We just have a great fellowship and actually love one another.\n\nYou're welcome to join us..\n\nLove, as always,\n\nVerifire\n","torrent":{"xt":"urn:btih:ab369d3a1d98b9e70381129e9b4e63abe3b450d1","amp;dn":"Rich+Mullins+-+Unconditional+Access+%5B2009%5D%5Bmp3%40128%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab369d3a1d98b9e70381129e9b4e63abe3b450d1","infoHashBuffer":{"type":"Buffer","data":[171,54,157,58,29,152,185,231,3,129,18,158,155,78,99,171,227,180,80,209]},"announce":[],"urlList":[]}}