{"title":"Hell, Whores &amp; High Heels (DVD.xvid) - anal, DP, fetish","uid":4676847,"size":736712704,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:ab86b2ca264ee6dae368bae1b501a57841051f38&amp;dn=Hell%2C+Whores+%26+High+Heels+%28DVD.xvid%29+-+anal%2C+DP%2C+fetish&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pure_screens","files":1,"time":1232927788,"description":"Hell, Whores &amp; High Heels (DVDrip.xvid)\n\n\n\n\n\n\nall 5 screens (+ extras + DVD-covers):\n &lt;a href=&quot;\nhttp://aaa.blogbugs.org/6024361/Hell-Whores-High-Heels---screens.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://aaa.blogbugs.org/6024361/Hell-Whores-High-Heels---screens.html&lt;/a&gt;\n\n\n\n\n\n\n\nActresses\n\n    * Anita Black              [Facial]\n    * Georgette Neale           [Anal Facial]\n    * Layla-Jade                 [Anal Facial DP]\n    * Lora                        [Facial]\n    * Monique Covet                [Anal Facial]\n    * Nataly Dune                   [Anal Facial]\n    * Violet Storm                   [BJOnly Facial]\n\n   \nScene Breakdowns\n\n    * Scene 1. Guy, Lora, Violet Storm\n    * Scene 2. 2 Guys, Georgette Neale, Layla-Jade, Nataly Dune, Tony De Sergio\n    * Scene 3. Anita Black, Guy, Monique Covet, Nataly Dune\n    * Scene 4. 4 Guys, Georgette Neale, Monique Covet, Nataly Dune\n    * Scene 5. Anita Black, Guy, Monique Covet, Violet Storm\n\n\n\nStudio: Private\nAKA:  Pirate Deluxe 10: Hell, Whores And High Heels\nDirector: Tanya Hyde\nReleased: 2000\nFormat:  Xvid\n\n\n\nREVIEW:\n\nOverall Impression\nThere is a reason Tanya Hyde is called the &quot;Queen of Kink&quot;, and this DVD is the strongest piece of evidence to support her claim to fetish royalty. She has made several films now for Private's Pirate Video Deluxe line and this is certainly her best work.\n\nHyde draws many of her influences from London's underground fetish scene, so some of the film may be a bit of an acquired taste. However, I would suggest that for the most part Hyde is mainly incorporating fetish styles and themes, rather than delivering serious S&amp;M or Domination. Besides the outfits and sets, and themes it is fairly mainstream pornography. What makes it great is the perverted twist Tanya always seems to bring to it.\n\nThe cast is consists of a number of relative unknowns, with the exception of one of Hyde's favorites Monique Covet. I have know idea where she found these girls but I am willing to bet she plucked them right out of London's sexual underground, because these women of the world seem so at home in this film. You may have noticed that I have given 4&amp;1/2 stars for Female performer's looks. Some might think that too high, but I came very close to five. Most of these women are not your classic beauties, like the kind you would find in an Andrew Blake film, but they all exhibit that &quot;it&quot; quality in this film. You know what I mean, there is a magnetism in their eyes, sexual heat rising of their bodies, and it seems as if sex is dripping from their lips. Let me put it this way I have seen better looking woman, but I want to fuck these women ten times more. I would give these girls a six star sex rating if I could because these girls have no inhibitions.\n\nBasically this is a very original piece of pornography, if you have not seen one of her movies before then you haven't seen anything quite like it. So if you like latex, vinyl, and pvc outfits, mixed with some creative role play, plus a very light dose of bondage and other fetishs, this is a must.\n\nNOTE: Hyde does like to play with camera effects, and at times I have found it distracts from the heat of the sex. Personally I think it generally enhances the film in this particular title. Four of the five scenes are widescreen. I am not sure of the exact ratios, but it seems to me they are a little inconsistent from scene to scene. I applaud her for going widscreen, but if you are going to do it, be consistent throughout.\n\nScene 1 &quot;Harlots From Hell&quot; \nViolet Storm &amp; Lora\n\nThis first scene gets the kink level right up there in a hurry. The scene starts of with Violet Storm &amp; some guy playing pool, they are both dressed like some kind of devils. They both have fun playing with Storm's piercing (rings) with a pool que. She proceeds to blow him, until an angel (Lora) appears. The camera follows her up the stairs, giving us an amazing view of this angelic ass. We see her pleasuring herself in the bathroom with a dildo , until she is interrupted by Violet. I won't go into every detail, but the guy shows to complete a threesome that involves a swing, a bench with a mechanical dildo, and a dildo attached to the end of a staff the length of a broom stick. After several positions are explored the scene ends with the two ladies sucking him of till completion. He gives them a facial pop shot, after which they continue to kiss and begin to rub eachother's breasts against eachother. This scene is 15min, widscreen, and is absolutely amazing.\n\nScene 2 &quot;The Sub, The Dom and The Sodomized&quot; \nNataly Dune, Georgette &amp; Layla Jade\n\nNataly Dune starts a two on one in a cage, until the action moves on to some kind of a turntable. Then Georgette rides in on a carriage being pulled by some guy who is immediately treated to a bj by the third lady in the scene Layla. The rest of the scene is filled with lots of fun stuff. Between the six performers (3m/3f) there are tons of positions, deepthroating, lots of anals, DPs, and 69's. The Scene ends with all the girls getting facials. This scene is 15&amp;1/2min, widscreen, and gets very kinky.\n\nScene 3 &quot;The Pervert, His Penis and The Puppets&quot; \nMonique Covet Anita Black &amp; Nataly Dune\n\nThe idea hear seems to be that the girls are his puppets and he is controlling them. The sex starts of with Covet and dark in some great girl/girl action i.e. 69, strap-ons. Once Nataly shows up her and the puppet master engage in some scorching sex, as the other two masturbate. Nataly is really good here as she gets pounded in several positions, cowgirl, reverse cowgirl, spoon, and finally anal dogie. The scene continues with what is essentially two one on one scenes cut together. Covet looks great here even with the ridiculous make-up, and delivers a nice anal performance. The scene ends with the three girls ready for their facials. This scene is widescreen, 15min.\n\nScene 4 &quot;Medical Madness&quot; \nNataly Dune, Georgette &amp; Monique Covet\n\nNataly Dune gets this segment started. She is wearing a white latex nurses outfit that is just dead sexy. First she entertains us and her patient with a little masturbation, then proceeds to get up on her patients bed, and blow him. Once he starts feeling better she moves to a 69 position then ,reverse cowgirl, dogie, and anal doggie. It should be noted here just how great a performer Dune is. She is one of the most enthused pornstars I have seen, and has the most wonderful facial expressions during sex, plus one hell of a fit body, with a spectacular ass. Anyway this scene is still far from over as Covet wheels in another patient, or should I say victim. Covet looks like a latex clad caped superhero, sporting sunglasses. First we see her go at it with a mounted pink dildo, until she goes at it with the new guy sitting in the wheelchair. They go through a few positions: bj, reverse cowgirl, missionary, anal dogie, and keeping her sunglasses on the whole time. Next Georgette enters the scene. Covet probes, her with some toys, until the men get involved. The scene eventually winds down with Dune and Georgette in the 69 position, but each being fucked. This leads to an unbelievable cum shot on to Dune's pussy, that drips down onto Georgette, who then licks away. This scene is standard size, 20&amp;1/2 min, and is just so jam packed with sex and female eye candy I still can't believe it.\n\nScene 5 &quot;Interrogation Time&quot; \nMonique Covet, Violet Storm &amp; Anita Black\n\nWARNING: As in most Hyde films there is one scene where a man gets penetrated by a dildo, and this is that scene. I have to admit the first time I saw this it freaked me out a little, but several hyde films later I found this scene to be an total turn-on. While Hyde has certainly saved the kinkiest for last. Three girls (Covet, Storm, &amp; Anita) are interrogating a prisoner. I am not going to go into all the details of this one so that you can experience it for yourself. I will say that Covet's outfit (the same one she is wearing on the boxcover) really did it for me. This is probably Tanay Hyde's single best piece of kink I have ever seen. This scene is widescreen (but seemingly not as wide as traditional widescreen), 15min, and features superb performances from Covet and Storm.\n\n\nFinal Thoughts:\n\nLike most of Hyde's films this one is a fetish masterpiece. I have seen other films with sexy latex outfits on great looking ladies, but Hyde manages the present them in a more convincing context. I think it is also fair to point out that this film captures some extremely well shot anal action. \n\n\n\n\n\n\n\n\n\n.\n\n","torrent":{"xt":"urn:btih:ab86b2ca264ee6dae368bae1b501a57841051f38","amp;dn":"Hell%2C+Whores+%26+High+Heels+%28DVD.xvid%29+-+anal%2C+DP%2C+fetish","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab86b2ca264ee6dae368bae1b501a57841051f38","infoHashBuffer":{"type":"Buffer","data":[171,134,178,202,38,78,230,218,227,104,186,225,181,1,165,120,65,5,31,56]},"announce":[],"urlList":[]}}