{"title":"UNKLE - Psyence Fiction (2003) [FLAC]","uid":4462829,"size":424906932,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ac14a182e240be581cf08be2407b980765cb8dab&amp;dn=UNKLE+-+Psyence+Fiction+%282003%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"dredawg","files":25,"time":1224784149,"description":"UNKLE\nPsyence Fiction\nRelease Date Sep 29, 1998\nMo&amp;#039; Wax (MW085CDX/541040-2)\n\n-------------\nTrack Listing\n-------------\n\n01 Intro (Guns Blazing (Drums Of Death, Pt. 1) ... 5:04\n02 Unkle (Main Title Theme) ... 3:26\n03 Bloodstain ... 5:58\n04 Unreal ... 5:10\n05 Lonely Soul ... 8:55\n06 Getting Ahead In The Lucrative Field Of Artist Management ... 0:56\n07 Nursery Rhyme ... 4:47\n08 Celestial Annihilation ... 4:47\n09 The Knock (Guns Blazing (Drums Of Death, Pt. 2) ... 3:59\n10 Chads ... 4:43\n11 Rabbit In Your Headlight ... 6:19\n12 Outro (Mandatory) ... 1:07\n13 Be There ... 5.16\n\n-----------\nArtist Info\n-----------\n\n(http://www.allmusic.com ; by Sean Cooper)\nExperimental hip-hop outfit UNKLE was one of the original artists releasing material through noted U.K. label Mo&amp;#039; Wax, which helped launch the instrumental mid-&amp;#039;90s downtempo breakbeat revival eventually termed trip-hop. Though hardly the label&amp;#039;s highest profile group (at least until the long-delayed release of their debut LP in 1998), UNKLE numbered among its members label-head James Lavelle, who formed Mo&amp;#039; Wax while still in his teens as an antidote to the increasingly stale acid jazz/Northern soul scene. Stripping the music down to its barest of essentials -- bass, percussion, minimal samples, and heavy effects -- the Mo&amp;#039; Wax sound (best exemplified by the second Mo&amp;#039; Wax label comp, Headz, as well as its sequel, the two-part Headz II) quickly gained respectability and a large audience. Although not as prolific as other Mo&amp;#039; Wax artists such as DJs Shadow and Krush, Lavelle&amp;#039;s group nonetheless played a crucial role in cementing Mo&amp;#039; Wax&amp;#039;s early sound though their Time Has Come double EP, the latter of which featured remixes of the title track by Plaid, Portishead, and U2 producer Howie B.\n\nThe group comprised the trio of Lavelle, Tim Goldsworthy -- a mate of Lavelle&amp;#039;s since childhood -- and producer Kudo, of seminal Japanese label Major Force (and a member of the on-again, off-again psychedelic beat crew Skylab). Previous to his entrÃƒÂ©e into production, Lavelle along with Goldsworthy was deep into New York hip-hop and electro, the emerging late-&amp;#039;80s Sheffield bleep scene, the English acid jazz scene (which he covered as a columnist for Straight No Chaser magazine), and of course the acid house and techno explosions that were redefining the English counterculture at the time. The pair hooked up with third member Kudo through the growing rep of the latter&amp;#039;s Love T.K.O. project, whose outbound interpretations of breakbeat and acid jazz drew Lavelle&amp;#039;s ear. While Goldsworthy and Kudo remained more heavily involved in nuts &amp;#039;n&amp;#039; bolts production (especially given the success of Mo&amp;#039; Wax, with the penning on an expansive partial ownership deal with A&amp;M Records in 1996), Lavelle is heavily involved in the conceptual and organizational end, crafting beats and laying out vague sketches his partners then expand into full-blown tracks. Despite the scarcity of released material, UNKLE grew to wider acclaim during 1996 through remix projects for Jon Spencer Blues Explosion and Tortoise. After Goldsworthy and Kudo were effectively replaced by Mo&amp;#039; Wax bill-payer DJ Shadow, the all-star LP Psyence Fiction finally appeared in 1998. It was a disappointment considering the advance hype, and DJ Shadow distanced himself from the collective. Lavelle, amidst much work as a DJ, recruited singer/songwriter Richard File for the second UNKLE full-length, 2003&amp;#039;s Never, Never, Land.  \n\n----------\nAlbum Info\n----------\n\n(http://www.allmusic.com ; by Stephen Thomas Erlewine)\nJames Lavelle and DJ Shadow are unequal partners in UNKLE, with the former providing the concept and the latter providing music, which naturally overshadows the concept, since the only clear concept -- apart from futuristic sound effects, video-game samples, and merging trip-hop with rock -- is collaborating with a variety of musicians, from superstars to cult favorites Kool G Rap, Alice Temple, and Mark Hollis (who provides uncredited piano on &quot;Chaos&quot;). Since Shadow&amp;#039;s prime gift is for instrumentals, the prospect of him collaborating with vocalists is more intriguing than enticing, and Psyence Fiction is appropriately divided between brilliance and failed experiments. Shadow and Lavelle aren&amp;#039;t breaking new territory here -- beneath the harder rock edge, full-fledged songs, and occasional melodicism, the album stays on the course Endtroducing... set. Shadow isn&amp;#039;t given room to run wild with his soundscapes, and only a couple of cuts, such as the explosive opener, &quot;Guns Blazing,&quot; equal the sonic collages of his debut. Initially, that may be a disappointment, but UNKLE gains momentum on repeated listens. Portions of the record still sound a little awkward -- Mike D&amp;#039;s contribution suffers primarily from recycled Hello Nasty rhyme schemes -- yet those moments are overshadowed by Shadow&amp;#039;s imagination and unpredictable highlights, such as Temple&amp;#039;s chilly &quot;Bloodstain&quot; or Badly Drawn Boy&amp;#039;s claustrophobic &quot;Nursery Rhyme,&quot; as well as the masterstrokes fronted by Richard Ashcroft (a sweeping, neo-symphonic &quot;Lonely Soul&quot;) and Thom Yorke (the moody &quot;Rabbit in Your Headlights&quot;). These moments might not add up to an overpowering record, but in some ways Psyence Fiction is something better -- a superstar project that doesn&amp;#039;t play it safe and actually has its share of rich, rewarding music. \n\n--------\nRip Info\n--------\n\nCd - Eac (V0.95 prebeta 5) -&gt; Wave - Flac Frondent (1.7.1) -&gt; FLAC.\nBecause of Sync Error on the last track, Overread into Lead-In and Lead-Out : NO.","torrent":{"xt":"urn:btih:ac14a182e240be581cf08be2407b980765cb8dab","amp;dn":"UNKLE+-+Psyence+Fiction+%282003%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac14a182e240be581cf08be2407b980765cb8dab","infoHashBuffer":{"type":"Buffer","data":[172,20,161,130,226,64,190,88,28,240,139,226,64,123,152,7,101,203,141,171]},"announce":[],"urlList":[]}}