{"title":"[Nikki_McWatters]Sex Crimes (azw, epub, lrf, mobi ){Zzzzz}","uid":11070956,"size":1450468,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ac82bce536532123a61c98b8399d8189f317f689&amp;dn=%5BNikki_McWatters%5DSex+Crimes+%28azw%2C+epub%2C+lrf%2C+mobi+%29%7BZzzzz%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zombie_rox","files":5,"time":1411265595,"description":"An explosive tale based on a true story about a damaged teenage girl and a rock-star. When fifteen year old Libby O'Neil announces she is pregnant it is a catalyst for some devastating changes in many people's lives. Her claim that she was raped by rock-star, Chris Bergin makes headlines around the world. The singer remembers little from his last night of tour, an orgy of sex and drugs and watches as his family and reputation are shattered. But as the sordid tale plays out in front of the court and world media, an uncomfortable and horrifying truth is uncovered. Who is the real victim?\n\nEugenius Publishing | English | August 29, 2013 | ASIN: B00EVXKKSO | 265 pages | azw, epub, lrf, mobi | 1,3 mb\n\nMore About the Author\n\nBiography\nNikki is an Australian-based writer who lives with her family north of Sydney, near the beach. She was shortlisted for a Queensland Premier's Literary Award for Emerging Writer\n\nin 2010. Her memoir, 'One Way or Another, the story of a girl who loved rock stars' was released by Black Inc in 2012. The sequel 'Sex and the Suburbs' was released on Amazon\n\nin 2013. Her novel, Sex Crimes, loosely based on real events, was also released in 2013 on Amazon. She has a young adult novel being published under a pseudonym in 2014.\n\nNikki writes for the UK Huffington Post, the Sydney Morning Herald and online magazines such as The Hoopla, mamamia and ivillage and was selected to have her fiction piece 'James Franco's Smile' included in the prestigious annual fiction edition of The Big Issue.\n\nNikki is a former actor who now writes full-time.\n","torrent":{"xt":"urn:btih:ac82bce536532123a61c98b8399d8189f317f689","amp;dn":"%5BNikki_McWatters%5DSex+Crimes+%28azw%2C+epub%2C+lrf%2C+mobi+%29%7BZzzzz%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac82bce536532123a61c98b8399d8189f317f689","infoHashBuffer":{"type":"Buffer","data":[172,130,188,229,54,83,33,35,166,28,152,184,57,157,129,137,243,23,246,137]},"announce":[],"urlList":[]}}