{"title":"DC Finding the Fallen 1of5 Ypres 1914 The First Trench XviD AC3 ","uid":7989997,"size":823818240,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:afbc01b0ff671a2422a290274cd1b9e09cc1ffba&amp;dn=DC+Finding+the+Fallen+1of5+Ypres+1914+The+First+Trench+XviD+AC3+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MVGroup","files":1,"time":1357392113,"description":"Finding the Fallen\n\nWar Documentary hosted by Julian Richings, published by Discovery Channel in 2005 - English narration\n\nFinding-the-Fallen-Cover.jpg\n\nInformation\n------------------------------\n\nAt the end of the Great War, nearly two million soldiers were missing, presumed dead. Almost 90 years later, the bloody battlegrounds of France and Belgium are surrendering their secrets. Beneath the farmlands lie the unknown and the unclaimed dead... This series follows the dedicated team of archaeologists, forensic experts and historians known as No Man's Land as they seek to find, recover and identify the fallen of the Great War. Each episode in this complete five-part Discovery Channel series focuses in riveting detail on one archaeological dig at the site of a single significant battle of the Great War.\nFrom the Belgian town of Ypres - where the team discover evidence of the very first trenches of the conflict - to the infamous German stronghold at Serre in Northern France, join the fascinating search using the latest battlefield archaeology and forensic techniques to recover and piece together the identity of those lost in the maelstrom of a long ago war. Other battlefields visited are Loos, the site of a hellish underground battle in 1915, Beaumont Hamel on the Somme and Passchendaele, where in 1917 the battlefield was transformed into a vast sea of liquid mud that swallowed up so many lives... A team of archaeologists, historians and forensic experts is working to identify unknown soldiers and finally lay them to rest. Finding The Fallen is a documentary series that follows the work of this team as they move through time and across the battlefields of France and Belgium, releasing the fallen and their stories of courage and sacrifice from the mud of the First World War battles in which they fought and died.\n\n\n1)  Ypres 1914 -The First Trench \nBeneath the farmland of Northern Belgium lie graveyards, the final resting place of the fallen of the First World War. At Ypres, our team excavate the past, a shovelful at a time, to preserve the memories of the shattered lives that ended here. They discover evidence of the first trenches of The Great War-mere scrapes of earth that would evolve into complex lines of trenches that if placed in a single line would encircle the Earth. In the process they unearth the partial remains of three German soldiers from the 213 Reserve Regiment, who fought and died here. Retracing on foot and by train the very steps these soldiers took in the Autumn of 1914, members of the team uncover a massacre of civilians in a small Belgian town.\n\n\nScreenshots\n------------------------------\nFinding-the-Fallen-Screen0.jpg Finding-the-Fallen-Screen1.jpg Finding-the-Fallen-Screen2.jpg Finding-the-Fallen-Screen3.jpg Finding-the-Fallen-Screen4.jpg Finding-the-Fallen-Screen5.jpg Finding-the-Fallen-Screen6.jpg Finding-the-Fallen-Screen7.jpg Finding-the-Fallen-Screen8.jpg Finding-the-Fallen-Screen9.jpg Finding-the-Fallen-Screen10.jpg Finding-the-Fallen-Screen11.jpg Finding-the-Fallen-Screen12.jpg Finding-the-Fallen-Screen13.jpg Finding-the-Fallen-Screen14.jpg Finding-the-Fallen-Screen15.jpg \n\nTechnical Specs\n------------------------------\n\nVideo Codec: XviD ISO MPEG-4\nVideo Bitrate: 2081 kbps\nVideo Resolution: 704x464\nVideo Aspect Ratio: 1.517:1\nFrames Per Second: 25.000\nAudio Codec: 0x2000 (Dolby AC3) AC3\nAudio Bitrate: 256kb/s CBR 48000 Hz\nAudio Streams: 2\nAudio Languages: english\nRunTime Per Part: 46:47.520\nNumber Of Parts: 5\nPart Size: 785 MB\nRipped by: DocFreak08\n\n\n","torrent":{"xt":"urn:btih:afbc01b0ff671a2422a290274cd1b9e09cc1ffba","amp;dn":"DC+Finding+the+Fallen+1of5+Ypres+1914+The+First+Trench+XviD+AC3+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"afbc01b0ff671a2422a290274cd1b9e09cc1ffba","infoHashBuffer":{"type":"Buffer","data":[175,188,1,176,255,103,26,36,34,162,144,39,76,209,185,224,156,193,255,186]},"announce":[],"urlList":[]}}