{"title":"The Five Vampire Bibles (Scanned and Original PDF)","uid":15417582,"size":141849633,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b0f184a15464814b7002a499844c148d362dca9c&amp;dn=The+Five+Vampire+Bibles+%28Scanned+and+Original+PDF%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"nantiayonti666","files":15,"time":1469600271,"description":"The Five Vampire Bibles (Scanned and Original PDF)\r\n\r\nWith the five vampiric bibles you have the authentic Teachings of true Vampirism. The Vampire is the next step in human evolution. If you are ready, the Temple is here to empower you. READ AND LEARN !!! This is the Path of Immortality.\r\n\r\n1 - The Vampire Bible\r\nThe essential Nightside practices of the Vampire religion to include the secrets of Vampirism to draw Lifeforce from human beings, why Vampires never harm others and are barred from criminal acts, how to perform the ancient rites of the Calling of the Undead Gods in magical ritual, and more. \r\n\r\n2 - The Vampire Predator Bible\r\nThe advanced Nightside Vampiric techniques of Sealing, Extending and Seizing the Astral are taught. Additionally, the highly practical Dayside instruction in the Use of Reason in Vampirism as well as detailed information regarding the creation and mastery of the Vampiric Will. \r\n\r\n3 - The Vampire Priesthood Bible\r\nThe Nightside Teaching of Opening the Astral Gate for out-of-body experience, and the use of the Necromanteion, an ancient passage to Communion. For the Dayside, a careful examination of the Vampiric God and Vampiric Philosophy. \r\n\r\n4 - The Vampire Sorcery Bible\r\nThe Nine Laws of Magic are explained with examples for application. These Teachings can be viewed either as an application of the Nightside Vampiric cosmology or a treatise on the manipulation of human psychology.\r\n\r\n5 - The Vampire Adept Bible\r\nThis Capstone of the Vampiric Teachings focuses on a detailed explanation of The Four-Dimensional Model of All Possible Worlds. By revealing the hidden symbol map of the truncated Great Pyramid, the Grand Trapezohedron, the Vampire can recognize the full achievement of the Fifth Circle as a Vampire Master Adept.\r\n\r\nTat Tvam Asi","torrent":{"xt":"urn:btih:b0f184a15464814b7002a499844c148d362dca9c","amp;dn":"The+Five+Vampire+Bibles+%28Scanned+and+Original+PDF%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b0f184a15464814b7002a499844c148d362dca9c","infoHashBuffer":{"type":"Buffer","data":[176,241,132,161,84,100,129,75,112,2,164,153,132,76,20,141,54,45,202,156]},"announce":[],"urlList":[]}}