{"title":"(1978) Van Halen - Van Halen [VinylRip 24-192] {100.XY}","uid":10121194,"size":1522747696,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b17bde9ddc7a934e04585389c221d77585403133&amp;dn=%281978%29+Van+Halen+-+Van+Halen+%5BVinylRip+24-192%5D+%7B100.XY%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"100.XY","files":-1,"time":1399676263,"description":"(1978) Van Halen - Van Halen\n\n\n\nReview:\nAmong revolutionary rock albums, Van Halen's debut often gets short shrift. Although it altered perceptions of what the guitar could do, it is not spoken of in the same reverential tones as Are You Experienced? and although it set the template for how rock &amp; roll sounded for the next decade or more, it isn't seen as an epochal generational shift, like Led Zeppelin, The Ramones, The Rolling Stones, or Never Mind the Bollocks Here's the Sex Pistols, which was released just the year before. But make no mistake, Van Halen is as monumental, as seismic as those records, but part of the reason it's never given the same due is that there's no pretension, nothing self-conscious about it. In the best sense, it is an artless record, in the sense that it doesn't seem contrived, but it's also a great work of art because it's an effortless, guileless expression of what the band is all about, and what it would continue to be over the years. The band did get better, tighter, over the years -- peaking with their sleek masterpiece 1984, where there was no fat, nothing untidy -- but everything was in place here, from the robotic pulse of Michael Anthony and Alex Van Halen, to the gonzo shtick of David Lee Roth to the astonishing guitar of Eddie Van Halen. There may have been antecedents to this sound -- perhaps you could trace Diamond Dave's shuck-n-jive to Black Oak Arkansas' Jim Dandy, the slippery blues-less riffs hearken back to Aerosmith -- but Van Halen, to this day, sounds utterly unprecedented, as if it was a dispatch from a distant star. Some of the history behind the record has become rock lore: Eddie may have slowed down Cream records to a crawl to learn how Clapton played &quot;Crossroads&quot; -- the very stuff legends are made of -- but it's hard to hear Clapton here. It's hard to hear anybody else really, even with the traces of their influences, or the cover of &quot;You Really Got Me,&quot; which doesn't seem as if it were chosen because of any great love of the Kinks, but rather because that riff got the crowd going. And that's true of all 11 songs here: they're songs designed to get a rise out of the audience, designed to get them to have a good time, and the album still crackles with energy because of it.\nSheer visceral force is one thing, but originality is another, and the still-amazing thing about Van Halen is how it sounds like it has no fathers. Plenty other bands followed this template in the '80s, but like all great originals Van Halen doesn't seem to belong to the past and it still sounds like little else, despite generations of copycats. Listen to how &quot;Runnin' with the Devil&quot; opens the record with its mammoth, confident riff and realize that there was no other band that sounded this way -- maybe Montrose or Kiss were this far removed from the blues, but they didn't have the down-and-dirty hedonistic vibe that Van Halen did; Aerosmith certainly had that, but they were fueled by blooze and boogie, concepts that seem alien here. Everything about Van Halen is oversized: the rhythms are primal, often simple, but that gives Dave and Eddie room to run wild, and they do. They are larger than life, whether it's Dave strutting, slyly spinning dirty jokes and come-ons, or Eddie throwing out mind-melting guitar riffs with a smile. And of course, this record belongs to Eddie, just like the band's very name does. There was nothing, nothing like his furious flurry of notes on his solos, showcased on &quot;Eruption,&quot; a startling fanfare for his gifts. He makes sounds that were unimagined before this album, and they still sound nearly inconceivable. But, at least at this point, these songs were never vehicles for Van Halen's playing; they were true blue, bone-crunching rockers, not just great riffs but full-fledged anthems, like &quot;Jamie's Cryin',&quot; &quot;Atomic Punk,&quot; and &quot;Ain't Talkin' Bout Love,&quot; songs that changed rock &amp; roll and still are monolithic slabs of rock to this day. They still sound vital, surprising, and ultimately fun -- and really revolutionary, because no other band rocked like this before Van Halen, and it's still a giddy thrill to hear them discover a new way to rock on this stellar, seminal debut.\nReview by Stephen Thomas Erlewine\nRate 5 stars\n\nimage\n\n\n\nTrack List:\nA1 Runnin' With The Devil 3:32\nA2 Eruption 1:42\nA3 You Really Got Me 2:37\nA4 Ain't Talkin' 'Bout Love 3:47\nA5 I'm The One 3:44\nB1 Jamie's Cryin' 3:30\nB2 Atomic Punk 3:00\nB3 Feel Your Love Tonight 3:40\nB4 Little Dreamer 3:22\nB5 Ice Cream Man 3:18\nB6 On Fire 3:01\n\n\nSummary:\nCountry: USA\nGenre: Hard Rock\n\n\nMedia Report:\nSource : Vinyl\nFormat : FLAC\nFormat/Info : Free Lossless Audio Codec, 24-bit PCM\nBit rate mode : Variable\nBit rate : 5 702 Kbps\nChannel(s) : 2 channels\nSampling rate : 192 KHz\nBit depth : 32 bits (float)","torrent":{"xt":"urn:btih:b17bde9ddc7a934e04585389c221d77585403133","amp;dn":"%281978%29+Van+Halen+-+Van+Halen+%5BVinylRip+24-192%5D+%7B100.XY%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b17bde9ddc7a934e04585389c221d77585403133","infoHashBuffer":{"type":"Buffer","data":[177,123,222,157,220,122,147,78,4,88,83,137,194,33,215,117,133,64,49,51]},"announce":[],"urlList":[]}}