{"title":"114 PUNJABI VIDEO SONGS HD releasing IN JULY  2014 GOPI SAHI","uid":10726122,"size":2402210013,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:b26dc6f0dc20fb0df690c32aa9a792729386ce34&amp;dn=114+PUNJABI+VIDEO+SONGS+HD+releasing+IN+JULY++2014+GOPI+SAHI&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"jatt13","files":114,"time":1407558929,"description":"114 PUNJABI VID  \t\tNirmal Sidhu - Hurrr - Official Video - 2014 - Vvanjhali Records GOPI SAHI.mkv \t74.67 MB\n  \t\tChetak - Full Song - Deepa Zaildar - Korona Productions - Blockbuster Songs 2014 - GOPI SAHI.mkv \t69.51 MB\n  \t\tMain Teri Tu Mera - Kanwar Grewal - Official Song - GOPI SAHI.mkv \t65.39 MB\n  \t\tJatt Di Jawani - Distt. Sangrur - Roshan Prince - Latest Punjabi Songs GOPI SAHI.mkv \t62.88 MB\n  \t\tTeri Yaadan - Pav Dharia - Latest Punjabi Sad Song 2014 - Lokdhun - GOPI SAHI.mkv \t47.14 MB\n  \t\tmittran di jaan valaitan ho gayi - AMAN CHATHA - GOPI SAHI.mkv \t46.31 MB\n  \t\tRaula - Kanwar Grewal - Official Song - -GOPI SAHI.mkv \t43.89 MB\n  \t\tSoch Hardy Sandhu- Full Video Song - Romantic Punjabi Song 2013 GOPI SAHI.mkv \t41.13 MB\n  \t\tSingh - Jassi Sidhu &amp; PBN - Full HD Video GOPI SAHI.mkv \t39.6 MB\n  \t\tAmbarsariya Fukrey- Song By Sona Mohapatra - Pulkit Samrat, Priya Anand - GOPI SAHI (1).mkv \t32.75 MB\n  \t\tSoni Pabla - Gal Dil Di (Produced by J-Statik &amp; DJ KSR) - UNFORGETTABLE - PLANET RECORDZ -... \t32.31 MB\n  \t\tNachhatar Gill - Salute - Official Video - 2014 - Vvanjhali Records GOPI SAHI.mkv \t32.19 MB\n  \t\tLove Bhullar - Maa - Full HD Brand New Punjabi Song 2014 - GOPI SAHI.mkv \t27.56 MB\n  \t\tMere Saah - Lovi Matharoo Ft. Harry Panesar - New Punjabi Songs 2014 - Official HD Video - GOPI... \t25.91 MB\n  \t\tKhand Varge Singer-- Sukhwinder Sukhi [Official Video ] - GOPI SAHI.mkv \t25.29 MB\n  \t\tHarjeet Singh Titlee - Official Song - Sidak Sardari Daa - New Punjabi Songs 2014 - GOPI SAHI.mkv \t25.27 MB\n  \t\tEk Villain- Galliyan Video Song - Punjabi Version - Sidharth Malhotra - Shraddha Kapoor GOPI... \t24.27 MB\n  \t\tTeri Yaad - Lovish Kalia - Lyrical Video - GOPI SAHI.mkv \t24.17 MB\n  \t\tDeep Money Feat. Ishmeet Narula - Dabbi - Official HD Video - New Punjabi Songs 2014 - GOPI SAHI.mkv \t24.05 MB\n  \t\tMere Sath Final Song Program Stream - GOPI SAHI.mkv \t23.31 MB\n  \t\tChandigarh - Bharpur - Vehli Janta Records - Full Official Video 2014 GOPI SAHI.mkv \t23.21 MB\n  \t\tDOLLY SINGH - BEDARDA - LATEST PUNJABI SONG - GOPI SAHI.mkv \t22.9 MB\n  \t\tKuldeep Purewal - Boliyan - Official Video 2014 - Vvanjhali Records - GOPI SAHI.mkv \t22.36 MB\n  \t\tRaja Markhai - Biba Deep Kiran - Chori Di Bandook - Goyal Music - Offcial Song - GOPI SAHI.mkv \t22.21 MB\n  \t\tNath Dig Pey - PBN _ Bambi _ Raj Bains - Official Video - Vvanjhali Records - GOPI SAHI.mkv \t21.83 MB\n  \t\tDipps Bhamrah - Mr Makhna - Official Video - 2014 - Vvanjhali Records - GOPI SAHI.mkv \t21.78 MB\n  \t\tGURVEEN SHIPPY - OH RAAT - YAAR ANMULLE RECORDS - LATEST PUNJABI SONG 2014 - GOPI SAHI.mkv \t21.7 MB\n  \t\tFusad - Punjabi Comedy Scene 2014 I Lokdhun Punjabi - GOPI SAHI.mkv \t21.48 MB\n  \t\tBaarish Yaariyan Full Song - Punjabi Version - Himansh Kohli, Rakul Preet - - GOPI SAHI.mkv \t21.15 MB\n  \t\tSK1 - Aithay Rakh - Official Promo 2014 - Vvanjhali Records - GOPI SAHI.mkv \t20.97 MB\n  \t\tDrama Queen - Daljit Mattu - Official Video - Vvanjhali Records - GOPI SAHI.mkv \t20.71 MB\n  \t\tRaja Markhai - Biba Deep Kiran - Dance Floor - Goyal Music - Official Song - GOPI SAHI.mkv \t20.24 MB\n  \t\tThe Xpose- Dard Dilo Ke Full Video Song - Punjabi Version - Himesh Reshammiya, Yo Yo Honey Singh... \t20.16 MB\n  \t\tLajpalan - Kanwar Grewal - Official Full Song - 2014 - GOPI SAHI.mkv \t19.95 MB\n  \t\tTommy Armani -- Sumeet Brar -- Raftaar Records -- Full Official Video -- New Punjabi Song 2014 -... \t19.58 MB\n  \t\tTere Layi Full Song - Babbal Rai - Girlfriend - Latest Punjabi Songs - Speed Records - GOPI SAHI.mkv \t19.56 MB\n  \t\tNAKHRO - SRAN DEEP - YAAR ANMULLE RECORDS - FULL OFFICIAL VIDEO 2014 - GOPI SAHI.mkv \t19.48 MB\n  \t\tChetak - Punjabi Video Song - Singer -R Modi - RDX Music Entertainment Co. -GOPI SAHI.mkv \t19.44 MB\n  \t\t3600 De Suit -- Original Video -- Support -- Manjinder Happy -- Punjabi Songs 2014 Latest - GOPI... \t19.4 MB\n  \t\tTheka - Amy Baaz - Official Full Song - Punjabi Song 2014 Latest - HD Video - GOPI SAHI.mkv \t19.27 MB\n  \t\tRabb Te Bharosa - Param Somal - Official Full HD - New Punjabi Songs 2014 Latest - GOPI SAHI.mkv \t19.14 MB\n  \t\tKuldeep Purewal - Kanka - Official Video 2014 - Vvanjhali Records - GOPI SAHI.mkv \t19.09 MB\n  \t\tPatola - Full Song - Addy Singh - GOPI SAHI.mkv \t18.93 MB\n  \t\tpunjab - GOPI SAHI.mkv \t18.49 MB\n  \t\tSarbjit Cheema - Bani - Official Video 2014 - Vvanjhali Records - GOPI SAHI.mkv \t18.38 MB\n  \t\tOHNA CHAA NHI CHADIA,,, A SONG BY BHAGWANT MANN - GOPI SAHI.mkv \t18.38 MB\n  \t\tSunny Sodhi - Hor Labh Layi - Goyal Music Official Song - GOPI SAHI.mkv \t18.37 MB\n  \t\tIk Wari Mil - Ft. Saini - Songster Music - New Punjabi Songs 2014 - Official HD Video - GOPI... \t18.34 MB\n  \t\tGhaint Shikari - Shaan Akash Feat B Praak - Latest Punjabi Songs 2014 - GOPI SAHI.mkv \t18.1 MB\n  \t\tAadil - Bachpan - Goyal Music - Official Song - GOPI SAHI.mkv \t18.08 MB\n  \t\tBabbu Maan - Gypsy Kali - Full Audio Song - GOPI SAHI.mkv \t17.88 MB\n  \t\tCharra Youth-- Simma Ghuman -- Full Song 2014 -- Yaar Anmulle Records - GOPI SAHI.mkv \t17.87 MB\n  \t\tRaaj Inder - Pegg - Feat. Money Spinner - Full HD Brand New Punjabi Song 2014 - GOPI SAHI.mkv \t17.71 MB\n  \t\tAaja Ve - Sibte Hassan - Latest Punjabi Songs 2014 - GOPI SAHI.mkv \t17.69 MB\n  \t\tRubal - Kanjoosna Ft. S.A.T - Latest Punjabi Song - GOPI SAHI.mkv \t17.56 MB\n  \t\tBullet - Official Video -- Mannu Randhawa -- New Punjabi Songs 2014 -- HD Video - GOPI SAHI.mkv \t17.45 MB\n  \t\tSai Sai - Rampy Saaz Full song - Sai Sai (Sufi Ruhani Sai) - Latest Punjabi Songs 2014 - GOPI... \t17.44 MB\n  \t\tCollege - Game Changer Tera Gidha - Raj Brar - Latest Punjabi Songs - Speed Records - GOPI SAHI.mkv \t17.37 MB\n  \t\tRaatan Na Soye - Badshah - Billy X Feat Akash - Latest Punjabi Songs - GOPI SAHI.mkv \t17.18 MB\n  \t\tHPR Lalka - Dil Nachda - Goyal Music - Official Song - GOPI SAHI.mkv \t17.17 MB\n  \t\tAa Zra - Maninder Kailey - Latest Punjabi Songs - Speed Records - GOPI SAHI.mkv \t17.13 MB\n  \t\tKuldeep Purewal - Yaad - Official Video 2014 - Vvanjhali Records - GOPI SAHI.mkv \t16.89 MB\n  \t\tHarinder Sandhu - Jattan Di Asal Kahani - Goyal Music - Official GOPI SAHI.mkv \t16.78 MB\n  \t\tJAGUAR - A.S MOHAL - Official Music Video - GOPI SAHI.mkv \t16.77 MB\n  \t\tKhuram Jaani - Dill Vich Tasvir - Official Video 2014 - Vvanjhali Records - GOPI SAHI.mkv \t16.61 MB\n  \t\tReply To Bhul Jai Na - Ikraaz Ft. Akshit - GOPI SAHI.mkv \t16.6 MB\n  \t\tFaqeer' Song - Desi Brand - CJ Singh - New Punjabi Song 2014 - GOPI SAHI.mkv \t16.48 MB\n  \t\tSplendor - AD Singh - New Punjabi Songs 2014 - Official Full HD - Latest Punjabi Song 2014 - GOPI... \t16.34 MB\n  \t\tNavi Buttar - feat. Jaskurn Gosal - Dil De De - Goyal Music - Official Song - GOPI SAHI.mkv \t16.28 MB\n  \t\tHIT ON HEART FULL OFFICIAL--YAAD BHULLAR --YAAR ANMULLE RECORDS--2014 - GOPI SAHI.mkv \t16.25 MB\n  \t\tSunny Atwal - Alldan Di Yaari - Full HD Brand New Punjabi Song 2014 - GOPI SAHI.mkv \t16.15 MB\n  \t\tYaadan De Varke - Puneet Riar -- Panj-aab Records -- Brand New Punjabi Songs 2014 -GOPI SAHI.mkv \t15.9 MB\n  \t\tParam - Mini Bus - Full HD Brand New Punjabi Song 2014 - GOPI SAHI.mkv \t15.8 MB\n  \t\tFORD EKAM FULL VIDEO SONG - EKAM 22 - NEW PUNJABI SONG 2014 - GOPI SAHI.mkv \t15.71 MB\n  \t\tHaar Jaani Aa -- Mehtab Virk -- Panj-aab Records -- Desiroutz -- Sad Romantic Song of 2014 --GOPI... \t15.66 MB\n  \t\tFakeeri Nachdi - Kanwar Grewal - Official Song - GOPI SAHI.mkv \t15.63 MB\n  \t\tSohni Jehi - Jind Athwal -- Hope of Love -- Panj-aab Records -- Punjabi Romantic Song 2014 - GOPI... \t15.51 MB\n  \t\tMalkit Dhaliwal - Sardari - Goyal Music - Official Song - GOPI SAHI.mkv \t15.49 MB\n  \t\tK. S. Bhamrah - DHOL VAJDA - Official Video - 2014 - Vvanjhali Records - GOPI SAHI.mkv \t15.2 MB\n  \t\tChoo Cha - Full Song - Paisa Yaar N Panga - Yuvraj Hans - Latest Punjabi Movie Songs - GOPI SAHI.mkv \t15.17 MB\n  \t\tThe Lion Jatt Mr. Cheena -- Official Video -- 2014 - Anand Music - GOPI SAHI.mkv \t15.01 MB\n  \t\tDil Uth Gya - Jantt Pannu - Latest Punjabi Songs 2014 - GOPI SAHI.mkv \t14.81 MB\n  \t\tSatwinder Bugga - Sajjan - Full HD Brand New Punjabi Song 2014 - GOPI SAHI.mkv \t14.59 MB\n  \t\tHEER JEHIYA KURIAN -- GURNAM BHULLAR -- FULL OFFICIAL VIDEO 2014 - GOPI SAHI.mkv \t14.47 MB\n  \t\t26 Ban Gyi Full Song - Double Di Trouble - Dharmendra - Gippy Grewal - Jazzy B - GOPI SAHI.mkv \t14.44 MB\n  \t\tImtiaz E Maa Official Full Song - 2014 - GOPI SAHI.mkv \t14.26 MB\n  \t\tBaba - Kirandeep Bhullar - Latest Punjabi Songs - Anand Music - GOPI SAHI.mkv \t13.98 MB\n  \t\tLehmber Hussainpuri - Matha Tekhiya - Official Video - 2014 - Vvanjhali Records - GOPI SAHI.mkv \t13.88 MB\n  \t\tMirza-Sahiba Deep Dhillon - Jaismeen jassi -- Official Video -- 2014 - Anand Music - GOPI SAHI.mkv \t13.65 MB\n  \t\tAttwadi - Full Official Video - Tarsem Jassar - Kulbir Jhinjer - Vehli Janta Records 2014 GOPI... \t13.64 MB\n  \t\tHARLEY - D Sunny - Official Music Video - MOM Records - Latest Punjabi Song 2014 - GOPI SAHI.mkv \t13.57 MB\n  \t\tNIKKI NIKKI LYRICAL VIDEO - Hardik Trehan - New Punjabi Songs 2014 - Latest Punjabi Songs 2014 -... \t13.45 MB\n  \t\tKuldeep Purewal - Turla Chadra - Official Video 2014 - Vvanjhali Records - GOPI SAHI.mkv \t13.39 MB\n  \t\tChithi - Kirandeep Bhullar - Latest Punjabi Songs - Anand Music GOPI SAHI.mkv \t13.36 MB\n  \t\tJUGNI CHHALEY DI -RAJ SANDHU -YAAR ANMULLE RECORDS -OFFICIAL FULL SONG 2014 - GOPI SAHI.mkv \t13.35 MB\n  \t\tVanjhali - OP Dhillon - Latest Punjabi Song - GOPI SAHI.mkv \t13.15 MB\n  \t\tIgnore - Sanam &amp; Sid Hard - Full Video - New Punjabi Songs 2014 - Official full HD video -... \t12.76 MB\n  \t\tAudience Response - Yaaran Da Katchup - Latest Punjabi Movie - GOPI SAHI.mkv \t12.68 MB\n  \t\tKISSA - Shami J Full Video Song - KISSA - Latest Punjabi Songs 2014 - GOPI SAHI.mkv \t12.52 MB\n  \t\tSK1 - Assi Tere Haan - Official Video 2014 - Vvanjhali Records - GOPI SAHI.mkv \t12.12 MB\n  \t\tIkko Vaada - Imroz - Punjabi Sad Songs - Latest Punjabi Songs 2014 - GOPI SAHI.mkv \t11.4 MB\n  \t\tJaswinder Brar - Duawan - Full HD Brand New Punjabi Song 2014 - GOPI SAHI.mkv \t11.12 MB\n  \t\tRai Jujhar &amp; Madhu Madhvi Roy - Sajjna - Full HD Brand New Punjabi Song 2014 - GOPI SAHI.mkv \t10.86 MB\n  \t\tKuldeep Prewal - Dilan Di Gal - Official Video - Vvanjhali Records - GOPI SAHI.mkv \t10.85 MB\n  \t\tWEEKEND - JASSI feat. BADSHAH -- Panj-aab Records -- Latest Punjabi Song 2014 - GOPI SAHI.mkv \t10.62 MB\n  \t\tLOOK - Daljinder Sangha - Panj-aab Records - Latest Punjabi Songs 2014 HD -GOPI SAHI.mkv \t10.6 MB\n  \t\tJee Lain Dey - Paisa Yaar N Panga - Yuvraj Hans - Latest Punjabi Movie Songs - GOPI SAHI.mkv \t10.52 MB\n  \t\tZindagi - Paisa Yaar N Panga - Saleem - Latest Punjabi Movie Songs - GOPI SAHI.mkv \t10.18 MB\n  \t\tGagan Kokri - Delete - Latest Punjabi Song 2014 - Panj-aab Records - GOPI SAHI.mkv \t8.6 MB\n  \t\tTeri Yaad - Lovish Kalia - Latest Punjabi Song - GOPI SAHI.mkv \t8.39 MB\n  \t\tJee Lain De - Paisa Yaar N Panga - Yuvraj Hans - Latest Punjabi Movie Songs - GOPI SAHI.mkv \t7.99 MB\n  \t\tDhol, Bhangra &amp; Kings XI Punjab - KXIP - KingsXIPunjab - IPL - GOPI SAHI.mkv \t7.79 MB\n  \t\tDukh Kaaton - Paisa Yaar N Panga - Kaler Kanth - Latest Punjabi Movie Songs - GOPI SAHI.mkv \t6.51 MB\n  \t\tAvtar Singh Makkar.flv - GOPI SAHI.mkvEO SONGS HD releasing IN JULY  2014 GOPI SAHI","torrent":{"xt":"urn:btih:b26dc6f0dc20fb0df690c32aa9a792729386ce34","amp;dn":"114+PUNJABI+VIDEO+SONGS+HD+releasing+IN+JULY++2014+GOPI+SAHI","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b26dc6f0dc20fb0df690c32aa9a792729386ce34","infoHashBuffer":{"type":"Buffer","data":[178,109,198,240,220,32,251,13,246,144,195,42,169,167,146,114,147,134,206,52]},"announce":[],"urlList":[]}}