{"title":"All the Devils Are Here-The Hidden History of the Financial Cris","uid":6965487,"size":2917322,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b2aac9316f330619110c61d4955e7fbd55c0fda0&amp;dn=All+the+Devils+Are+Here-The+Hidden+History+of+the+Financial+Cris&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"594mgnav","files":-1,"time":1326908701,"description":"All the Devils Are Here: The Hidden History of the Financial Crisis\n[Team Nanban][TPB]\n\nAUTHOR: Bethany McLean, Joe Nocera\n\nP.rtfolio Tr.de | 2011 | ISBN: 159184438X |\n\nDESCRIPTION:\n\nThe New York Times bestseller hailed as &quot;the best business book of 2010&quot; (Huffington Post).\nAs soon as the financial crisis erupted, the finger-pointing began. Should the blame fall on Wall Street, Main Street, or Pennsylvania Avenue? On greedy traders, misguided regulators, sleazy subprime companies, cowardly legislators, or clueless home buyers?\n\nAccording to Bethany McLean and Joe Nocera, two of America's most acclaimed business journalists, the real answer is all of the above-and more. Many devils helped bring hell to the economy. And the full story, in all of its complexity and detail, is like the legend of the blind men and the elephant. Almost everyone has missed the big picture. Almost no one has put all the pieces together.\n\nAll the Devils Are Here goes back several decades to weave the hidden history of the financial crisis in a way no previous book has done. It explores the motivations of everyone from famous CEOs, cabinet secretaries, and politicians to anonymous lenders, borrowers, analysts, and Wall Street traders. It delves into the powerful American mythology of homeownership. And it proves that the crisis ultimately wasn't about finance at all; it was about human nature.\n\nPLZ SEED AFTER DOWNLOADING..\n\n&quot;LIVE AND LET LIVE&quot;","torrent":{"xt":"urn:btih:b2aac9316f330619110c61d4955e7fbd55c0fda0","amp;dn":"All+the+Devils+Are+Here-The+Hidden+History+of+the+Financial+Cris","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b2aac9316f330619110c61d4955e7fbd55c0fda0","infoHashBuffer":{"type":"Buffer","data":[178,170,201,49,111,51,6,25,17,12,97,212,149,94,127,189,85,192,253,160]},"announce":[],"urlList":[]}}