{"title":"Being There (1979)   DVD","uid":3696107,"size":5968649548,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:b2c42d33f4c6a0c95c12d884fe14054a338446a8&amp;dn=Being+There+%281979%29+++DVD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"panpa","files":15,"time":1180019428,"description":"Being There (1979)   DVD\n\n------------------------\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0078841/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0078841/&lt;/a&gt;\n\nImage: PAL\n\nLanguage: DD 2.0 English, Spanish, French\n\nSubtitles: English, Spanish, French, Portuguese, Arabian, Romanian, Holandes(dutch), Nowegian , Suedish,  Croatian, Chezc, Greek, Turkish, Polish, Hungarian\n\nDIRECTOR:Hal Ashby\n\nCAST:\n\nPeter Sellers    ...    Chance the Gardener\nShirley MacLaine   ...    Eve Rand\nMelvyn Douglas   ...    Benjamin Turnbull Rand\nJack Warden   ...    President\nRichard A. Dysart   ...    Dr. Robert Allenby (as Richard Dysart)\nRichard Basehart   ...    Vladimir Skrapinov\nRuth Attaway   ...    Louise\nDavid Clennon   ...    Thomas Franklin\nFran Brill   ...    Sally Hayes\nDenise DuBarry   ...    Johanna\nOteil Burbridge   ...    Lolo\nRavenell Keller III   ...    Abraz\nBrian Corrigan   ...    Policeman outside White House\nAlfredine P. Brown   ...    Old Woman (as Alfredine Brown)\nDonald Jacob   ...    David\n\n\nBeing There (1979), subtitled &quot;a story of chance,&quot; is a provocative black comedy -- a wonderful tale that satirizes politics, celebrity, media-obsession and television. The subtle film&amp;#039;s slogan proclaimed: &quot;Getting there is half the fun. Being there is all of it.&quot;\n\nThe film was directed by director Hal Ashby (already known for Harold and Maude (1971), The Last Detail (1973), Shampoo (1975), Bound for Glory (1976), and the acclaimed Vietnam war film Coming Home (1978)). The politically-satirical, overly-long film about mistaken identity and the television age was adapted from a 1971 novel by Jerzy Kosinski, with Sellers in a chameleon-like role in his second-to-last film. His role is a forerunner to the mentally-challenged Tom Hanks character in Forrest Gump (1994).\n\nThe film had two Academy Awards nominations, including Best Actor for Sellers (his second and last unsuccessful bid - he lost to Dustin Hoffman in Kramer vs. Kramer (1979)) for his superb understated performance, and a Best Supporting Actor Oscar for Melvyn Douglas (his third and last career nomination and second Best Supporting Actor win that defeated Robert Duvall&amp;#039;s nomination for Apocalypse Now (1979), among others).\n\nIt is a placid fable about Chance (Peter Sellers), a reclusive, illiterate, passive and simple-minded gardener who is well-groomed, fed on schedule, and dressed in custom-tailored suits, has lived his whole sheltered life on the walled-in estate of an eccentric millionaire named Jennings (his father?). His only knowledge of the &quot;real&quot; outside world, an encroaching inner-city ghetto area, is through watching television. His meals have always been prepared by the estate&amp;#039;s black cook Louise (Ruth Attaway).\n\nWhen Chance&amp;#039;s benefactor dies, he is evicted by the estate&amp;#039;s lawyers and wanders aimlessly and helplessly into the streets of Washington, D. C. As he emerges into the outside world, a version of Also Sprach Zarathustra is heard on the soundtrack. He is confronted by a young urban gang, and threatens to &amp;#039;turn them off&amp;#039; with a TV remote control channel-changer. Later in a freak accident, he is struck by a limousine owned by Eve Rand (Shirley MacLaine) and bruises his legs. She takes him to her dying, patriarchal, industrialist husband Benjamin&amp;#039;s (Melvyn Douglas) home for treatment from her personal physician Dr. Allenby (Richard Dysart) and recuperation. During the trip, he identifies himself as &quot;Chance...the gardener,&quot; which is incorrectly interpreted to be his full name - Chauncey Gardiner. \n\n\n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:b2c42d33f4c6a0c95c12d884fe14054a338446a8","amp;dn":"Being+There+%281979%29+++DVD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b2c42d33f4c6a0c95c12d884fe14054a338446a8","infoHashBuffer":{"type":"Buffer","data":[178,196,45,51,244,198,160,201,92,18,216,132,254,20,5,74,51,132,70,168]},"announce":[],"urlList":[]}}