{"title":"Asian Comics (2015).pdf Gooner","uid":14039786,"size":68177943,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b3267162efe6b02880e8697363dcce9340c1c0c5&amp;dn=Asian+Comics+%282015%29.pdf+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1459011073,"description":"Asian Comics (2015).pdf Gooner\r\n\r\nPublisher: University Press of Mississippi (January 5, 2015)\r\nLanguage: English\r\nISBN-10: 1628461586\r\nISBN-13: 978-1628461589\r\n\r\nGrand in its scope, Asian Comics dispels the myth that, outside of Japan, the continent is nearly devoid of comic strips and comic books. Relying on his fifty years of Asian mass communication and comic art research, during which he traveled to Asia at least seventy-eight times and visited many studios and workplaces, John A. Lent shows that nearly every country had a golden age of cartooning and has experienced a recent rejuvenation of the art form.\r\n\r\nAs only Japanese comics output has received close and by now voluminous scrutiny, Asian Comics tells the story of the major comics creators outside of Japan. Lent covers the nations and regions of Bangladesh, Cambodia, China, Hong Kong, India, Indonesia, Korea, Malaysia, Myanmar, Nepal, the Philippines, Singapore, Sri Lanka, Taiwan, Thailand, and Vietnam.\r\n\r\nOrganized by regions of East, Southeast, and South Asia, Asian Comics provides 178 black-and-white illustrations and detailed information on comics of sixteen countries and regions--their histories, key creators, characters, contemporary status, problems, trends, and issues. One chapter harkens back to predecessors of comics in Asia, describing scrolls, paintings, books, and puppetry with humorous tinges, primarily in China, India, Indonesia, and Japan.\r\n\r\nThe first overview of Asian comic books and magazines (both mainstream and alternative), graphic novels, newspaper comic strips and gag panels, plus cartoon/humor magazines, Asian Comics brims with facts, fascinating anecdotes, and interview quotes from many pioneering masters, as well as younger artists","torrent":{"xt":"urn:btih:b3267162efe6b02880e8697363dcce9340c1c0c5","amp;dn":"Asian+Comics+%282015%29.pdf+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b3267162efe6b02880e8697363dcce9340c1c0c5","infoHashBuffer":{"type":"Buffer","data":[179,38,113,98,239,230,176,40,128,232,105,115,99,220,206,147,64,193,192,197]},"announce":[],"urlList":[]}}