{"title":"100 Sex Scenes #9 (1995) [VHSRip]","uid":9464043,"size":3544297862,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:b34ddffd5dee543f003fb0f7e7870c77e5cc2bbe&amp;dn=100+Sex+Scenes+%239+%281995%29+%5BVHSRip%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"chkm8te","files":2,"time":1389413698,"description":"100 Sex Scenes #9 (1995) [VHSRip]\n\nRebecca Lord, Marilyn Star, Jill Kelly, Diva, Savannah, Ron Jeremy, Michael J. Cox, Rebecca Wild, Buck Adams, Vince Vouyer, Jasmin Aloha, Jonathan Morgan, Crystal Wilder, Randy Spears, Alex Sanders, Debi Diamond, Beatrice Valle, Marc Wallice, Joey Silvera, Melanie Moore, Brittany O'Connell, Nick East, Nicole London, Nina Hartley, Stacy Nichols, Julie Rage, Charlie, Shawna Edwards, Lexi Erickson, Nyrobi Knight, Devlin Weed, Golden Jade, Byron Long, Mike Horner, Cheri Taylor, Peter North, Tiffany Mynx, Steve drake, Tom Chapman, Nici Sterling, Jill Kelly, Mark Davis, Tom Byron, Heather Lee, Davia Ardell, Jordan Lee, Channone, Jasper, Sean Michaels, Sahara Sands, Sinnamon Love, Foxy, Megan Smith, Nikki Sinn, Cumisha Amado, Lana Woods, Rodney Moore, Crown Princess, John Decker, Toni, Celeste Willings, Max Hardcore, Byron Long, Kay London, Morgan Fairlane, Tony Eveready, Valentino, T.T. Boy, Hershel Savage, Coral Sands, Shawna Edwards\n\nThis is an &quot;old&quot; 90's compilation VHS, part of the Execu-Comp series. It's just under 4 hours, with (as the title indicates) 100 sex scene shorts, edited down to fit on one VHS cassette. The picture quality is mediocre, but many of the clips are rare, enough so that I can't identify many of them on IAFD. Any IDs for the actresses, actors, or original movie the scenes are from would be greatly appreciated, The following video contains: oral, anal, DP, facials, POV scenes, BBW, girl on girl, masturbation, interracial, blacks, asians, hispanics, a granny scene or two, I believe there's one hermaphrodite in there (may be a fake), a dude in a hockey mask, and a clown (*facepalm*).\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=vwemrhdtzc9wg3xx1ifn.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=vwemrhdtzc9wg3xx1ifn.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:b34ddffd5dee543f003fb0f7e7870c77e5cc2bbe","amp;dn":"100+Sex+Scenes+%239+%281995%29+%5BVHSRip%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b34ddffd5dee543f003fb0f7e7870c77e5cc2bbe","infoHashBuffer":{"type":"Buffer","data":[179,77,223,253,93,238,84,63,0,63,176,247,231,135,12,119,229,204,43,190]},"announce":[],"urlList":[]}}