{"title":"Richard North Patterson - The Race (48k .MP3 Audiobook)","uid":4108781,"size":293901859,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:b3ce1683b69cc23b0bb5f9af53f51641ea68a679&amp;dn=Richard+North+Patterson+-+The+Race+%2848k+.MP3+Audiobook%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Diaperzone","files":153,"time":1206941235,"description":"\nThe Race\n\n   Author: Richard North Patterson\n   Reader: Michael Boatman\n\n\n\n48k .MP3 Audiobook (fiction - 2007)\nCDs 1-11, Run time: 13:35:41\n\nPatterson captures the good, the bad, and the ugly of the American political process. \n\nSenator Corey Grace, decorated hero from the first Gulf War, campaigns for the Republican presidential nomination in a vivid look at contemporary politics. \n\nMichael BoatmanÃ•s seamless delivery is crisp and clear. His straightforward approach allows listeners to feel the full force of ruthless politics with painful clarity. The beauty of BoatmanÃ•s narration may well be his resistance to overplaying the storyÃ•s drama as Grace takes on the most incendiary issues of our time--racism, terrorism, religious fundamentalism, and gay rights. Patterson and Boatman prove to be a pair of gifted storytellers.\n\nSen. Corey Grace is the most charismatic and compassionate conservative Republican to ever run for president. He believes in women&amp;#039;s choice, gay rights, gun control and stem cell research. Ordinarily, these would be suicidal platform points, but the other two candidates?a bombastic but honorable hard-line evangelist and a loutish Senate majority leader who is backed by a Machiavellian media giant?stand a good chance of splitting the far right vote. Patterson is best-known for his thrillers, but The Race is long on lore and shy on suspense. It&amp;#039;s also filled with all-too-familiar political events and characters that are almost parodies of people living or dead. Grace has several well-written speeches that Michael Boatman delivers with the wise and wry voice of reason. Boatman also captures the dramatic baritone of the evangelist; the smarmy and nasal senator; and the evil media baron who sounds a bit Australian. Boatman does a fair job of imitating the voices of real-life characters but saves his best mimicry for a rancorous radio pundit whom Patterson has given a fictional name.","torrent":{"xt":"urn:btih:b3ce1683b69cc23b0bb5f9af53f51641ea68a679","amp;dn":"Richard+North+Patterson+-+The+Race+%2848k+.MP3+Audiobook%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b3ce1683b69cc23b0bb5f9af53f51641ea68a679","infoHashBuffer":{"type":"Buffer","data":[179,206,22,131,182,156,194,59,11,181,249,175,83,245,22,65,234,104,166,121]},"announce":[],"urlList":[]}}