{"title":"RONNIE JAMES DIO -- EVIL EYES -- LIVE 1983 U.S. TOUR","uid":5583593,"size":318320564,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b3f9faf981cc2187df71b804f4998d49e926565c&amp;dn=RONNIE+JAMES+DIO+--+EVIL+EYES+--+LIVE+1983+U.S.+TOUR&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Flyfisher61","files":19,"time":1274627030,"description":"Created by Ratio: 3.37sgtsteiner 8 hours ago\nMusic : Metal : Lossless\nFirst off, A MASSIVE THANK YOU to *Huddel* for his generosity in allowing this fantastic disc to be posted here in tribute to the late, great R.J.D. Thank you so much for this, Huddel.\n\nThis is a killer bootleg from Dio's 1983 U.S. Tour. The sound quality is very good. Personally, I think it's BETTER than very good, but I'll under promise and over-deliver for the cranky bastards on this site always looking to criticize.\n\nThere may be better boots of this tour somewhere, but I have yet to find them. If you have some, please share. In the meantime, I believe this offers a great snapshot of Ronnie at the peak of his powers. Great set list, the band is tight, the guitar playing shreds, and Ronnie's voice is spectacular.\n\n\n\n\nLate one night in 1980, watching our primitive cable box, I stumbled across a promo concert video of RDJ with Sabbath on the &quot;Black and Blue&quot; Tour performing &quot;Die Young&quot;. It absolutely floored me. I'd never seen anything like it. It was my introduction to Heavy Metal and I was never the same after that. Metal became my favorite music, the soundtrack to my high school years. Thirty years on, I'm still cranking metal every chance I get -- without apology. I believe it's every bit as good and lasting and fun today as it was way back when. And Ronnie's work was a big part of turning me onto this music.\n\nThat's why I'm so glad to be able to share this small gem with all of you.\n\n\n\nCheers, Ronnie. God Bless you for all the music you shared with us and brought into our lives.\n\nArtist: Ronnie James Dio\nAlbum: Evil Eyes\nRecorded live in Santa Monica Civic during the US Tour 1983\nReleased: 1991\nSource: Solid rock RS003\nGenre: Hard Rock / Metal\nScanns: all at 300dpi\n\nTracklist:\n\n01 - Stand Up And Shout\n02 - Straight To The Heart\n03 - Shame On The Night\n04 - Stargazer - Heaven And Hell\n05 - Holy Diver\n06 - Rainbow In The Dark\n07 - Man On The Silver Mountain\n\nMany thanks again to Huddel for the rip and time spent scanning all the disc artwork.\n\nR.I.P. Ronnie James Dio. Please enjoy this torrent in the spirit it was intended -- as a tribute to one of the great vocalists in rock history. Please take time to LEAVE A COMMENT regarding your thoughts and memories of RJD if you feel like sharing.","torrent":{"xt":"urn:btih:b3f9faf981cc2187df71b804f4998d49e926565c","amp;dn":"RONNIE+JAMES+DIO+--+EVIL+EYES+--+LIVE+1983+U.S.+TOUR","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b3f9faf981cc2187df71b804f4998d49e926565c","infoHashBuffer":{"type":"Buffer","data":[179,249,250,249,129,204,33,135,223,113,184,4,244,153,141,73,233,38,86,92]},"announce":[],"urlList":[]}}