{"title":"Connie Francis - Souvenirs - 4 Disc Box Set - [EAC.APE.CUE]","uid":4885742,"size":1585214398,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:b55dc4dcc762fc14ef869d1623c83a85e206ca9a&amp;dn=Connie+Francis+-+Souvenirs+-+4+Disc+Box+Set+-+%5BEAC.APE.CUE%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"no_fun","files":131,"time":1241720537,"description":"Connie Francis - Souvenirs - 4CD Box Set - [APE]\n\nTracklist - http://www.google.com/musicl?lid=2AlWGAmFd0J&amp;aid=bSYWIwv5-LE&amp;ei=XW0CSo2rG6OMtgfLzZyNBw&amp;sa=X&amp;oi=music&amp;ct=result\n\nQuote:\nConnie Francis played an important part in late'50s and 1960s American pop music as one of the most versatile vocalists in the field (she has been likened to Pat Boone in that respect) and one of few women to join the top ranks of ItalianAmerican entertainers like Dean Martin, Tony Bennett, etc. Souvenirs is a fourdisc career retrospective that goes beyond the hitsof which there are manyto present her early recordings as a demo singer, offbeat novelties like &quot;Robot Man,&quot; and many nonhit singles and album sides. Francis covers a huge territory, from traditional and teenoriented pop to country, continental music, faux girl group experiments and even a little rock roll. Her hits from 195862, many of which make her seem like a female teen idol, are the ones most people remember, but Francis was really in her element when fronting an orchestra on Jerry Vale or Perry Comostyle traditional pop of the sort that comprises the bulk of Souvenirs. The scope and quantity of her music creates a problem for music buyers and, accordingly, there have been several anthologies that concentrate on one or another aspect of her recording career. Serious fans will want to invest in Bear Family's pair of multidisc box sets, both of which are complete within their respective timeframes. But listeners with a pointed interest in Francis' career, who care enough to want to hear various demo recordings, oddities and obscurities without investing in the import sets, will find Souvenirs a perfect compromise.\n- Greg Adams, All Music Guide","torrent":{"xt":"urn:btih:b55dc4dcc762fc14ef869d1623c83a85e206ca9a","amp;dn":"Connie+Francis+-+Souvenirs+-+4+Disc+Box+Set+-+%5BEAC.APE.CUE%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b55dc4dcc762fc14ef869d1623c83a85e206ca9a","infoHashBuffer":{"type":"Buffer","data":[181,93,196,220,199,98,252,20,239,134,157,22,35,200,58,133,226,6,202,154]},"announce":[],"urlList":[]}}