{"title":"Elemental Knights Online RED v3.1.0","uid":8926188,"size":27274972,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:b584cf03a23bd45dd9638047cddf4ab33f4390e2&amp;dn=Elemental+Knights+Online+RED+v3.1.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Androider","files":-1,"time":1379371662,"description":"\nAchievement of Three Million Installations of Elemental Knights Series!!\nWe are very thankful for all and provide these specials.\n- Get rewarded as much as you play ELEMENTAL KNIGHTS ONLINEï¼ˆEKOï¼‰\n\nELEMENTAL KNIGHTS ONLINE is an anime-style MMORPG featuring borderless access and global entertainment.\nJoin your friends on a grand adventure through mysterious lands with eccentric locals...\n\nThis game features:\n\n- Monk, thief, bishop, wizard, magiknight, and more job-classes\n- Thousands of items, a trillion combinations, and cosplay gear such as Graham Cracker Wings\n- Hundreds of NPCs and over 100 quests\n- Party creation with up to four people\n- Free chat, emoticons, and gestures \n- Play in English or Japanese\n- Grassy plains, forests, deserts, underground canals, haunted castles, and... snow hedgehogs.\n- Special events hosted twice a month\n- Gacha for the gambler inside you\n\n*100% MADE IN AKIHABARA\n\nThe World's Destiny\n\nSpirits, creatures, and humans have been blessed with technology and magic as a means of living thanks to ELEMENTAL: the power that dwells inside all of nature and the resting place of the gods.\n300 years ago, lust for this power drove the citizens of this world into a Great War with one another. But four heroes stood up in the name of peace and would restore harmony to the land...\n\nCenturies later, the monsters and spirits have grown violent. The Dragons awaken from a three century slumber. A wave of tragic incidents ensues...\nEach country dispatches their knights and adventurers to investigate the recent outbreak of bizarre happenings. \n\nWhat is the meaning of all this?\nNow you must take up your arms and armor. On your journey you shall encounter beautiful witches, humble townspeople, despondent warriors, breathtaking vistas, and wicked adversaries.\n\nLet nothing prevent you from solving the mystery behind the recent chaos! Our world is in peril.\n\nWhat's New:\n\nv3.0.15 Update Note\nBug Fixed\nRemove crush issues happened in Map changes\nRemove other bugs related with Party, Friend Guild Information, and Friend List\nRemove bugs being unable to call friends during Dark King event\nRemove bugs being unable to use a part of skills learned in Bandit Rock\n\nMore info:\n &lt;a href=&quot;\nhttps://play.google.com/store/apps/details?id=jp.co.winlight.eko_tw&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://play.google.com/store/apps/details?id=jp.co.winlight.eko_tw&lt;/a&gt;\n","torrent":{"xt":"urn:btih:b584cf03a23bd45dd9638047cddf4ab33f4390e2","amp;dn":"Elemental+Knights+Online+RED+v3.1.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b584cf03a23bd45dd9638047cddf4ab33f4390e2","infoHashBuffer":{"type":"Buffer","data":[181,132,207,3,162,59,212,93,217,99,128,71,205,223,74,179,63,67,144,226]},"announce":[],"urlList":[]}}