{"title":"Bananarama - Do Not Disturb [Bananas tv show 1985].VOB","uid":7086321,"size":202418180,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:b821134cb6407bb39f54cd54646a7f4b8ca9daf3&amp;dn=Bananarama+-+Do+Not+Disturb+%5BBananas+tv+show+1985%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SgtRlee","files":-1,"time":1331199452,"description":"Bananarama - Do Not Disturb [Bananas tv show 1985].VOB\n\n\nHQ very rare promo music video from a promo DVD. &quot;Do Not Disturb&quot; is a song recorded by English girl group Bananarama. It was written and produced by the production duo of Steve Jolley and Tony Swain. Originally released as a stand-alone single in 1985, the track was later added to Bananarama's third album True Confessions which was issued by London Records a year later. &quot;Do Not Disturb&quot; was released in the UK, Australia, Germany and Japan but only charted in the UK.\n\nBananarama did not like the song. Group member Keren Woodward later said of the True Confessions album, &quot;It is all our ideas, it is what we wanted to sound like and sing about. Except 'Do Not Disturb' which Swain and Jolley wrote and which we don't think is very good. Thats why there's eleven songs on the LP instead of ten&quot;. When released, &quot;Do Not Disturb&quot; was a mid-charting single, peaking at number thirty-one.\n\nThe song was also issued as 3 separate shaped picture discs, each featuring a member of the group, which came with a plinth to put them on display.\n\nBananarama are an English female pop duo who have had success on the pop and dance charts since 1982. Rather than relying on a two part harmony, the duo generally sings in unison, as do their background vocalists. Although there have been line-up changes, the group enjoyed their most popular success as a trio made up of lifelong friends Siobhan Fahey, Keren Woodward and Sara Dallin. Since 1988, Bananarama have been listed in the Guinness World Records as the all-female group with the most chart entries.\n\nBananarama were founded in London in 1979 by Fahey, Woodward and Dallin, the latter two having been childhood friends in Bristol since the age of four, and attended St George's School for Girls together. The pair became a trio when Dallin met Fahey while studying fashion journalism. They became friends because they both dressed more radically than the other students. The trio were ardent followers of the punk rock and post-punk music scene during the late 1970s and early 1980s and often performed impromptu sets or backing vocals at gigs for such bands as The Monochrome Set, Iggy Pop, The Jam, Department S and The Nipple Erectors.\n(video has a semi-transparent white &quot;zdf.kultur&quot; logo at the top left)\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Do_Not_Disturb_(song)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Do_Not_Disturb_(song)&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://bayimg.com/EaNCjaadC&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/EaNCjaadC&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic:     \n   Video: MPEG2 Video 720x576 (4:3) 25fps 8000kbps\n   Audio: MPEG Audio 48000Hz stereo 256kbps\n   Duration: 00:03:14\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Just updated Jan 30, 2012!\n\n\n*Media Player Classic Home Cinema*         &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\nSgtRlee (Sgt.R.Lee) \n\t","torrent":{"xt":"urn:btih:b821134cb6407bb39f54cd54646a7f4b8ca9daf3","amp;dn":"Bananarama+-+Do+Not+Disturb+%5BBananas+tv+show+1985%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b821134cb6407bb39f54cd54646a7f4b8ca9daf3","infoHashBuffer":{"type":"Buffer","data":[184,33,19,76,182,64,123,179,159,84,205,84,100,106,127,75,140,169,218,243]},"announce":[],"urlList":[]}}