{"title":"ZZ Top - La Grange (Live) (Xvid-2nafish)","uid":5689326,"size":102276024,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:b89b38a7779368ca33931ce99c6d45660a00f80f&amp;dn=ZZ+Top+-+La+Grange+%28Live%29+%28Xvid-2nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1279008431,"description":"Source: TV\n\nFile Info:\n\nValid : Yes [AVI]\nDuration : 00:08:09\nMovie complete : Yes\n\n[Video]\nResolution : 720x540\nCodec : XviD MPEG-4 codec\nFPS : 29.97\nBitRate : 1353 Kbps\nQuality Factor : 0.12 b/px\n\n[Audio]\nCodec : MPEG 1 or 2 Audio Layer 3 (MP3)\nNumber of channels : 2\nSample Rate : 48000 Hz\nBitRate : 320 Kbps\n\n\n\n&quot;La Grange&quot; is a song by the rock group ZZ Top from their album Tres Hombres, released in 1973. Considered to be almost a &quot;one-chord blues&quot;, it is one of their most successful songs. It was released in 1973 and received extensive radio play, rising to #41 in the Billboard Pop Singles list in 1974. The song refers to a bordello on the outskirts of La Grange, Texas (later notoriously known as the &quot;Chicken Ranch&quot;). This brothel is also the subject of the Broadway play and film The Best Little Whorehouse in Texas, the latter starring Dolly Parton and Burt Reynolds.\n\nIn March 2005, Q magazine placed &quot;La Grange&quot; at number 92 in its list of the 100 Greatest Guitar Tracks. The song is also ranked number 74 on Rolling Stone magazine's &quot;100 Greatest Guitar Songs of All Time&quot;. The song was also included as a playable song in the video game Guitar Hero III: Legends of Rock.\n\nBilly Gibbons indicated in a Guitar World special, Guitar Legends, that the lead was played with a 1955 Stratocaster with a stop tailpiece through a Marshall Super Lead 100 with Celestion greenback speakers.\n\nIn recent years, when the band played the song in concert, it has become a tradition for them to abruptly stop playing in the middle of it, at which point Gibbons and bassist Dusty Hill shout out, &quot;Hell yeah!&quot; before resuming the song.\n\nThe initial groove of the song is based on a traditional blues lick also used by John Lee Hooker in his &quot;Boogie Chillen&quot; and Slim Harpo's &quot;Shake Your Hips.&quot; Bernard Besman, who owned the copyright to &quot;Boogie Chillen,&quot; sued ZZ Top in 1992. The courts ultimately ruled that &quot;Boogie Chillen&quot; was in the public domain.\n\nTres Hombres is the third album by American  blues-rock  band ZZ Top, released in 1973. It proved to be the group's commercial breakthrough attracting a larger fanbase. The album hit the top ten while the single &quot;La Grange&quot; hit 41 on the singles chart.\n\nThe name means &quot;Three Men&quot; in Spanish, referring to the three members of the band.\n\nIn 2003, the album was ranked number 498 on Rolling Stone magazine's list of the 500 greatest albums of all time.\n\nDuring the height of ZZ Tops' success in the early 1980s a&quot;digitally remixed&quot; version of the recording replaced the original 1973 analog mix. The remix version was used on all early CD copies and was the only version available for over 20 years. A remastered and expanded edition of the album was released on February 28, 2006, which contains three bonus live tracks. The 2006 edition is the first CD version to use the original 1973 mix.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:b89b38a7779368ca33931ce99c6d45660a00f80f","amp;dn":"ZZ+Top+-+La+Grange+%28Live%29+%28Xvid-2nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b89b38a7779368ca33931ce99c6d45660a00f80f","infoHashBuffer":{"type":"Buffer","data":[184,155,56,167,119,147,104,202,51,147,28,233,156,109,69,102,10,0,248,15]},"announce":[],"urlList":[]}}