{"title":"The Black Crowes - Lickin' [promo].VOB","uid":7521264,"size":160860160,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:b8ddadd352c93497244ac395f7709e561e2822a9&amp;dn=The+Black+Crowes+-+Lickin%27+%5Bpromo%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SgtRlee","files":-1,"time":1344636426,"description":"The Black Crowes - Lickin' [promo].VOB\n\n\nHQ promo music video from a promo DVD. &quot;Lickin'&quot; is a song from Lions, the sixth studio album by American rock band The Black Crowes. It was released in 2001 as their first album on V2 Records following their departure from Columbia, and is their only studio album to feature guitarist Audley Freed. Lions was recorded in New York City in January and February of that year, and was produced by Don Was. Bass guitar duties were shared by Rich Robinson and Was, as Greg Rzab had left the band and was not replaced until the tour that followed the release of the album.\n\nThe album debuted on the Billboard 200 at its peak position of 20, selling more than 53,000 copies in its first week. Lions received mixed reviews; although the overall sound of the album generally garnered praise, a frequent complaint was the lack of &quot;memorable&quot; songs. The critics who rated Lions lowest considered it a poor imitation of the band's influences, such as Led Zeppelin.\n\nThe band supported Lions with two North American tours (one with Oasis co-headlining), and a short tour of Europe and Japan in between. Soundboard recordings of several concerts were available for download to those who owned the album. Following the tour, the band went on hiatus until 2005.\n\nThe Black Crowes are an American rock band formed in 1989. Their discography includes nine studio albums, four live albums and several charting singles. The band was signed to Def American Recordings in 1989 by producer George Drakoulias and released their debut album, Shake Your Money Maker, the following year. The follow-up, The Southern Harmony and Musical Companion, reached the top of the Billboard 200 in 1992.\n\nAfter a hiatus between 2002 and 2005, the band released Warpaint, which hit number 5 on the Billboard chart. After the release of a double album, the greatest hits-like and mostly acoustic Croweology in August 2010, the band started a 20th anniversary tour that was followed by an ongoing second hiatus.\n\nThe band has opened for various rock acts such as Heart, Robert Plant, Tom Petty and the Heartbreakers, the Dave Matthews Band, the Grateful Dead, Aerosmith and ZZ Top, and performed live with Jimmy Page and Oasis, among others. The band has sold over 30 million albums, and is listed at number 92 on VH1's &quot;100 Greatest Artists of Hard Rock&quot;. They were also labeled by Melody Maker as &quot;The Most Rock 'n' Roll Rock 'n' Roll Band in the World&quot; and the readers of Rolling Stone voted them 'Best New American Band' in 1990.\n(video does not have any logos)\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Lions_(album)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Lions_(album)&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://bayimg.com/aABhDaaea&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/aABhDaaea&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic: \n   Video: MPEG2 Video 720x480 (4:3) 29.97fps 7400kbps\n   Audio: PCM 48000Hz stereo 1536kbps [DVD LPCM, 16 bit]\n   Duration: 00:03:47\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Latest stable build is v1.6.2\n\n\n*Media Player Classic Home Cinema*  &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\n\nSgtRlee (Sgt.R.Lee) \n\t","torrent":{"xt":"urn:btih:b8ddadd352c93497244ac395f7709e561e2822a9","amp;dn":"The+Black+Crowes+-+Lickin%27+%5Bpromo%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b8ddadd352c93497244ac395f7709e561e2822a9","infoHashBuffer":{"type":"Buffer","data":[184,221,173,211,82,201,52,151,36,74,195,149,247,112,158,86,30,40,34,169]},"announce":[],"urlList":[]}}