{"title":"Mobile Observatory - Astronomy v1.99.2","uid":8254442,"size":20280793,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:b8ff61d1658b16b29c9c3fc706769467be9f885e&amp;dn=Mobile+Observatory+-+Astronomy+v1.99.2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Purplebeanz","files":1,"time":1363228882,"description":"Mobile Observatory - Astronomy v1.99.2\n\nRequirements: Android 2.1+\n\nOverview: Mobile Observatory - The Astronomy App for your Smart Phone\nMobile Observatory is one of the most complete astronomy apps available for Android devices and the perfect tool for anybody interested in the sky's wonders, from the occasional sky gazer to the passionate amateur astronomer.\n\n\nAsteroid 2012 DA14 which will have an extremely close encounter with Earth on February 15, 2013, is included in this app!\n\nMobile Observatory is one of the most complete astronomy apps available for Android devices and the perfect tool for anybody interested in the sky's wonders, from the occasional sky gazer to the passionate amateur astronomer.\n\nYou want to know if the next lunar eclipse is visible from your location or when the next bright comet is visible? You would like to be notified by your smart phone the next time, Jupiter and the Moon meet in the sky? You want to know what the blazing bright object in the evening sky is? You want to be always up-to-date which celestial events are visible from your location? Then this app is a must-have for you!\n\nThe app does not only include a live, zoomable sky map telling you what sky object you are looking at but provides you with loads of detailed extra information on stars, planets, deep sky objects, meteor showers, comets, asteroids, lunar and solar eclipses as well as detailed ephemeris of all included sky objects and an interactive top-down view of the Solar System. All that in just one app!\n\nPresently, Mobile Observatory is available in three different languages: English, German, and Spanish. Localisation to further languages is in progress.\n\n\nMobile Observatory provides the following features:\n\n- Zoomable sky map showing stars, planets, asteroids, and more (above and below the horizon)\n- Interactive top-down view of the Solar System\n- Live mode (point device on sky and get information on what you see)\n- Calendar showing detailed descriptions of celestial events\n- Push celestial events to your phone's calendar and set a reminder alarm\n- Rise, set, and transit times for any object\n- Position of any object in the sky (altitude and direction)\n- Twilight times, length of day\n- Bright Star Catalog (~9000 stars) with detailed informations\n- For Android version 3.1 and higher: Update catalogs online\n- PPM Star Catalog (mv&lt;11, 400 000 stars)\n- Download up-to-date orbital elements for minor planets and comets\n- Selection of 2500 NGC objects\n- Messier Catalog (110 objects) complete with images\n- Caldwell Catalog (110 objects) complete with images\n- HiddenTreasures Catalog (109 objects) complete with images\n- Meteor streams (begin, maximum, hourly rate, ...)\n- Lunar and solar eclipses information\n- Bright comets (automatically selected according to the date)\n- Dwarf planets: The five known dwarf planets\n- Minor planets: bright, near Earth, trans-Neptune (total of 5000 in the database)\n- Moon phases, the apparent view of the sun and planets\n- Current image of the Sun and sunspot number\n- Automatically generated visibility report for any object\n- Twilight/Sunrise/set diagram for the complete year\n- Compass view with showing azimuth and altitude of objects graphically\n- Positions of the Jupiter moons\n- Widget with rise &amp; set times of the Sun and Moon\n- Automatic location determination from the mobile network or GPS\n- Select a location from a built-in database or online via Google Maps\n- Choose any time and date\n- Detailed ephemeris, visibility information of all objects\n- Dates of conjunctions between any object with planets or the Moon\n- 3D-view of the Moon and the planets\n- Accurate calculations for dates between 1900 and 2100\n\nWhat's in this version:\n\n- Hidden Treasures List (110 Deep Sky objects with images)\n- Asteroid 2012DA14 (close encounter with Earth on Feb 15)\n- Photorealistic stars (optional, can be toggled via Sky View Preferences-&gt;Display)\n- Select types of events in Events Calendar\n- Backup/Restore Favorites on SD-card\nONLY FOR ANDROID 3.1 AND HIGHER:\n- Update and download catalogs online\n- Extended star catalog (PPM Star Catalog, mv=11, &gt;400 000 stars)\n- Minor Planets database can be updated daily online\n- Several bugfixes\n\n &lt;a href=&quot;\nhttps://play.google.com/store/apps/details?id=com.kreappdev.astroid&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://play.google.com/store/apps/details?id=com.kreappdev.astroid&lt;/a&gt;","torrent":{"xt":"urn:btih:b8ff61d1658b16b29c9c3fc706769467be9f885e","amp;dn":"Mobile+Observatory+-+Astronomy+v1.99.2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b8ff61d1658b16b29c9c3fc706769467be9f885e","infoHashBuffer":{"type":"Buffer","data":[184,255,97,209,101,139,22,178,156,156,63,199,6,118,148,103,190,159,136,94]},"announce":[],"urlList":[]}}