{"title":"Sonicflood - 2004 - This Generation","uid":4871664,"size":39908608,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b92dacb488ee8dd4e5a9b873a3016162804f12af&amp;dn=Sonicflood+-+2004+-+This+Generation&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TorrentTracts","files":10,"time":1240867490,"description":"Sonicflood - 2004 - This Generation\n\n\nTRACK LISTING:\n\n01 - This Generation\n02 - All Ive Failed To Be\n03 - You Are\n04 - Everlasting\n05 - More Than Anything\n06 - Prodigal\n07 - Your Love Goes On Forever\n08 - Never Forget You (Psalm 103)\n09 - Moment Of Glory\n10 - Gods Here\n\n\nADDITIONAL INFORMATION:\n\nThe follow-up to 2003's Cry Holy, This Generation sees Sonicflood entering a new season that includes welcoming new players, a season that frontman Rick Heil hopes will lead people to a definitive understanding that God's heart is truly good. \n\nIt sounds obvious. After all, we learn about God's goodness from our earliest days in Sunday school. &quot;But in today's Church, we have a tendency to doubt our Father's heart,&quot; Heil says. &quot;Satan's first lie was that God is holding back and He doesn't care about us the way He says He does. Satan planted that seed of doubt in mankind back in the Garden.&quot; Through the songs of This Generation, Heil &amp; Co. hope to help uproot that seed. \n\nThis is also a season of celebration for Heil as he rejoices over being healed from Crohn's disease, a painful intestinal disorder he's lived with for years. &quot;Normally, you have it for life,&quot; Heil explains, &quot;but I was in the hospital in March and one of the top surgeons went through all my intestines and said there was no disease to treat.&quot;\n\nFor so many years, Heil praised God through the pain. Now he's thrilled to celebrate the way the Lord has given him back his health. No matter how he's doing physically, though, Heil knows it's easy to give in to doubt, to believe that God doesn't have our best interests at heart. \n\n&quot;It's something I struggled with throughout this illness and through relationships that have gone awry,&quot; he admits. &quot;When we buy into that, it's easy to start blaming God for the pain or hurt in our lives.&quot; That's why Heil hopes that everyone who listens to This Generation will begin to truly trust God's promise that He has a plan to prosper us and not harm us.\n\n&quot;I think worship is the strongest tool we have in fighting those negative messages,&quot; Heil says, adding, &quot;You are what you're filled with. The great thing about music is it is always available. If you feel overwhelmed by this life, you can crank up the tunes and let the Lord minister to you and get refocused.&quot; \n\nTo create an album that would help people refuel and refocus, Sonicflood called on three amazing talents to share production duties. Marc Byrd (City On A Hill: The Gathering) provided continuity from the last album, while Jim Cooper (Building 429, Across the Sky) and Dan Muckala (Mandy Moore, Joy Williams) rounded out the team. Each producer also contributed his significant songwriting talents.\n\nOne track, &quot;The Prodigal Song,&quot; written by Heil with Cooper and Regie Hamm addresses the choice each of us has to blame God or trust Him. &quot;This song is just another reminder of how much He loves us and how we underestimate Him,&quot; Heil says. \n\nHeil also co-wrote &quot;Never Forget You,&quot; a track about healing that hits close to home. &quot;It's a reminder to never take for granted all he's done for us,&quot; Heil says. In fitting contrast, &quot;You Are,&quot; penned by Heil, Cooper and Chad Cates, simply celebrates all God is. \n\nPeople underestimate this generation, Heil says, and that's why you won't find Sonicflood delivering a message that's watered down. &quot;We want to bring the truth and what's real. Our enemy is hard at work. There's no time to play around.&quot; \n\n\n\nTORRENTED BY:\n\nTorrent Tracts, April 2009\n","torrent":{"xt":"urn:btih:b92dacb488ee8dd4e5a9b873a3016162804f12af","amp;dn":"Sonicflood+-+2004+-+This+Generation","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b92dacb488ee8dd4e5a9b873a3016162804f12af","infoHashBuffer":{"type":"Buffer","data":[185,45,172,180,136,238,141,212,229,169,184,115,163,1,97,98,128,79,18,175]},"announce":[],"urlList":[]}}