{"title":"Poets Before Homer (2015).pdf Gooner","uid":12637680,"size":55468318,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b95d4e0e839f7579d6439913ef91ec3a82926eed&amp;dn=Poets+Before+Homer+%282015%29.pdf+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1445949022,"description":"Poets Before Homer - Collected Essays on Ancient Literature (2015).pdf Gooner\r\n\r\nPublisher: Eisenbrauns (February 18, 2015)\r\nLanguage: English\r\nISBN-10: 1575063409\r\nISBN-13: 978-1575063409\r\n\r\n&quot;What is the most interesting and impressive sort of archaeological object from the ancient Near East? ... I would invite you to think about artifacts recovered by archaeology that are ... more insubstantial even than a lacy papyrus. I refer to things made of words. I am not thinking of texts, exactly, but to the building blocks of which literary texts are made, to traditional metaphors and similes, to traditional topics in poetry and prose, to the devices of form and content which were the stock in trade of poets.&quot; This is from the title essay of this volume which collects and reprints many of Delbert R. Hillers's most important published essays and articles, his long out-of-print Treaty-Curses and the Old Testament Prophets, and three previously unpublished essays, including the aforementioned &quot;'Poets Before Homer': Archaeology and the Western Literary Tradition.&quot; Hillers gave the latter as the 1992 William Foxwell Albright Lecture at The Johns Hopkins University and in it uses Ernst Robert Curtius's European Literature and the Latin Middle Ages, with its &quot;topological&quot; method, as a model for exploring the connections of the most ancient Near Eastern literatures (including the Bible) to later Western literature. Though one of his latest pieces of writing, &quot;Poets Before Homer&quot; represents, as Hillers himself recognized, a fairly clear statement of what he had been doing in much of his earlier scholarship and the volume collects the best of this earlier scholarship. Most of these essays work themselves out from a particular passage, theme, topos, image, or grammatical issue, and gain their interpretive vantage point by reading said passage, etc. comparatively, whether in light of relevant ancient Near Eastern and/or more recent European literary parallels or with reference to some more theoretical interest, such as modern linguistic theory. Hillers's habit of mind ran toward the particular, toward the individual detail. His genius if this word may be used was in his capacity to seize upon one aspect of some larger entity, problem, or topic, to work it through, thoroughly and, as often as not, decisively, all the while resisting the temptation to take up the larger, perhaps un(re)solvable complex of which the detail or problem was but a part. The worked example is the Hillersian trademark &quot;exemplum followed by moralisatio&quot; and Poets Before Homer collects all of his best","torrent":{"xt":"urn:btih:b95d4e0e839f7579d6439913ef91ec3a82926eed","amp;dn":"Poets+Before+Homer+%282015%29.pdf+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b95d4e0e839f7579d6439913ef91ec3a82926eed","infoHashBuffer":{"type":"Buffer","data":[185,93,78,14,131,159,117,121,214,67,153,19,239,145,236,58,130,146,110,237]},"announce":[],"urlList":[]}}