{"title":"Woman's Day - May 2013 (gnv64)","uid":8381421,"size":47237829,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b97bec6c58954567388376015fc5e702f302cdb6&amp;dn=Woman%27s+Day+-+May+2013+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"gnv65","files":-1,"time":1366176364,"description":"Woman's Day - May 2013 (no ADS)\nENGLISH PDF 100 pages 46.3 mb\n\nON THE COVER\n30 Ways to Save on Food, Beauty and Around the House 149\nTacos! New Twists on Beef and Chicken 84\nFoods That Fight Wrinkles 68\nCan't Sleep? Snooze How-Tos 132\nEnd P aper Clutter! Easy Tricks 42\nGifts for Mom 24\nCOVER RECIPE TACOS 84\nPhotograph by Jonny Valiant\nFood styling by Carrie Purcell\nProp styling by Gerri Williams\n\nEmbrace the Day\n20 COMMUNITY BUILD SOME HOMETOWN PRIDE! By Catherine Strawn\n24 LITTLE INDULGENCES FUN FINDS Gifts for Mom.\n26 MAKING A DIFFERENCE RECIPE FOR CHANGE A chef helps kids channel conflict into cuisine.\n28 THE ORDINARY CLEVER USES FOR OLIVE OIL\n30 LIFE LESSONS OF VALUE Katie's budget wisdom.\n32 INSPIRING WOMEN BREAK OUT OF YOUR RUT! Four women make changes that stick. By Nina Malkin\n\nAt Home\n41 FILL UP A ... VASE Pretty options to hold spring flowers, all for under $40.\n42 FEATURE PROJECT DECLUTTER Helpful ways to organize work and creative space, as shown by WD's home organizing expert.\n50 DIY DECOR PRETTY PRINTED PILLOWS A simple way to make creative cushion covers.\n52 HOME SAVINGS CUT LAWN-CARE COSTS How to keep your yard looking great in eight easy steps. By Camille Rankin\n\nYour Style\n59 BEAUTY NEWS All-purpose eye creams (and a smart tip on how to store them), floralscented products, and more.\n62 LOVE YOUR AGE AMAZING LEGS Simple, no-surgery strategies to camouflage cellulite and veins.\n66 FEATURE SUMMER SKINCARE GUIDE Tips for healthy, glowing skin.\n74 STYLE STEALS BARGAIN HUNTRESS Cute, comfy flats and more from style editor Donna Duarte-Ladd.\n76 SHOP YOUR CLOSET START WITH: KHAKIS This versatile pant can be styled to fit any occasion\n\nCookbook\n83 RHUBARB HAND PIES\n84 FEATURE MIX 'N' MATCH TACOS Whip up these tasty fillings and sides.\n92 FEATURE SO HAPPY TOGETHER Wonderful Mother's Day lunch menu.\n100 COMFORT FOOD POTATO AND ARTICHOKE GRATIN The Casserole Queens make the perfect side dish.\n104 EASY EVERYDAY COOKING WEEKNIGHT DINNERS\n114 MAY MENU WHAT'S FOR DINNER? This month's meals.\n172 COOKING WITH LOVE MADE FOR SHARING A potluck pasta salad turns into a go-to reader recipe.\n\nHealthy You \n117 HEALTH NEWS Wake up allergy-free, prevent diabetes, and more.\n126 FEATURE LISTEN TO YOUR BODY Six surprising health symptoms you shouldn't ignore. By Leslie Goldman\n132 LIVE LONGER &amp; STRONGER SLEEP BETTER TONIGHT Not a dream: heart-healthy slumber every night. By Sara Reistad-Long\n134 HEALTH SQUAD ERASE YOUR PAIN Ease aches pill-free. By Alyssa Shaffer\n137 PATH TO HEALTH &quot;I LOST 75 POUNDS!&quot; Stress eating gone, confidence gained.\n138 NUTRITION THE TRUTH ABOUT SOY The latest on this protein-filled food. By Joy Bauer, RD\n\nMoney\n143 FEATURE MAKE EXTRA CASH NOW! A guide to microjobs: Bring in bucks with work that suits your schedule.By Donna Freedman\n149 FEATURE GREAT VALUE AWARDS Find savings and reliability in products chosen by WD editors and tested by readers.\n158 INSIDE SCOOP 7 THINGS YOUR FLIGHT ATTENDANT WANTS YOU TO KNOW By Tracy Saelinger By Leslie Goldman\n160 SMALL CHANGE FAST,EASY FINANCIAL FIX This month: Make a will By MP Dunleavey\n\nLove Your Pet \n165 PET FRIENDLY A guide to freshwater fish, by Kathryn AttinelLo, plus treats and tips for cats and pups.\n166 PET TALES CANINE CAREGIVER Toby, a shelter dog, loves to deliver comfort to those in need.\n\nIn Every Issue  \n10 EDITOR'S LETTER\n12 MAILBOX\n14 CALENDAR OF SAVINGS\n170 PUZZLES","torrent":{"xt":"urn:btih:b97bec6c58954567388376015fc5e702f302cdb6","amp;dn":"Woman%27s+Day+-+May+2013+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b97bec6c58954567388376015fc5e702f302cdb6","infoHashBuffer":{"type":"Buffer","data":[185,123,236,108,88,149,69,103,56,131,118,1,95,197,231,2,243,2,205,182]},"announce":[],"urlList":[]}}