{"title":"Big Boys - Where's My Towel/Industry Standrd","uid":8552168,"size":66704639,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b99fc4fdf7cf478fa3ea412f6c3bcf79be5e7607&amp;dn=Big+Boys+-+Where%27s+My+Towel%2FIndustry+Standrd&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GGPriest","files":12,"time":1370668852,"description":"Big Boys - Where's My Towel/Industry Standard\n1981\nAustin, TX punk\nLight in the Attic Records (http://www.lightintheattic.net)\n\nAll tracks .mp3 320 kbps. Digital download redeemed after purchase of vinyl.\n\nTrack listing:\n1. &quot;Security&quot;   0:53 \n2. &quot;T.V.&quot;   2:26 \n3. &quot;I Don't Wanna Dance&quot; 2:04 \n4. &quot;Identity Crisis&quot;   1:48 \n5. &quot;Thin Line&quot; 3:31 \n6. &quot;Advice&quot; 1:07 \n7. &quot;Complete Control&quot;   3:10 \n8. &quot;Work Without Pay&quot; 2:34 \n9. &quot;Spit&quot;   3:11 \n10. &quot;Act/Reaction&quot;   2:36 \n11. &quot;Self Contortion&quot;   2:05 \n12. &quot;Wise Up&quot; 1:15 \n\nFrom Wiki:\nThe Big Boys were a pioneering band who are credited with helping introduce the new style of hardcore punk that became popular in the 1980s. \n\nIndustry Standard (usually extended to Where's My Towel/Industry Standard) is the debut studio LP by the American punk rock band Big Boys. It was released in 1981 on vinyl through Wasted Talent Records, operated by members of the Judy's. In 2004, the record was reissued on vinyl by Red C Records. It has never been officially released on cassette or CD, although it appears in its entirety on The Skinny Elvis, a retrospective multi-format compilation released by Touch and Go in 1993. The album's title and many of its themes were inspired by a growing dissatisfaction with elements of the Austin, Texas punk rock scene from which the Big Boys had spawned.\n\nIn 1980, the infamous Austin club Raul's was sold to Steve Hayden, who implemented several policies that conflicted with the band's ideology, including the banning of cover songs to avoid paying publishing fees. Hayden funded the release of Live at Raul's Club, a split LP with fellow Austin punk rock band the Dicks, hoping the Big Boys' side would receive radio airplay based on its comparatively mild lyrical content. According to guitarist Tim Kerr, Hayden repeatedly justified his management decisions by claiming conformation to an industry standard.The song Complete Control explored the band's relationship with Hayden. Spit was written about another local club, whose owner refused to let them play an agreed upon second set, claiming their stage presence distracted customers from purchasing alcohol. Following the recording of Industry Standard with producer David Bean of The Judy's, the second title Where's My Towel was added to the sleeve after a friend of the band described Kerr's cover artwork with the phrase.\n\n**\n\nSeed like a motherfucker, and remember to support your local record store.","torrent":{"xt":"urn:btih:b99fc4fdf7cf478fa3ea412f6c3bcf79be5e7607","amp;dn":"Big+Boys+-+Where%27s+My+Towel%2FIndustry+Standrd","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b99fc4fdf7cf478fa3ea412f6c3bcf79be5e7607","infoHashBuffer":{"type":"Buffer","data":[185,159,196,253,247,207,71,143,163,234,65,47,108,59,207,121,190,94,118,7]},"announce":[],"urlList":[]}}