{"title":"Pete Brown &amp; Piblokto!-Thousands On A Raft(1970)(2009 REPUK Rem.","uid":4769000,"size":352313274,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b9a676dfd9342e2f5c71cdb2e354b3587b7b6419&amp;dn=Pete+Brown+%26+Piblokto%21-Thousands+On+A+Raft%281970%29%282009+REPUK+Rem.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"thewall68","files":22,"time":1236975220,"description":"Releaser: thewall\n\nExtractor: EAC 0.99 prebeta 4  \nRead Mode: Secure with NO C2, accurate stream, disable cache.\nCodec: Flac 1.2.1;  Level 8  \nSource: Original CD \nArtwork:  Full Scans 300dp.\n\n\nAfter the relatively lightweight 'Things May Come And Things May Go But The Art School Dance Goes On Forever' Pete Brown and Piblokto! produced this much heavier rocker in 1971. 'Aeroplane Head Woman', with its heavy guitar riff, could have come from Deep Purple and the title song, 'Thousands On A Raft', with mock-serious lyrics and a very catchy chorus wouldn't have been out of place on Jack Bruce's Songs For A Tailor. The musicianship is excellent, particularly from the fine young guitarist Jim Mullen and respected percussionist Rob Tait. Brown's songwriting is, as always, lyrically amusing, clever, and just plain weird. Melodically it is as strong as Brown's previous two efforts, but just let down a bit by the overlong jamming on 'Highland Song'. Overall it is an excellent example of eccentric British rock music from the early 70's and I will love it forever!\n\n\nMusically it was some good jazz-rock, with the emphasis not always on Brown's vocals and elliptical lyrics, as Jim Mullen's &quot;Highland Song&quot; offered an inventive, lengthy instrumental as the disc's centerpiece. The title cut has a Pink Floyd edge, surprising given Brown's predilection for jazz and blues, but it works well in the context. Guitarist Mullen is co-writer throughout, while the rhythm section of Rob Tait and Steve Glover swing rather than plod. &quot;Station Song Platform Two&quot; employs Mellotron to full prog rock effect, while &quot;Got a Letter from a Computer&quot; seems eerily ahead of its time for the early '70s. This was the last gasp of this incarnation of Piblokto!, but there's no doubt they went out on a high note. ~ Chris Nickson, All Music Guide\n\n\n\n1 Aeroplane Head Woman \t  \t\t\n \n2 Station Song Platform Two \t  \t\t\n \n3 Highland Song \t  \t\t\n \n4 If They Could Only See Me \t  \t\t\n \n5 Got a Letter from a Compu \t  \t\t\n \n6 Thousands on a Raft\n\n\n","torrent":{"xt":"urn:btih:b9a676dfd9342e2f5c71cdb2e354b3587b7b6419","amp;dn":"Pete+Brown+%26+Piblokto%21-Thousands+On+A+Raft%281970%29%282009+REPUK+Rem.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b9a676dfd9342e2f5c71cdb2e354b3587b7b6419","infoHashBuffer":{"type":"Buffer","data":[185,166,118,223,217,52,46,47,92,113,205,178,227,84,179,88,123,123,100,25]},"announce":[],"urlList":[]}}