{"title":"After Everest - Inside the Private World of Edmund Hillary.epub","uid":8979946,"size":1134758,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ba445037fe31b5b8b8200ebfe22aef8e6953d127&amp;dn=After+Everest+-+Inside+the+Private+World+of+Edmund+Hillary.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Agricola","files":-1,"time":1380537893,"description":"After Everest - Inside the Private World of Edmund Hillary\n\nAuthor - Paul Little\n\nFormat - epub\n\n\n\nA fascinating exploration of the life of mountaineer and adventurer Edmund Hillary, penetrating beyond the legend to reveal a character of paradoxes\n\nEdmund Hillary is a world icon and a towering figure among adventurers. The interest in him and in his familys dedication to making a contribution to the welfare of the Nepalese people is well known. However, it is the drama of Sir Edmunds later years that throw light into the world of the private man, the death of his wife and daughter in an air crash, his remarriage to the widow of an old friend, and, finally, the falling out, after his own death, of his widow and his eldest son, Peter. All these stories of the Hillary legacy, and the many books written about his life, are about what he did, but this book explores who Edmund Hillary was and the many paradoxes of his character, the individualist who always worked with a team, the lonely boy who ended up loved by millions, the man who could be distant from his own children but is regarded as a surrogate father by thousands of Nepalese, and the left-leaning thinker who accepted the highest order of chivalry from Queen Elizabeth II. This is the story of the man behind the legend.","torrent":{"xt":"urn:btih:ba445037fe31b5b8b8200ebfe22aef8e6953d127","amp;dn":"After+Everest+-+Inside+the+Private+World+of+Edmund+Hillary.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba445037fe31b5b8b8200ebfe22aef8e6953d127","infoHashBuffer":{"type":"Buffer","data":[186,68,80,55,254,49,181,184,184,32,14,191,226,42,239,142,105,83,209,39]},"announce":[],"urlList":[]}}