{"title":"Henry VIII - The Mind of a Tyrant   (David Starkey - Complete)","uid":8854250,"size":1647532998,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:bb1ce8a33c94ec88c0a14b04389ef1e829d3a82d&amp;dn=Henry+VIII+-+The+Mind+of+a+Tyrant+++%28David+Starkey+-+Complete%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Robin1966","files":13,"time":1377609926,"description":"Henry VIII: The Mind of a Tyrant\n(Channel 4: the 4 parts were broadcast on 6 April 2009, 13 April 2009, 20 April 2009, 27 April 2009)\n\nThe documentary is presented by British historian David Starkey specialized in the Tudor era.\n\n1/4 - Prince (1485-1509)\n\nTo mark the 500th anniversary of Henry VIII's accession to the throne, David Starkey travels across Europe to understand the inner life of this feared English king. In this episode David Starkey follows the dramatic events of Henry's childhood, events that shaped his personality and his attitude to kingship.\n\nIn 1485, on the field at Bosworth, Henry's father, Henry Tudor, seized the crown from the defeated Yorkist king Richard III. To us, this event marks the end of the Wars of the Roses but to contemporaries it was not clear that this bitter dynastic struggle was truly over. Henry, Tudor's second son, was created Duke of York to link the royal house to the defeated faction.\n\nBut Henry had a rival in the shape of Perkin Warbeck, who claimed to be the real Duke of York and rightful king. Henry Tudor would have to defend his throne twice in battle, and his son's life depended on the outcome.\n\nThe death of his brother Arthur made Henry Prince of Wales, and his father's heir and rival.\n\n2/4 - Warrior (1509-1525)\n\nHenry's father had won and defended the crown in battle. For Henry, this was the mark of true regal legitimacy and he was determined to emulate his father and win even greater glory. However, to wage war Henry had to free himself from the councillors he had inherited from his father and be his own man.\n\nStarkey traces Henry's quest to become a major player in Europe, his successes at the Battle of the Spurs and the Field of the Cloth of Gold and his eventual humiliation after the Battle of Pavia.\n\nThroughout these years, his relationship with the brilliant, Machiavellian Thomas Wolsey was central to his reign. But even Wolsey could not disguise the relative impotence of England and her monarchy compared to the great European powers.\n\nThese foreign disappointments were mirrored by the gradual deterioration in Henry's marriage. If Henry had died, like so many, of the sweating sickness in 1525, he would have barely registered in history, his reign a feeble coda to the story of England's medieval monarchy.\n\nBut events were about to take an extraordinary turn. Henry would remake himself, his throne and his kingdom - and all for love.\n\n3/4 - Lover (1526-1536)\n\nThis episode traces Henry's ten-year affair with Anne Boleyn. Henry began to pursue Anne in early 1526. As lust turned to love, he conceived the idea of marrying her. But that required a Papal annulment of his marriage to Catherine.\n\nDavid Starkey's research in the Vatican archives has revealed the real story of Henry's futile six-year struggle to get what he wanted from Rome.\n\nDuring this time, and prompted by Anne, Henry began to re-think the nature of the English monarchy. He came to believe that the King, not the Pope, should rule the Church in England. The result was the break with Rome, a new wife for Henry, and a new religion for his subjects.\n\nBut the marriage did not last. Henry's court had always been a dangerous place, and when Queen Anne turned against Thomas Cromwell, Henry's chief minister, Cromwell knew that he had to move against her to save himself. He manipulated Henry's naturally suspicious nature to engineer Anne's execution. Money and power had triumphed over love.\n\n4/4 - Tyrant (1533-1547)\n\nThe final programme in the series examines how Henry, having inherited a chronically weak English crown, forged it into an instrument of unprecedented power, and then wielded it to change forever the nature of England and the English.\n\nThe courtiers who had helped Cromwell dispatch Anne Boleyn hoped that the schism with Rome would now be reversed. They were soon disappointed. The destruction of the monasteries proceeded apace, with the loot flowing into Henry's coffers.\n\nBut such unprecedented actions caused isolation abroad and rebellion at home. Henry's response showed him at his most duplicitous and ruthless. Meanwhile, Henry's private life was hardly less turbulent.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:bb1ce8a33c94ec88c0a14b04389ef1e829d3a82d","amp;dn":"Henry+VIII+-+The+Mind+of+a+Tyrant+++%28David+Starkey+-+Complete%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bb1ce8a33c94ec88c0a14b04389ef1e829d3a82d","infoHashBuffer":{"type":"Buffer","data":[187,28,232,163,60,148,236,136,192,161,75,4,56,158,241,232,41,211,168,45]},"announce":[],"urlList":[]}}