{"title":"Marian Keyes - The Mystery Of Mercy Close.rar","uid":8106476,"size":1514874,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:bb747382d9fda6316d280b90fb14da896fb02359&amp;dn=Marian+Keyes+-+The+Mystery+Of+Mercy+Close.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rafay12","files":1,"time":1360086889,"description":"[img]http://i.imgur.com/kehQg.jpg?1[/img]\n\n[b]Marian Keyes: The Mystery of Mercy Close\nAZW3 &amp; ePub\n\nMarian Keyes, the No. 1 bestselling author of Rachel's Holiday, is back with her stunning new novel The Mystery of Mercy Close and the return of the legendary and beloved Walsh sisters.\n.\nHelen Walsh doesn't believe in fear - it's just a thing invented by men to get all the money and good jobs - and yet she's sinking. Her work as a Private Investigator has dried up, her flat has been repossessed and now some old demons have resurfaced.\n.\nNot least in the form of her charming but dodgy ex-boyfriend Jay Parker, who shows up with a missing persons case. Money is tight and Jay is awash with cash, so Helen is forced to take on the task of finding Wayne Diffney, the 'Wacky One' from boyband Laddz.\n.\nThings ended messily with Jay. And she's never going back there. Besides she has a new boyfriend now, the very sexy detective Artie Devlin and it's all going well. But the reappearance of Jay is stirring up all kinds of stuff she thought she'd left behind.\n.\nPlaying by her own rules, Helen is drawn into a dark and glamorous world, where her worst enemy is her own head and where increasingly the only person she feels connected to is Wayne, a man she's never even met.\n.\nUtterly compelling, moving and very very funny, The Mystery of Mercy Close is unlike any novel you've ever read and Helen Walsh - courageous, vulnerable and wasp-tongued - is the perfect heroine for our times.\n.\nCan't wait for The Mystery of Mercy Close? Discover more about the Walsh family in Marian's brilliant ebook short Mammy Walsh's A-Z of the Walsh Family, out now.\n.[/b]\n\nEnjoy &amp; Please Seed","torrent":{"xt":"urn:btih:bb747382d9fda6316d280b90fb14da896fb02359","amp;dn":"Marian+Keyes+-+The+Mystery+Of+Mercy+Close.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bb747382d9fda6316d280b90fb14da896fb02359","infoHashBuffer":{"type":"Buffer","data":[187,116,115,130,217,253,166,49,109,40,11,144,251,20,218,137,111,176,35,89]},"announce":[],"urlList":[]}}