{"title":"IRIS Harrier and F-35B Patched for FSX -- Working VTOL","uid":4836847,"size":111732980,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:bbc2ca6ded234802f03728cc1a7c1a0d901072d1&amp;dn=IRIS+Harrier+and+F-35B+Patched+for+FSX+--+Working+VTOL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bfifteenv","files":5,"time":1239354173,"description":"This torrent includes:\n\nIris Harrier for FS2004 patched to work in FSX.\n\nIris F-35B for FS2004 patched to work in FSX.\n\nFSUIPC 4.30+serial required to make the VTOL function work.\n\n\nPLUS\n\nThe patches to make the VTOL and gauges work in FSX if you have already have the original FS2004 planes. These are in separate .zip files so you can pick and chose what you need to make them work and don't bother DLing the rest.\n\n\nMake sure have FSUPIC 4.0 or higher to make the VTOL work. The patched gauges will work in FSX without FSUIPC, but you won't be able to take off or land vertiacally without FSUIPC.\n\nYou will need to restart FSX and maybe even reboot your system after installing FSUIPC to get it work right.\n\n\n*****IF you use the add-ons in this torrent, they are already patched, they should need no further modification to work in FSX.***** \n\nThe read-me files are there and assume that you are patching the files, but once again THESE FILES ARE ALREADY PATCHED! Don't bother patching them if you use the add-on aircraft included in this torrent. The patch files are just there for those that have already downloaded the original FS2004 aircraft.\n\n\nRead the read-me files anyway, because they contain tips on setting up and flying the aircraft in FSX. \n\nBasically you need to tweak the weight sometimes to get the VTOL to function properly - the readme files explain it better. You can use the FUEL AND PAYLOAD menu in the FREE FLIGHT menu inside FSX to adjust the aircraft weight by changing the fuel load.\n\n\nBoth of these are nice flying aircraft and work as they should -- VTOL, all the gauges, etc. They also take off and land like conventional planes if you want to do it that way too.\n\n\n\nNone of this is my original work. All I did was download the aircraft torrents from TPB, hunted down the patches, patched the aircraft, and packaged them with FSUIPC (also from TPB) to put them all in one place for you one-stop-shopping convenience.\n\nDon't thank me, thank the original uploaders.\n\n\nHappy flying!","torrent":{"xt":"urn:btih:bbc2ca6ded234802f03728cc1a7c1a0d901072d1","amp;dn":"IRIS+Harrier+and+F-35B+Patched+for+FSX+--+Working+VTOL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bbc2ca6ded234802f03728cc1a7c1a0d901072d1","infoHashBuffer":{"type":"Buffer","data":[187,194,202,109,237,35,72,2,240,55,40,204,26,124,26,13,144,16,114,209]},"announce":[],"urlList":[]}}