{"title":"Killing Lincoln by Bill O'Reilly","uid":13022959,"size":218595243,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:bcc76fe5d1370f4bc83ac25894fa9343069f857c&amp;dn=Killing+Lincoln+by+Bill+O%27Reilly&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":104,"time":1450374540,"description":"Killing Lincoln by Bill O'Reilly - Audiobook (2011) ACC 65kbps unabridged 104 files.torrent\r\n\r\n104 .m4a files\r\ntracks 001 - 104\r\n\r\nKilling Lincoln: The Shocking Assassination that Changed America Forever\r\n\r\nA riveting historical narrative of the heart-stopping events surrounding the assassination of Abraham Lincoln, and the first work of history from mega-bestselling author Bill O'Reilly\r\n\r\nThe anchor of The O'Reilly Factor recounts one of the most dramatic stories in American history―how one gunshot changed the country forever. In the spring of 1865, the bloody saga of America's Civil War finally comes to an end after a series of increasingly harrowing battles. President Abraham Lincoln's generous terms for Robert E. Lee's surrender are devised to fulfill Lincoln's dream of healing a divided nation, with the former Confederates allowed to reintegrate into American society. But one man and his band of murderous accomplices, perhaps reaching into the highest ranks of the U.S. government, are not appeased.\r\n\r\nIn the midst of the patriotic celebrations in Washington D.C., John Wilkes Booth―charismatic ladies' man and impenitent racist―murders Abraham Lincoln at Ford's Theatre. A furious manhunt ensues and Booth immediately becomes the country's most wanted fugitive. Lafayette C. Baker, a smart but shifty New York detective and former Union spy, unravels the string of clues leading to Booth, while federal forces track his accomplices. The thrilling chase ends in a fiery shootout and a series of court-ordered executions―including that of the first woman ever executed by the U.S. government, Mary Surratt. Featuring some of history's most remarkable figures, vivid detail, and page-turning action, Killing Lincoln is history that reads like a thriller","torrent":{"xt":"urn:btih:bcc76fe5d1370f4bc83ac25894fa9343069f857c","amp;dn":"Killing+Lincoln+by+Bill+O%27Reilly","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bcc76fe5d1370f4bc83ac25894fa9343069f857c","infoHashBuffer":{"type":"Buffer","data":[188,199,111,229,209,55,15,75,200,58,194,88,148,250,147,67,6,159,133,124]},"announce":[],"urlList":[]}}