{"title":"Coast to coast AM 2011-05-15 Survivalism &amp; Magic","uid":6400238,"size":56636700,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:bd5debc630e1eb0823630faf9b11682cb40c47e7&amp;dn=Coast+to+coast+AM+2011-05-15+Survivalism+%26+Magic&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mscowlove","files":5,"time":1305640376,"description":"Date: 05-15-11 \nHost: George Knapp \nGuests: Blake Sawyer, George Patton Jr. \nIn the first half, survival expert and health guru, Blake Sawyer, argued that the United States will no longer be a viable place to live, and people should consider immigrating to locations in the less populated Southern Hemisphere. Whether through war, disease, famine, natural disasters, or ruthless government, he predicted that 95% of those who remain in the US will be dead in the next 5-15 years. America has been targeted by the &quot;globalists&quot; to be taken out, he added. \n\nSawyer noted that the United States ranks highest in violent crime, and that countries in the Southern Hemisphere are much more tranquil. In particular, he highlighted nations in the southern region of South America as being good choices for survivability, specifically Chile, Uruguay, Argentina, and Ecuador. &quot;I...believe that the average American does not know that they're the frog in cold water, and they think they're OK, and they're now boiling,&quot; he declared. \n\n------------------\n\n\nIn the latter half, author and historian George Patton Jr. (book link) talked about the life and times of Black Herman, a popular magician from the early 1900's who was one of the first to use mentalism and hypnosis as part of his stage act. Patton was inspired to write his book about Black Herman, when he learned that the magician was actually his great uncle, Benjamin Rucker. His unique shows, which traveled across the country, combined European magic with African hoodoo, folk religion, and gospel. \n\nHe invented a type of levitation trick (subsequently portrayed in the 1939 movie Charlie Chan at Treasure Island), as well as a buried alive trick, that involved hypnotizing his wife so that she wouldn't suffer ill effects from being buried in a coffin six feet under for six hours, Patton recounted. In the 1920s, Black Herman moved to a Harlem mansion, where he set up a sÃƒÂ©ance room, and had a dark vision of a decaying New York City which he interpreted as the 'end of days,' when actually it may have been pointing toward the great crash of '29. Patton also works as an independent investment advisor, and makes blog postings at BostonWealth.net. \n\nWebsite(s): \nsurvivewithcoasttocoast.com\nBook(s): \nBlack Jack\n","torrent":{"xt":"urn:btih:bd5debc630e1eb0823630faf9b11682cb40c47e7","amp;dn":"Coast+to+coast+AM+2011-05-15+Survivalism+%26+Magic","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd5debc630e1eb0823630faf9b11682cb40c47e7","infoHashBuffer":{"type":"Buffer","data":[189,93,235,198,48,225,235,8,35,99,15,175,155,17,104,44,180,12,71,231]},"announce":[],"urlList":[]}}