{"title":"Assassins Creed 2 *[100%+FINAL CRACK]*","uid":5511147,"size":6796989027,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:bde1daf1c0991bc8a857f00d039acc6b4d28df7e&amp;dn=Assassins+Creed+2+%2A%5B100%25%2BFINAL+CRACK%5D%2A&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"SmallOne95","files":248,"time":1272057208,"description":"This One worked for my and all my friends, IMPORTANT READ THE AC2 Install Guide FIRST Otherwise you will fuck it up..\n\nHere is how I got the game to work. Step by step.\n\n1.Download the game from this torrent.\n\n2.Disable ur internet connection to prevent any auto update's\n\n3.Install the game using deamon tools(Or Something like that).\n\n4.Once the game is installed DO NOT APPLY CRACK OR START THE GAME\n\n5.In the Crack folder in Map 1 is a file called: InstallAC2Crack , Double click on InstallAC2Crack and install it to the directory where you installed the game. \n\n6.In the Crack folder in map 2 is a file called: Values , place it to the directory where you installed the game. \n\n7.In the Crack folder in map 3 are some more files which you have to place in a map on your C Drive, so not where you installed the game: C:Program Files (x86)UbisoftUbisoft Game Launcher\nIf you cant find that map just search for Ubisoft Game laucher on your C Drive and place the files there(its the same map as this one (C:Program Files (x86)UbisoftUbisoft Game Launcher) but maby the map is called different i mean the Program Files ''thing''). \n\n8.On your desktop there should be a shortcut called Play Assassin's Creed II , Double click on that icon.(if you want to change the name from Play Assassin's Creed II to Assassin's Creed II(2) you have to go to your installed map and search for this file: AC2.Launcher_update ,\nand make a shortcut of it and place it on your desktop ;-). )\n\n9.Log in with any username u seem fit , IT IS NOT REQUIRED TO PRESS THE REGISTER NOW BUTTON. Once you have logged in you will be able to play the game!. Do not forget the user name and password you entered as this will be used to continue your progress in the game.\n\n10.There is place where Leonardo will give u the blade and the game stands still and you think its not gonna work any more. JUST PRESS NUMBER 2 ON YOUR KEYBOARD AND THE GAME WILL CONTINUE!\n\nEND\n\nP.S. this is how I got the game to work and it is not guarranted it will work for you and there might be other ways to get it to work as well.\n\nThis Guide is made by someone else but i made it a bit more User Friendly. ;)\n\nHAVE FUN!!!\n\np.s. This Guide is in the download file too;)\n\nGrtz SmallOne\n\n\n","torrent":{"xt":"urn:btih:bde1daf1c0991bc8a857f00d039acc6b4d28df7e","amp;dn":"Assassins+Creed+2+%2A%5B100%25%2BFINAL+CRACK%5D%2A","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bde1daf1c0991bc8a857f00d039acc6b4d28df7e","infoHashBuffer":{"type":"Buffer","data":[189,225,218,241,192,153,27,200,168,87,240,13,3,154,204,107,77,40,223,126]},"announce":[],"urlList":[]}}