{"title":"Oops.Wrong.Planet.2008.SWESUB.VERTA(diagnos asperger)","uid":12807662,"size":689212859,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:beb3aa01ddc5de645225bc5e5f20b713c5e078f3&amp;dn=Oops.Wrong.Planet.2008.SWESUB.VERTA%28diagnos+asperger%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"verta.king","files":3,"time":1448141841,"description":"Oj, fel planet\r\n\r\nAtt leva med Asperger.\r\n\r\n\r\nFilmen undersöker hur Aspergervärlden, en ensam och isolerad värld som tidigare var synonym med nördar, nu har blivit en del\r\nav den moderna världen tack vare bland annat den digitala utvecklingen. Detta medför ibland vissa utmaningar då \r\nmajoriteten av befolkningen kan uppfatta personer med Aspergers som envisa, oflexibla, och oförutsägbara.\r\n\r\nI HC Andersens saga Den fula ankungen flyr ankungen från de retsamma hönorna, ankorna och drängarna för att istället hamna\r\npå en annan gård som styrs av en katt och en höna. De berättar för ankungen att det finns två världar,\r\nden normala och legitima världen som bebos av dem, och en lite sämre värld, vilken han tillhör.\r\n\r\nEnligt autismexperten Professor Michael Fitzgerald led HC Andersen av en lindrig form av autism som kallas\r\nAspergers syndrom och Den fula ankungen är en allegori om Andersens egna liv.\r\n\r\nFitzgerald menar att de två världar som Andersen ofta skildrar i sina sagor är de som han själv upplevde; den stora, grymma världen\r\nmed normala personer med sociala förmågor och den autistiska världen som var mer excentrisk och ensam. \r\nHan säger att många av Andersens sagor handlar om olika aspekter av Aspergers syndrom; Den lilla flickan med svavelstickorna, \r\nDen ståndaktige tennsoldaten och Kejsarens nya kläder.\r\n\r\nMed hjälp av animationer tittar filmen närmre på fyra av Andersens sagor och visar hur de belyser olika teman i hans eget liv\r\noch Aspergers syndrom, och varvar det med dagens Aspergare och människorna runt omkring dem. Filmen undersöker också tanken \r\nom att ett stort antal historiska genier, från Isaac Newton till Andy Warhol, led av Asberger.\r\n\r\nSlutligen gör Dr James Watson ett försök att utrota autismgenen från vår framtida genpool. Hans experiment är dock föremål för\r\n kritik eftersom det skulle innebära att en viktig del av befolkningen försvann, nämligen nördar, genier och whistleblowers´.\r\n\r\nOriginaltitel: Oops, Wrong Planet.\r\n\r\nProduktionsår: 2008.\r\n\r\nDo it for aspie friends","torrent":{"xt":"urn:btih:beb3aa01ddc5de645225bc5e5f20b713c5e078f3","amp;dn":"Oops.Wrong.Planet.2008.SWESUB.VERTA%28diagnos+asperger%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"beb3aa01ddc5de645225bc5e5f20b713c5e078f3","infoHashBuffer":{"type":"Buffer","data":[190,179,170,1,221,197,222,100,82,37,188,94,95,32,183,19,197,224,120,243]},"announce":[],"urlList":[]}}