{"title":"Millenium 2 DVD-Screener Spanish Line 2009","uid":5185770,"size":1460083436,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:bf233ffd40551a60893329c59af7486eb9a38141&amp;dn=Millenium+2+DVD-Screener+Spanish+Line+2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mois20","files":2,"time":1259454018,"description":"Lisbeth Salander es la mujer mÃƒÂ¡s buscada del paÃƒÂ­s. Dos colaboradores de Millennium, a punto de sacar a la luz un escÃƒÂ¡ndalo sobre el comercio sexual en Suecia, han sido brutalmente asesinados y las huellas de Lisbeth estÃƒÂ¡n en el arma homicida, lo que aÃƒÂ±adido a su historial de comportamiento vengativo e impredecible, la convierten oficialmente en un peligro para la sociedad. Sin embargo, nadie puede encontrarla. Mientras, Mikael Blomkvist, editor jefe de Millennium, no cree lo que se dice en las noticias y sabiendo que Salander es feroz cuando se siente amenazada, estÃƒÂ¡ desesperado por encontrarla antes de que la acorralen. A medida que encaja las piezas del puzzle, Blomkvist se enfrentarÃƒÂ¡ a peligrosos criminales incluyendo al gigante rubio, un temible y enorme matÃƒÂ³n incapaz de sentir dolor. Blomkvist saca tambiÃƒÂ©n a la luz algunos datos desgarradores sobre el pasado de Salander. Puesta en manos de instituciones psiquiÃƒÂ¡tricas desde los 12 aÃƒÂ±os y declarada legalmente incapacitada a los 18, es una joven deshecha y confundida producto de un sistema injusto y corrupto. Sin embargo, Lisbeth es mÃƒÂ¡s un ÃƒÂ¡ngel vengador que una vÃƒÂ­ctima indefensa, y arremete con justa ira sobre los que la han herido.... Segunda parte de su TrilogÃƒÂ­a Millennium, adaptaciones de las exitosas novelas de Stieg Larsson.","torrent":{"xt":"urn:btih:bf233ffd40551a60893329c59af7486eb9a38141","amp;dn":"Millenium+2+DVD-Screener+Spanish+Line+2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bf233ffd40551a60893329c59af7486eb9a38141","infoHashBuffer":{"type":"Buffer","data":[191,35,63,253,64,85,26,96,137,51,41,197,154,247,72,110,185,163,129,65]},"announce":[],"urlList":[]}}