{"title":"Olivia Newton-John - I Honestly Love You (Xvid-2nafish)","uid":6048748,"size":63077666,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:c047421e2423ad8bff1a0087360e792b1ed206aa&amp;dn=Olivia+Newton-John+-+I+Honestly+Love+You+%28Xvid-2nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1292653205,"description":"File Info:\n\nValid : Yes [AVI]\nDuration : 00:04:21\n\n[Video]\nResolution : 640x360\nCodec : XviD MPEG-4 codec\nFPS : 29.97\nBitRate : 1801 Kbps\nQuality Factor : 0.27 b/px\n\n[Audio]\nCodec : MPEG 1 or 2 Audio Layer 3 (MP3)\nNumber of channels : 2\nSample Rate : 44100 Hz\nBitRate : 128 Kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;I Honestly Love You&quot; was a worldwide pop hit single for Olivia Newton-John in 1974. The song was Newton-John's first number-one single in the United States and Canada, thus cementing her as a household name in North America.\n\nReleased on the Long Live Love album in the United Kingdom by EMI, it was eventually released on the album If You Love Me, Let Me Know in the United States on MCA. The song was written by Jeff Barry and the Australian composer Peter Allen; the latter recorded it around the same time on his album Continental American. VH1 placed the song at #11 in the &quot;40 Most Softsational Soft-Rock Songs&quot; list.\n\nThe song topped the charts in the U.S. on October 5, 1974, and went on to sell over two million copies, being certified Platinum. It also reached number one (three weeks) on the Adult Contemporary charts and number six on the Country charts, and won Grammy Awards for Female Pop Vocal Performance and Record of the Year. The song's success also helped propel its parent album, If You Love Me, Let Me Know, to number one. Its title song was released as a single prior to &quot;I Honestly Love You&quot;, and it was also a top-five multi-format (Pop - No. 5, Adult Contemporary - No. 2, and Country - No. 2) hit. By contrast, the single failed to reach the top-twenty in the United Kingdom (#22), although it did chart there in 1983 when it was re-released to promote a Newton-John greatest hits album.\n\nNewton-John re-released the original hit version of the song in 1977, backed with &quot;Don't Cry For Me Argentina&quot; from her then-current album Making a Good Thing Better, and it reached number forty-eight Pop (outperforming the only single from Making A Good Thing Better, the title song, which stalled at number eighty-seven). The song also recharted on the Adult Contemporaries at No. 49.\n\nIn 1998, Newton-John released a new version of &quot;I Honestly Love You&quot; from her album Back with a Heart, which featured Babyface on background vocals, and reached number sixty-seven on the Billboard Hot 100, her first U.S. charted single in six years. The 1998 version also charted on the AC chart at No. 18 and in Country Music Sales at No. 16.\n\nIf You Love Me, Let Me Know was a United States and Canada-only album by singer Olivia Newton-John, released in 1974.\n\nHalf of the tracks on the album are from her European and Australian release, Long Live Love, and the other half are tracks from Olivia with the title song and the much heralded track &quot;I Honestly Love You&quot; being the new additions. Essentially, this is the second of the two early compilation albums released by MCA Records, the other album being Let Me Be There, released in 1973. The result of MCA picking Newton-John's stronger tracks plus newer singles in the same vein led to the album earning widespread critical acclaim and strong album sales in North America.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:c047421e2423ad8bff1a0087360e792b1ed206aa","amp;dn":"Olivia+Newton-John+-+I+Honestly+Love+You+%28Xvid-2nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c047421e2423ad8bff1a0087360e792b1ed206aa","infoHashBuffer":{"type":"Buffer","data":[192,71,66,30,36,35,173,139,255,26,0,135,54,14,121,43,30,210,6,170]},"announce":[],"urlList":[]}}