{"title":"The Belle of New York (1952) Xvid 1cd - Musical - Fred Astaire_V","uid":9332204,"size":865189888,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c16b2355ce41a61c98fe2f87082f4ce23f58e877&amp;dn=The+Belle+of+New+York+%281952%29+Xvid+1cd+-+Musical+-+Fred+Astaire_V&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SaM","files":-1,"time":1386789247,"description":"The Belle of New York (1952) Xvid 1cd - Musical - Fred Astaire_Vera-Ellen [DDR]\n\nThe Belle of New York (MGM) is a 1952 Hollywood musical comedy film set in New York circa 1900 and stars Fred Astaire, Vera-Ellen, Alice Pearce, Marjorie Main and Keenan Wynn, with music by Harry Warren and lyrics by Johnny Mercer. The film was directed by Charles Walters.\n\nThis whimsical (even by Astaire's standards) musical failed at the box office and impressed few critics at the time, mainly due to the nature of the plot which empowers lovers to float free of the influence of gravity - a conceit reprised in the 1999 film Simply Irresistible. Astaire was reluctant to take the project - he was originally supposed to play the role in 1946 but had avoided it through retirement. Clearly stung by its failure[original research?], Astaire later claimed that the dance routines - of which there are more than usual - are of a particularly high standard - a rare verdict from such a notoriously self-critical artist. Vera-Ellen is generally viewed as one of Astaire's most technically proficient dance partners, and this was a factor in his readiness to expand the dance content of the film beyond its traditional proportions.\n\nCAST:- \nFred Astaire ............Charlie Hill\nVera-Ellen................ Angela Bonfils\nMarjorie Main...........Mrs. Phineas Hill\nKeenan Wynn...........Max Ferris\nAlice Pearce............Elsie Wilkins\nClinton Sundberg... Gilford Spivak\nGale Robbins.......... Dixie 'Deadshot' McCoy \n\nDirected by Charles Walters\nProduced by Arthur Freed\n\nMUSICAL NUMBERS:-\nThe choreography makes play with ideas of lightness, of floating on air and on ice, and the use of platforms, with Astaire consciously avoiding his usual love of noise-making in his solos. Vera-Ellen's lithe and waif-like figure (she suffered from anorexia nervosa in real life) facilitated this concept. This also marks choreographer Robert Alton's last collaboration with Astaire.\n\n    When I'm Out With The Belle of New York: The film's signature waltz is delivered by a male chorus outside Vera-Ellen's window.\n\n    Who Wants To Kiss The Bridegroom: Astaire sings and dances with seven lovely women in sequence, finishing the routine on a table.\n\n    Let A Little Love Come In: Sung by Alice Pierce and then by Vera-Ellen (dubbed here by Anita Ellis).\n\n    Seeing's Believing: Astaire fantasy song-and-dance solo performed atop a mock-up of Washington Square Arch, making considerable use of process photography. Astaire's verdict was: &quot;After much experimentation and testing, it neither came off photographically nor story-wise.&quot;\n\n    Baby Doll: Partnered romantic duet, with gentle comic overtones, sung by Astaire and danced by Astaire and Vera-Ellen with much emphasis on twirling motifs and platform work.\n\n    Oops: Comic dance duet, sung by Astaire, takes place in and around a moving horse-drawn streetcar which introduces the platform ingredient into a linear side-by-side styleof choreography incorporating gags and tap routines which echo aspects of the I'm Putting All My Eggs In One Basket Astaire-Rogers number from Follow the Fleet.\n\n    A Bride's Wedding Day Song (Currier And Ives): After some unfortunately cloyingopening scenes, and an attractive swirling routine on an ice-skating rink, Astaire and Vera-Ellen launch into a duet which in terms of virtuosity is equalled only by the famous Waltz In Swing Time Astaire-Rogers dance from Swing Time, with which this routine has some elements in common, being also a syncopated waltz with tap components, this time to a speeded-up version of The Belle Of New York. The apparent ease with which Vera-Ellen copes with the myriad complexities of this routine has sealed her reputation as one of Astaire's most accomplished dance partners. Lastly, this dance is noteworthy for being Astaire's last full tap duet with a leading lady on film, as Ellen was the last of his dance partners who could tap.\n\n    Naughty But Nice: A solo song (dubbed by Ellis) and dance routine by Vera-Ellen which attempts to be erotic.\n\n    I Wanna Be A Dancin' Man: Astaire's second solo routine is a song and sand-dance (only his second sand-dance on film, the other being the No Strings number in Top Hat), and one which - by running separate takes side by side in split screen - has been used in That's Entertainment, Part III to illustrate the extreme precision of Astaire's dance technique. The number - whose lyrics are a tribute to Astaire by his friend Mercer - is a humorous study in nonchalance, with Astaire's choreography deliberately offsettingMercer's tribute.\n\nSYNOPSIS:- The Belle of New York (1952)\nSet in turn-of-the-century New York, wealthy playboy Charles Hill (Fred Astaire) is causing difficulties for his guardian, Aunt Lettie (Marjorie Main) and lawyer, Max (Keenan Wynn). Prone to fall in love then ditching his showgirl brides-to-be at the altar, the compensation bills are mounting. After the most recent episode, he hears Angela (Vera-Ellen) leading a Salvation Army band in song. He falls in love at first sight and when she scoffs at him, telling him that if he were in love his feet would leave the ground, he promptly floats high into the air. He pursues her, even vowing to do an honest day's work for the first time in his life. After various attempts to convince her, Angela's feeling finally cause her feet to leave the ground. After a couple of misunderstandings are resolved, they float into the air together, to a chorus of well-wishers below.\n\nTECHNICAL SPECIFICATIONS\nVideo Codec: XviD ISO MPEG-4\nVideo Bitrate: 855 kbps\nVideo Resolution: 640x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 23.976\nAudio Codec: 0x2000 (Dolby AC3) AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  2\nAudio Languages:English\nRunTime 82 mins\nSubtitles: None\nRipped by: Trinidad [DDR]\nDuration: 82 mins","torrent":{"xt":"urn:btih:c16b2355ce41a61c98fe2f87082f4ce23f58e877","amp;dn":"The+Belle+of+New+York+%281952%29+Xvid+1cd+-+Musical+-+Fred+Astaire_V","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c16b2355ce41a61c98fe2f87082f4ce23f58e877","infoHashBuffer":{"type":"Buffer","data":[193,107,35,85,206,65,166,28,152,254,47,135,8,47,76,226,63,88,232,119]},"announce":[],"urlList":[]}}