{"title":"Ellen Taaffe Zwilich  Concerto Grosso  Symbolon Concerto for Tru","uid":10611184,"size":272321176,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c401ea45a121909fe7e501c7c6344bed08c33d10&amp;dn=Ellen+Taaffe+Zwilich++Concerto+Grosso++Symbolon+Concerto+for+Tru&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":4,"uploader":"magneez","files":4,"time":1406038698,"description":"FLAC+CUE\n\nEllen Taaffe Zwilich  Concerto Grosso  Symbolon Concerto for Trumpet and 5 Players Double Quartet for Strings\n\n\nEllen Taaffe Zwilich, born in Miami in 1939, began her studies at Florida State University, where her mentors included the composer and piano virtuoso Ernst von DohnÃƒÂ¡nyi. She moved to New York City and became active in various aspects of its musical life-as an usher at Carnegie Hall; as a violinist in the American Symphony Orchestra during the time of Leopold Stokowski's leadership; and as a student at Juilliard, studying composition with Elliott Carter and Roger Sessions. \n\nIn the spring of 1982 Gunther Schuller and the American Composers Orchestra introduced Zwilich's First Symphony (New World 80336) at a Lincoln Center concert; in 1983 she received a Pulitzer Prize for the piece, the first in the music category ever awarded to a woman. \n\nThe Concerto for Trumpet and Five Players (1984) was commissioned by a consortium of new music ensembles: Sonor, Collage, and the Pittsburgh New Music Ensemble, with support from the National Endowment for the Arts. The concerto is a work of boundless, infectious charm, put together in a way that reveals Zwilich's remarkable skill at unifying a variegated work through the fine classic device of working a multitude of changes on simple material. The &quot;hero&quot; of this otherwise unprogrammatic three-movement work is the solo trumpet, which scampers ingratiatingly onto the scene with a mocking rising-arpeggio figure that will remain its musical motto. \n\nThe Double Quartet for strings, commissioned and first performed by the Chamber Music Society of Lincoln Center on October 21, 1984, explores more serious musical terrain. Again we have a striking demonstration of Zwilich's superb organizational skill. The unifying elements of this four-movement work are more difficult to detect, but they are inescapable. The powerful opening theme with its striding intervallic structure may remind some of the young Shostakovich, as might also the throbbing, intense, declamatory chords of the slow movement. \n\nIn the Concerto Grosso 1985 (subtitled &quot;to Handel's Sonata in D for violin and continuo, first movement&quot;), we encounter again the creative use of constructive devices that gives Zwilich's music its consistency and emotional drive. This work was commissioned by the Washington Friends of Handel in commemoration of the 300th anniversary of George Frideric Handel's birth. As the subtitle suggests, an opening thematic gambit from a Handel violin sonata becomes the generative force of the entire five-movement work. \n\nSymbolon is one of the most widely traveled of Zwilich's works to date. &quot;The word, symbolon, comes from the Greek and refers to the ancient custom whereby two parties broke a piece of pottery (or a stone, or a coin) in two, each party retaining half.&quot; Symbolon begins with an open, wide-reaching melodic line that leads to a fierce orchestral buildup. A more lightly scored middle section doesn't relax the tension: groans from basses and percussion create notes of unrest that continue almost to the end. ","torrent":{"xt":"urn:btih:c401ea45a121909fe7e501c7c6344bed08c33d10","amp;dn":"Ellen+Taaffe+Zwilich++Concerto+Grosso++Symbolon+Concerto+for+Tru","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c401ea45a121909fe7e501c7c6344bed08c33d10","infoHashBuffer":{"type":"Buffer","data":[196,1,234,69,161,33,144,159,231,229,1,199,198,52,75,237,8,195,61,16]},"announce":[],"urlList":[]}}