{"title":"Cold War Kids-Dear Miss Lonelyhearts 2013 FLAC vtwin88cube","uid":8339434,"size":245617778,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c5ea71dbcd7f5ad97e085a71b5e3ff61617f179c&amp;dn=Cold+War+Kids-Dear+Miss+Lonelyhearts+2013+FLAC+vtwin88cube&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"vtwin88cube","files":-1,"time":1365055507,"description":"\n\n\nCold War Kids\nDear Miss Lonelyhearts (2013)\n\n\n\n\n\nallmusic.com...\n\nLong Beach, California's Cold War Kids make music with roots that go deep and wide, embracing influences as diverse as Bob Dylan, Billie Holiday, Jeff Buckley, and the Velvet Underground. Vocalist/guitarist/pianist Nathan Willett, bassist Matt Maust, drummer Matt Aveiro, and guitarist Jonnie Russell began crafting their soulful, blues-inflected take on indie rock as Cold War Kids in 2004, recording demos in Los Angeles soon after they formed. After signing to Monarchy Music, Cold War Kids released their debut EP, Mulberry Street, in spring 2005. The band's unique sound and impassioned live act generated a buzz -- particularly from bloggers -- that grew with each tour and release. Maust's clean but eye-catching designs for EPs like With Our Wallets Full and Up in Rags and the group's website also added to Cold War Kids' mystique. They spent much of 2006 on the road with Tapes 'n Tapes, Figurines, Sound Team, and Editors, and appeared at that year's Lollapalooza. That summer, they signed to Downtown Records, also home to Art Brut and Gnarls Barkley. The band's full-length debut, Robbers &amp; Cowards, arrived that fall. Loyalty to Loyalty, which moved in a slower, bluesier direction, was released in 2008. On Behave Yourself, an EP that had a digital release late in 2009 and was issued on CD early in 2010, Cold War Kids emphasized their soulful ballads. In 2010 the band went into the studio with Grammy-winning producer Jacquire King (Tom Waits, Kings of Leon). Their third album, Mine Is Yours, arrived in early 2011. For 2013's Dear Miss Lonelyhearts, the band added former Modest Mouse and Murder City Devils guitarist Dann Gallucci (who co-produced the album with Lars Stalfors) to the fold. \n\n\n\nAudio Quality:\t\tFlac (Lossless)\nAudiochecker:\t     \t100.00% CDDA\nLabel:\t\t\tDowntown Records\nCatalog:\t\tMRCD 6550\n\n\nAudio-Info:\n\n\n01.Miracle Mile\n02.Lost That Easy\n03.Loner Phase\n04.Fear &amp; Trembling\n05.Tuxedos\n06.Bottled Affection\n07.Jailbirds\n08.Water &amp; Power\n09.Dear Miss Lonelyhearts\n10.Bitter Poem\n\n\n\n\n\n\n\n\n\nThanks for Seeding\nEnjoy...\n\n","torrent":{"xt":"urn:btih:c5ea71dbcd7f5ad97e085a71b5e3ff61617f179c","amp;dn":"Cold+War+Kids-Dear+Miss+Lonelyhearts+2013+FLAC+vtwin88cube","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c5ea71dbcd7f5ad97e085a71b5e3ff61617f179c","infoHashBuffer":{"type":"Buffer","data":[197,234,113,219,205,127,90,217,126,8,90,113,181,227,255,97,97,127,23,156]},"announce":[],"urlList":[]}}