{"title":"The Professionals","uid":4059118,"size":125162369,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c61584bc3af61192e47d3fb10e1472cbad97bc5d&amp;dn=The+Professionals&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Ekv2000","files":41,"time":1204511635,"description":"Once upon a time Johny Rotten went to form a new band, Sid Vicious had a date with his girlfriend and Ronie Biggs well he stayed where he was and still had allot of fun, there where two persons who where left aside. Steve Jones and Paul Cook. They basically did the whole Rockenroll Swindle album by them selfs and now they had no idea what to do. Remembering Maclarens teachings they decided to make a new band called The Greedies although live they called them selfs The Greedy Bastards. Being bit to obvious they quickly changed the name to The Professionals and called some friends from other bands like Thin Lizzy to play with them and make a record. 1981 came I Didnt See It Coming. Unfortunately not many saw it coming eather. It lacked the success Six Pistols had even if its a great album.\n\nA really funny thing about this band is a song called Black Leather. It was a song The Professionals made still it was released as a Sex Pistol song later to be covered by The Runaways, Joan Jett and Guns and Roses.\n\nSo how do they sound like? Easiest way to explain it in my opinion would be they took off where The Great Rockenroll Swindle ended. This is probably how Sex Pistols would have sounded if they only made one more record and kicked Sid out of the band with Steve Jones as a singer instead of Rotten. Consider this two where basically the only ones who knew how to play and make music in Pistols while Rotten was more for the lyrics and Sid well Sid was the lazy sod person, The Professionals sound really tight. The sound and way of playing is recognizable. Its the old school punk with lots of Pistol riffs but still you can hear some other bands in the background like Stiff Little Fingers and anyway its a more mature sound from the Never Mind The Bollocks time. \n\nHere are 4 Singles, one flexisingle only The Professional part and Two CDs:\n\nSingles\n\n1-2-3\nJust another dream\nJoin the Professionals\nThe magnificent (Informally rumors says this song is about Sid)\n\nFlexi\n\nLittle boys in blue\n\n\nCd\n\nI didnt see it Coming (The only CD the band made)\nThe Professionals (The band made one more record but never released it. This are some songs from that record later released by the record company when the hype around Sex Pistols reunion came) \n\n\n\n\n","torrent":{"xt":"urn:btih:c61584bc3af61192e47d3fb10e1472cbad97bc5d","amp;dn":"The+Professionals","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c61584bc3af61192e47d3fb10e1472cbad97bc5d","infoHashBuffer":{"type":"Buffer","data":[198,21,132,188,58,246,17,146,228,125,63,177,14,20,114,203,173,151,188,93]},"announce":[],"urlList":[]}}