{"title":"DNSK-The_ DMC_ Remixes_ And_ Mashups_ 2012_Mix_ 2013","uid":9095918,"size":185404956,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:c631a94b33f2ed1d72af0a95bb333a8e308fb9fd&amp;dn=DNSK-The_+DMC_+Remixes_+And_+Mashups_+2012_Mix_+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dnsk","files":2,"time":1382674784,"description":"\nDNSK - The DMC Remixes And Mashups 2012 Mix 2013\n\n\nGenre: Dance\nFormat: MP3\nBitrate: 320 kbps\nType: Mixed\nDuration: 01:17:15\n\n\n01. Let's Go (RKL 2012 Remix) (Rod Layman) - Calvin Harris \n02. Domino (RKL Remix) (Rod Layman) - Jessie J \n03. Happen vs Don't You Want My Love (Rod Layman) - All Boxed In vs Jomanda \n04. Downtown (Rkl's Octogenerian Mix) (Rod Layman) - Petula Clark \n05. Girls On Film (Synthminx Remix) (Steve Franklin) - Duran Duran \n06. Go For A Good Time Mix (Rod Layman) - Chic vs Awesome 3 \n07. Seven Nation Mix (Rod Layman) - Marcus Collins vs The White Stripes \n08. I Cry, Cry In The Dark Mix (Rod Layman) - Flo Rida vs Bingo Players vs Brenda Russell \n09. Greyhound vs Music (Rod Layman) - Swedish House Mafia vs Fargetta \n10. Call Me Maybe vs Hot 'n' Cold (Martin Pieters) - Carly Rae Jepson vs Katy Perry \n11. What Makes You Beautiful vs Moves Like Jagger (Rod Layman) - One Direction vs Maroon 5 Ft. Christina Aguilera \n12. Billie Jean vs Livin' On A Prayer (Steve Franklin) - Michael Jackson vs Bon Jovi vs Synthminx \n13. Drive My Car (Customised Mix) (Rod Layman) - The Beatles \n14. We Found A Love Dance Mix (Teddy Vroundas &amp; Wayne Fysh) - Rihanna Ft. Calvin Harris vs Whitney Houston \n15. The Return Of The KLF (Transformation Cut-Up) (Rod Layman) - The KLF \n16. Good Feeling Vs Levels vs Something's Got A Hold On Me (Phunkstar) - Flo Rida vs Avicii vs Etta James \n17. The Rose Royce Express 2K12 Mix (Rod Layman) - Rose Royce vs S'express \n18. Live While We're Young Vs Shoud I Stay Or Should I Go (Rod Layman) - One Direction vs The Clash \n19. Can You Feel It (Synthminx Remix) (Steve Franklin) - Jacksons \n20. Degrees Of Modjo (Bootymix) (Little Miss Aka Rachel Elektra) - Degrees Of Motion Ft. Biti vs Modjo \n21. Payphone (DJ Ivan Santana Remix) - Maroon 5 Ft. Wiz Khalifa \n22. Stereo Love vs Just Dance (Bernd Loorbach) - Edward Maya vs Lady Gaga \n23. Sexy And I Know It vs Paradise (Ashley Riggs) - LMFAO vs Coldplay \n24. International Love vs Yeah X3 (John Farrell) - Pitbull vs Chris Brown \n\n\nMade with Traktor Kontrol S2 / Traktor Pro 2.6.4\n\nCheck out my other mixes at http://thepiratebay.se/user/qleap/\n\nVisit my page on Facebook -&gt; /pages/DNSK/1404268846471415\n","torrent":{"xt":"urn:btih:c631a94b33f2ed1d72af0a95bb333a8e308fb9fd","amp;dn":"DNSK-The_+DMC_+Remixes_+And_+Mashups_+2012_Mix_+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c631a94b33f2ed1d72af0a95bb333a8e308fb9fd","infoHashBuffer":{"type":"Buffer","data":[198,49,169,75,51,242,237,29,114,175,10,149,187,51,58,142,48,143,185,253]},"announce":[],"urlList":[]}}