{"title":"Dragon Naturally Speaking - Complete x64 Guide - M1NDCR1ME","uid":4618224,"size":1205821647,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:c73f499aa394914ecc8b646f38ad9fee7b98907d&amp;dn=Dragon+Naturally+Speaking+-+Complete+x64+Guide+-+M1NDCR1ME&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"M1NDCR1ME","files":6,"time":1230925776,"description":"Complete guide with all needed software to install Nuance Dragon NaturallySpeaking on x64 operating systems. Can also be used with x32, but there is no need for Orca to edit the .msi file.\n\nIf there are any problems PM me, and please be patient this is my first torrent!\n:-D\n\nProduct Description:\n\nDragon NaturallySpeaking 9 gives small business users and PC enthusiasts the power to create documents, reports, e-mails and more -- all by speaking! Over three times faster than typing, and amazingly accurate, NaturallySpeaking 9 translates your voice dictations into Microsoft Word and Excel, Corel WordPerfect, and virtually all Windows-based applications. It's never been easier to use -- with no script reading required, you can get started right away!\n\n\nNaturallySpeaking 9 translates your voice dictations into Microsoft Word and Excel, Corel WordPerfect, and virtually all Windows-based applications. View larger.\nThree Times Faster than Typing\nA C/NET Editor's Choice for February 2006, and a PC World 100 best products of 2006, Dragon NaturallySpeaking 9 is up to 99 percent accurate, and often more accurate than typing. Dragon NaturallySpeaking never makes a spelling mistake, and it's actually programmed to get &quot;smarter&quot; the more your use it. And because most people speak over 120 words per minute, but type less than 40 words a minute, NaturallySpeaking lets you create letters and e-mails about three times faster than typing by hand.\n\nDragon NaturallySpeaking 9 is extremely easy to use and require no training. A full set of new on-screen tutorials simplify the training process, so you can be an expert Dragon NaturallySpeaking user right away. An included approved free noise-canceling microphone helps you get started immediately. And you can use your voice to dictate, edit and control just about any Windows-based application, which gives you unprecedented flexibility as you work. It even supports Mozilla Firefox and Thunderbird. Just talk, and you can surf the web, open and close applications, even control your mouse and the entire desktop. You can also dictate, edit, and navigate more easily in Microsoft Word, Outlook Express, and Corel WordPerfect than in previous versions. For Web browsing, Dragon NaturallySpeaking 9 lets you search the Web, access information, and navigate web pages by speaking URLs and links.\n\nThe DragonBar includes a &quot;Select and Say&quot; indicator that turns green when you are in an application or window where all of NaturallySpeaking's functionality is supported.\nSeamless Editing Functionality\nWe all add unnecessary &quot;ums&quot; and &quot;ahs&quot; when we speak, and the last thing you want is to spend your time editing all those extraneous insertions from your documents. Thanks to its built-in Nothing But Speech (NBS) technology, Dragon NaturallySpeaking 9 filters out inadvertent fillers and sounds between words, keeping your document clean. The program's &quot;natural punctuation&quot; feature means that when you dictate casual writing styles, you no longer have to say &quot;period&quot; and &quot;comma.&quot;\n\nSo why type your emails, or fiddle with your mouse to surf the Web when you can more easily and quickly use your voice? \n\nProduct Description\nWith Dragon NaturallySpeaking Standard you can talk to your computer and watch words quickly appear in documents, e-mails, instant messages and even surf the web simply by speaking. It's amazingly accurate - up to 99% and really easy to use. There's no script reading or &quot;voice training&quot; required, so you can get started dictating right away. Perfect for the whole family - busy parents, kids just learning to type, and even grandparents.\n\nMain Features\n\nManufacturer: Nuance Communications, Inc\nManufacturer Part Number: A309A-GG4-9.0\nSoftware Sub Type: Voice Recognition\nSoftware Name: Dragon NaturallySpeaking v.9.0 Standard\nFeatures &amp; Benefits:\nUnprecedented Speech Recognition Accuracy\nNo Training Required\nExpanded Support for New Applications\nNew Tutorials\nSupport for Non-standard Edit Controls\nDragon NaturallySpeaking Command Browser\nAdd Terms and Contact Names\nDictate into Favorite Programs\nNavigate Desktop by Voice\nEliminate &quot;Ums&quot; and &quot;Ahs&quot; from Dictation\nControl Mouse by Voice\nWork on the Web by Voice\nMultiple Correction Methods\nEdit by Voice\nNatural Punctuation\nLanguage Support: English\nPlatform Support: PC\nCompatibility:\nMicrosoft Word\nCorel WordPerfect\n\n\nI am not taking credit for anything.\nCheck out the Readme.\t","torrent":{"xt":"urn:btih:c73f499aa394914ecc8b646f38ad9fee7b98907d","amp;dn":"Dragon+Naturally+Speaking+-+Complete+x64+Guide+-+M1NDCR1ME","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c73f499aa394914ecc8b646f38ad9fee7b98907d","infoHashBuffer":{"type":"Buffer","data":[199,63,73,154,163,148,145,78,204,139,100,111,56,173,159,238,123,152,144,125]},"announce":[],"urlList":[]}}