{"title":"Daphne Martin Cake Mystery by Gayle Trent (1-3)","uid":9659116,"size":1188820,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c8916c63bf6bc18d61a20e63e3e2d2e7852344d8&amp;dn=Daphne+Martin+Cake+Mystery+by+Gayle+Trent+%281-3%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"PirateBook","files":3,"time":1393241705,"description":"\nGayle is a Southwest Virginia based author who is working on the Daphne Martin Cake Decorating Mystery series. The first book in the series, MURDER TAKES THE CAKE tells the story of Daphne Martin, a forty-year-old divorcee who returns to her fictional hometown of Brea Ridge, Virginia to start her life over. \n\nShe has left behind an ex-husband who is in prison for an attempt on Daphne's life, a dingy apartment and a stale career. She has started fresh in a new home with a new career, Daphne's Delectable Cakes, a cake-decorating company Daphne runs out of her home. \n\nShe is thrilled to be living closer to her beloved niece and nephew, although being close to other family members brings up lifelong resentments and more than a couple complications. Daphne is also reunited with childhood friend, Ben Jacobs, a full-fledged HAG (hot, available guy). Daphne's business hits a snag when her first client turns up dead.&quot;\n\nGenre: Mystery\n\n\n1. Murder Takes The Cake (2008)\nWhen the meanest gossip in Brea Ridge dies mysteriously, suspicions turn to cake decorator Daphne Martin. But all Daphne did was deliver a spice cake with cream cheese frosting--and find Yodel's body. Now Daphne's got to help solve the murder and clear her good name. Problem is, her Virginia hometown is brimming with people who had good reason to kill Yodel, and Daphne's whole family is among them.\n\n2. Dead Pan (2009)\nCake decorator Daphne Martin once again finds herself and her cakes at the center of a murder mystery. Half the town gets sick following a cake event, but for poor Fred Duncan, a bout with potential food poisoning quickly turns fatal. Now it's up to Daphne to sort through the likely suspects and figure out who frosted Fred.\n\n3. Killer Sweet Tooth (2011)\nDead as a . . . dentist?\n\nThey say sugar is bad for your teeth, but can it actually kill you? The Brea Ridge police seem to think so when they find cake decorator Daphne Martin wielding an oversized plastic toothbrush over a dentist's dead body. Daphne moved back to her small Virginia hometown just months ago to open her Daphne's Delectable Cakes business and already she's been mixed up in murder. Now she's got to prove her sweet innocence again.\n\nAfter hours of police questioning, Daphne returns home to find Elvis Presley in her driveway. She's certain she's hallucinating until the leather-clad hunk orders up a pink Cadillac cake for a convention of the Elvis impersonators. Daphne accepts, but her reporter-boyfriend Ben is suspicious of Elvis's intentions. Does the King want to make Daphne his confectionery queen? Or is the convention a ruse for a more sinister operation? Daphne's own investigation into Dr. Bainsworth's murder, meanwhile, reveals the dentist made as many enemies as he did fillings. Just about anyone could have done him in, but it's up to Daphne to find the killer -- and finish Elvis's cake -- before she's the one singing &quot;Jailhouse Rock.&quot;","torrent":{"xt":"urn:btih:c8916c63bf6bc18d61a20e63e3e2d2e7852344d8","amp;dn":"Daphne+Martin+Cake+Mystery+by+Gayle+Trent+%281-3%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c8916c63bf6bc18d61a20e63e3e2d2e7852344d8","infoHashBuffer":{"type":"Buffer","data":[200,145,108,99,191,107,193,141,97,162,14,99,227,226,210,231,133,35,68,216]},"announce":[],"urlList":[]}}