{"title":"iAwake Technologies - Digital Pills for the Brain [FLAC]","uid":11978215,"size":501197147,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:c928ae6f2de3fd1ba9c2a6758da317d3b42a33c0&amp;dn=iAwake+Technologies+-+Digital+Pills+for+the+Brain+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"elessedilgirl","files":6,"time":1433101887,"description":"Imagine a connection between the Digital World and the Human Brain.\n\n The Digital Pills is an audio system that stimulates the user's brain by generating precisely organized frequency patterns that dramatically improve your capacity to manage neurological resources. This results in heightened attention, increased energy, and improved emotional resilience.\n\n iAwake Technologies leads the field of Brainwave Enhancing Stimulation with the Integrated Neural Entrainment Technology (iNET) - modulating the brainwave activity of users, resulting in powerful and coherent flow-states.\n\n Digital Coffee:\n\n Wake up and prepare for your day with an invigorating alternative. Like all iAwake programs, this unique program contains our exclusive biofield technology, and even transmits the energetic signature of Organic Arabica Coffee! A fantastic way to reduce your caffeine intake without giving up your mental edge.\n\n Digital Energy:\n\n An extra mid-day boost to eliminate that tired afternoon let down without the use of caffeine loaded drinks. Uses sophisticated entrainment with beta and gamma brainwaves. It produces the signatures of the natural energy of Dopamine, Coca Leaves, Guarana and Astragalus.\n\n Chill Pill:\n\n Slip on some headphones and prepare to chill out quickly and deeply after a hard day at work. Contains the energetic frequencies of endogenous cannabinoids and endogenous opiates, which facilitate deep, healthy and non-addictive relaxation, stress release and refreshment.\n\n Digital Dreams:\n\n Prepare to enter sleep states in minutes instead of hours. Contains brainwave patterns that begin in Alpha, decend into Delta and produce vivid Dream States. Key components significantly reduce stress at bed time, while clearing your mind for deep sleep by releasing negative emotions built up during the day.\n\n All 20 min\n\n reference libFLAC 1.3.1 20141125\n\n Source: WebRip","torrent":{"xt":"urn:btih:c928ae6f2de3fd1ba9c2a6758da317d3b42a33c0","amp;dn":"iAwake+Technologies+-+Digital+Pills+for+the+Brain+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c928ae6f2de3fd1ba9c2a6758da317d3b42a33c0","infoHashBuffer":{"type":"Buffer","data":[201,40,174,111,45,227,253,27,169,194,166,117,141,163,23,211,180,42,51,192]},"announce":[],"urlList":[]}}