{"title":"Forever &amp; 40 Days - The Genesis of Phantacea","uid":8669165,"size":64757971,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:c9368d808a54c553f70b9767a4ff60088c73f210&amp;dn=Forever+%26amp%3B+40+Days+-+The+Genesis+of+Phantacea&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"fudoh101","files":1,"time":1373468550,"description":"This is some crazy stuff, like Rick Veitch sharing a coke-bomb with Richard Corben\n\nWritten and edited by Jim McPherson\nIllustrated by Ian Fry, Ian Bateson and Dave Sim (maybe...)\n\nPublished by Phantacea Publications 1990\n90 pages\n\nCulminating in the Genesea (aka the Great Flood of Genesis), the graphic novel, &quot;Forever &amp; 40 Days - the Genesis of PHANTACEA&quot;, recounts many of the challenges the Moloch Sedon, his Great Godly offspring and their offspring, the Master Devas or Shining Ones, faced prior to achieving their apotheosis as gods and goddesses on the Whole Earth. Of them, about half take place pre-Earth. Nothing less than the PHANTACEA version of the origin of the Devil himself highlights this 1990 collection of short features drawn by Ian Fry and initially intended for the PHANTACEA Phase One comic book project. Bonuses include a short story written by Jim McPherson that features surviving members of the Damnation Brigade, the Death Dodgers and Signal System. There is also a chart regarding the Golden Age Patriarchs of Humankind as applied to the PHANTACEA Mythos\n\nJim McPherson created the PHANTACEA Mythos in the early 1970s. He wrote and published a series of comic books under the PHANTACEA imprint from 1977 until 1980. The graphic novel came out in 1990. He is currently writing a series of novels and mini-novels based on the PHANTACEA Mythos. The War of the Apocalyptics and the upcoming Trigregos Gambit recount, in much more detail, stories that originally appeared in the comic books. The full-length mosaic novel, &quot;Feeling Theocidal&quot;, and the mini-novels extracted from &quot;The 1000 Days of Disbelief&quot; are prequels to the Launch 1980 story sequences as well as sequels to the graphic novel\n\nRead more about Jim McPherson and his comic publishing here: &lt;a href=&quot;\nhttp://comicattack.net/2011/12/01/is-36-phantacea-1-2/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://comicattack.net/2011/12/01/is-36-phantacea-1-2/&lt;/a&gt;","torrent":{"xt":"urn:btih:c9368d808a54c553f70b9767a4ff60088c73f210","amp;dn":"Forever+%26amp%3B+40+Days+-+The+Genesis+of+Phantacea","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c9368d808a54c553f70b9767a4ff60088c73f210","infoHashBuffer":{"type":"Buffer","data":[201,54,141,128,138,84,197,83,247,11,151,103,164,255,96,8,140,115,242,16]},"announce":[],"urlList":[]}}