{"title":"Gob Smacked Asian Semen Slapper","uid":15819500,"size":804439130,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:c9636122a02e44d89f9da740e5567d3a211076da&amp;dn=Gob+Smacked+Asian+Semen+Slapper&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":7,"uploader":"sarah.jensen","files":1,"time":1473741900,"description":"Aerobics teacher Tom gyrates on the platform under the arches every evening, with distorted music blaring out and a hundred unfit middle aged housewives in front of her, all unable to keep up. Tom does not give a shyte. She dances there with her rock hard figure, small tits and six pack. All the ladies want to be like her, young and super fit sexy. Well they used to be young, but they were never fit like Tom. Tom can do fast pace aerobics non stop for an hour and a half without a drop of sweat. Even in the late afternoon heat. No sweat, but her crotch does get moist. She turns herself on by being a public little fuck nymph. She teaches aerobics dressed in red lycra shorts and a fishnet body stocking. A hundred unfit middle class, middle aged ladies pay her wages. They all have regular jobs and businesses, and little time for leisure. They put aside this one hour every evening for their aerobics club. Tom can just about live on what they pay her for this hour, but many of them offer extra work. Fuck their husbands, fuck their business partners, fuck their business customers. A fit little fucker who eagerly opens her legs is well in demand by respectable ladies who recognize a good business asset. High definition Tom ought to be gyrating on your cock to get you to sign some contract for some astute Asian businesswoman, all on video","torrent":{"xt":"urn:btih:c9636122a02e44d89f9da740e5567d3a211076da","amp;dn":"Gob+Smacked+Asian+Semen+Slapper","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c9636122a02e44d89f9da740e5567d3a211076da","infoHashBuffer":{"type":"Buffer","data":[201,99,97,34,160,46,68,216,159,157,167,64,229,86,125,58,33,16,118,218]},"announce":[],"urlList":[]}}