{"title":"Assassins.Creed.IV.Black.Flag.Update.v1.02.with.DLC-RELOADED","uid":9329391,"size":126515686,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c9768b58af80e349eef6d82f573b5a8d80911162&amp;dn=Assassins.Creed.IV.Black.Flag.Update.v1.02.with.DLC-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"saif_khan","files":11,"time":1386700192,"description":"Assassin's Creed IV: Blag Flag Update v1.02 with DLC\n\n\n\nDescription\nThe year is 1715. Pirates rule the Caribbean and have established their own lawless Republic where corruption, greediness and cruelty are commonplace. Among these outlaws is a brash young captain named Edward Kenway. His fight for glory has earned him the respect of legends like Blackbeard, but also drawn him into the ancient war between Assassins and Templars, a war that may destroy everything the pirates have built. Welcome to the Golden Age of Piracy.\n\n\n\n\nNote:\n\nThis release updates Assassins.Creed.IV.Black.Flag-RELOADED to version 1.02,\nwhich was released 20131203. As a bonus, we've unlocked DLC/ULC content.\nA changelist is included in a text file in the pack.\n\n\nContent unlocked:\n\n* Aveline DLC\n* Crusader &amp; Florentine Pack \n* Death Vessel Pack\n* Collectibles Pack\n* Activities Pack\n* Technology Pack\n* Resources Pack\n\n\nInstallation\n1. Unrar.\n2. Install the update. \n3. Copy over the cracked content from the /Crack directory to your game\ninstall directory.\n4. Play the game.\n5. Support the software developers. If you like this game, BUY IT!\n\n\n\n\n\n\n\nNFO:\n\n\n\n\n\n nERv\n\n\n Assassins Creed IV Black Flag Update v1.02 with DLC (c) Ubisoft\n\n 12/2013 :..... RELEASE.DATE .. PROTECTION .......: Steam + UbiDRM\n - :.......... DISC(S) .. GAME.TYPE ........: Action, Adventure\n\n\nNote:\n~~~~~\nThis release updates Assassins.Creed.IV.Black.Flag-RELOADED to version 1.02,\nwhich was released 20131203. As a bonus, weve unlocked DLC/ULC content.\nA changelist is included in a text file in the pack.\n\nContent unlocked:\n\n* Aveline DLC\n* Crusader &amp; Florentine Pack\n* Death Vessel Pack\n* Collectibles Pack\n* Activities Pack\n* Technology Pack\n* Resources Pack\n\n--\n\n\nThe year is 1715. Pirates rule the Caribbean and have established their own\nlawless Republic where corruption, greediness and cruelty are commonplace.\n\nAmong these outlaws is a brash young captain named Edward Kenway. His fight\nfor glory has earned him the respect of legends like Blackbeard, but also\ndrawn him into the ancient war between Assassins and Templars, a war that may\ndestroy everything the pirates have built.\n\nWelcome to the Golden Age of Piracy.\n\nKey Features\n\n* A BRASH REBEL ASSASSIN Become Edward Kenway, a charismatic yet brutal\npirate captain, trained by Assassins. Edward can effortlessly switch between\nthe Hidden Blade of the Assassins Order and all new weaponry including four\nflintlock pistols and dual cutlass swords.\n\n* EXPLORE AN OPEN WORLD FILLED WITH OPPORTUNITIES Discover the largest and\nmost diverse Assassins Creed world ever created. From Kingston to Nassau,\nexplore over 75 unique locations where you can live the life of a pirate\nincluding:\n\n* Loot underwater shipwrecks\n* Assassinate Templars in blossoming cities\n* Hunt for rare animals in untamed jungles\n* Search for treasure in lost ruins\n* Escape to hidden coves\n\n* BECOME THE MOST FEARED PIRATE IN THE CARIBBEAN Command your ship, the\nJackdaw, and strike fear in all who see her. Plunder and pillage to upgrade\nthe Jackdaw with ammunition and equipment needed to fight off enemy ships.\nThe ships improvements are critical to Edwards progression through the\ngame. Attack and seamlessly board massive galleons, recruit sailors to join\nyour crew and embark on an epic and infamous adventure.\n\n* EXPERIENCE THE GRITTY REALITY BEHIND THE PIRATE FANTASY Stand amongst\nlegendary names such as Blackbeard, Calico Jack and Benjamin Hornigold, as\nyou establish a lawless Republic in the Bahamas and relive the truly\nexplosive events that defined the Golden Age of Piracy.\n\n* THE BEST ASSASSINS CREED MULTIPLAYER EXPERIENCE TO DATE Put your\nassassination skills to test and embark on an online journey throughout the\nCaribbean. Discover a brand new set of pirate characters, and explore exotic\nand colourful locations. Additionally, create your own game experience with\nthe new Game Lab feature craft your own multiplayer mode by choosing\nabilities, rules and bonuses. Play and share your newly created mode with\nyour friends.\n\n\n1. Unrar.\n2. Install the update.\n3. Copy over the cracked content from the /Crack directory to your game\n install directory.\n4. Play the game.\n5. Support the software developers. If you like this game, BUY IT!\n\t\t\n","torrent":{"xt":"urn:btih:c9768b58af80e349eef6d82f573b5a8d80911162","amp;dn":"Assassins.Creed.IV.Black.Flag.Update.v1.02.with.DLC-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c9768b58af80e349eef6d82f573b5a8d80911162","infoHashBuffer":{"type":"Buffer","data":[201,118,139,88,175,128,227,73,238,246,216,47,87,59,90,141,128,145,17,98]},"announce":[],"urlList":[]}}