{"title":"The Avatar (gnv64)","uid":8217831,"size":14754275,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c9888c4d6b429211bcd6d1272717325992cfaeaa&amp;dn=The+Avatar+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gnv65","files":-1,"time":1362385429,"description":"The Avatar (a sci-fi novel)\nBy Poul Anderson\nSphere Books | 1980 | ISBN 0-7221-1 131-2 | PDF | 403 pages | 14 mb\nscanned to PDF by me\n\nAN UNTIMELY RETURN\n'We're passing through on our way back to the Solar System. May we commence manoeuvres?'\n'What - but - But everybody expected you'd be gone for years!'\n'We were.'\n'No. I witnessed your transit. That was, uh, five months ago, no more.'\n'For us, approximately eight Terrestrial years have passed...'\n\nSo begins the nightmare homecoming of the spaceship Emissary, returning to Earth following a successful voyage of discovery. But the Emissary has returned to a terrifying and different new world more alien than the horrors of wandering in the infinities of space and time...\n\nAbout the Author\nPoul Anderson is one of the great names of contemporary science fiction, author of over fifty books and 200 shorter pieces, winner of five Hugo Awards and two Nebula Awards for short fiction. His classic SF novels include Brain Wave, The High Crusade, Tau Zero, The Enemy Stars and The Earthbook of Stormgate. He and his wife live in Orinda, California, and are both active in the Society for Creative Anachronism, in which Poul has won a knighthood for prowess in medieval combat.\n\nThis novel was published over 30 years back. My reprint is over 20 years old. The movie, unrelated to this novel, came much later. This tightly bound paperback was pretty difficult to scan but I have tried my best. It is my gift to the lovers of 80s sci-fi (like me)!","torrent":{"xt":"urn:btih:c9888c4d6b429211bcd6d1272717325992cfaeaa","amp;dn":"The+Avatar+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c9888c4d6b429211bcd6d1272717325992cfaeaa","infoHashBuffer":{"type":"Buffer","data":[201,136,140,77,107,66,146,17,188,214,209,39,39,23,50,89,146,207,174,170]},"announce":[],"urlList":[]}}