{"title":"The Day After 1983 DVDrip mp4 (steelballz)","uid":9214703,"size":1487443088,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c99105549ca54c23067c31bbcb7006009bf20e50&amp;dn=The+Day+After+1983+DVDrip+mp4+%28steelballz%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"steelballz","files":-1,"time":1384843845,"description":"It is the mid-1980s. An aggressive Soviet leadership orders troops marched to the border of West Berlin, and then decides to invade West Germany with multiple armored tank &amp; troop divisions. In Lawrence, Kansas - on the border with Missouri - a family is preparing for the wedding of their eldest daughter, and Dr. Oakes is keeping busy in his role as chief of surgery in the small University Hospital at Lawrence. These people go on with their daily lives but are drawn closer to the possibility of a nuclear war, as the Russians use a nuclear ballistic missile against a West German city, and then attack a U.S. warship in the Persian Gulf. The Americans strike back by hitting a Soviet ship, and then the Russians hit NATO regional headquarters with a nuclear warhead! People start creating makeshift fallout shelters in their basements, but many are caught off guard when, 1 at a time, nuclear missiles are launched from their silos along the Kansas - Missouri border. USAF officers then announce that 300+ ICBMs are inbound to the U.S., and 2 of them strike Kansas City, Missouri! Many are killed outright, but still more must face the danger of radioactive fallout. Now, the characters we follow are living in a barren, devastated world - devoid of electricity, safe drinking water, and food - and filled with radioactivity, starvation, and disease... in the horrific aftermath of 'The Day After'... ","torrent":{"xt":"urn:btih:c99105549ca54c23067c31bbcb7006009bf20e50","amp;dn":"The+Day+After+1983+DVDrip+mp4+%28steelballz%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c99105549ca54c23067c31bbcb7006009bf20e50","infoHashBuffer":{"type":"Buffer","data":[201,145,5,84,156,165,76,35,6,124,49,187,203,112,6,0,155,242,14,80]},"announce":[],"urlList":[]}}