{"title":"All Men Are Brothers [mp3] Gandhi - ScanSoft Daniel reading","uid":8363247,"size":232719124,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:cadfc41a12b92f8b3c104b9fdf28ffd5ed5fb123&amp;dn=All+Men+Are+Brothers+%5Bmp3%5D+Gandhi+-+ScanSoft+Daniel+reading&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"UnviolentPeacemaker","files":53,"time":1365694859,"description":"All Men Are Brothers [mp3] Gandhi - ScanSoft Daniel reading\n\n\nNOTICE: WHY SCREW THE PUBLISHERS, WRITERS, CREATORS?  When you have the $$$, buy this download, preferably from a locally owned store.  &quot;Universal Family&quot; is the ONLY Revolution.  Hypocrisy kills.\n\n\nNOTICE: This book is read by the HQ ELECTRONIC VOICE SCANSOFT DANIEL.  Don't like that?  Don't download it.  Don't complain.  Don't get in the way.\n\n\nThis book from the\n\nLIBRARY OF UNVIOLENT REVOLUTION - AGAPE, UNIVERSAL FAMILY\n\n'UnviolentPeacemaker' on ThePirateBay.\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/UnviolentPeacemaker/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/UnviolentPeacemaker/&lt;/a&gt;\n\nHundreds more like it, in that library UnviolentPeacemaker.\n\n\nTHOSE CLUELESS TO THE PLANETARY EMERGENCY OF IMPENDING ECOCIDE SHOULD GO ELSEWHERE.  These uploads were created for me, to equip me to Wage All-out Unviolent War for my current and future 204 billion children.  If you are looking for style over substance this site and these materials are not for you.  THE PRESENT AND FUTURE KIDS ARE SCREAMING AT US TO SAVE THEIR FUTURE, not whether there are typos, hugely rough parts, audio artifacts, pauses, footnote numbers, etc.  HAVE THE DECENCY NOT TO COMPLAIN.\n\n\nALSO, CUT ME SOME SLICK.  THIS UPLOAD WAS PREPARED ON 04.11.13, THIS DAY 14 OF MY 'ECOCIDE'S DEATH FAST, ZERO CALORIES,' RACING TO FINISH THIS PROJECT SO I CAN ABSTAIN FROM LIQUIDS AS WELL BY MIDNIGHHT SUNDAY NIGHT. GOOGLE 'start loving.' Also GOOGLE, 'tracking plan b'  So, I'm working with a 23,400 calorie deficit, and a sleep deficit the last 4 days of near 8 hrs x 4 = 32 hours, so I can get this done, before I am.  (Hmmm, you too are this committed to averting ecocide so out kids and grandkids have a Life, like you and I did, right?)\n\n\nWITHIN WEEKS I'LL BE GONE.  FOR CREATION'S SAKE, SEED THESE.  KEEP EVERY ONE, ESPECIALLY THE WEAKEST, ALIVE WHILE I'M GONE.  OK? STARTING NOW?\n","torrent":{"xt":"urn:btih:cadfc41a12b92f8b3c104b9fdf28ffd5ed5fb123","amp;dn":"All+Men+Are+Brothers+%5Bmp3%5D+Gandhi+-+ScanSoft+Daniel+reading","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cadfc41a12b92f8b3c104b9fdf28ffd5ed5fb123","infoHashBuffer":{"type":"Buffer","data":[202,223,196,26,18,185,47,139,60,16,75,159,223,40,255,213,237,95,177,35]},"announce":[],"urlList":[]}}