{"title":"Rouse Up, O Young Men of the New Age! by Kenzaburo Oe  (retail) ","uid":10798825,"size":15244035,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cb09d2bec06a38724fd0cf420367462454ca4a3e&amp;dn=Rouse+Up%2C+O+Young+Men+of+the+New+Age%21+by+Kenzaburo+Oe++%28retail%29+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gratefuldawg77","files":3,"time":1408319337,"description":"&quot;K is a famous writer living in Tokyo with his wife and three children, the oldest of whom was born with a brain anomaly that has left him mentally disabled. A highly cerebral man who often retreats from real life into abstraction - in this case, the poetry of William Blake - K is confronted by his wife with the reality that this child, Eeyore, has been saying and doing disturbing things - behaving aggressively, asserting that he's dead, even brandishing a knife at his mother. As the days pass, various events - K's hapless attempts to communicate with his son, Eeyore's near drowning during a father-son trip to the swimming pool, a terrible hurricane that nearly destroys the family's mountain cottage and the family inside it - K is forced to question his fitness as a father.&quot; K reconsiders his own life - his relationship with his father, his rural upbringing, his relationship with a well-known dissident writer who committed suicide, the responsibilities of artists and writers in Japan generally. In the end, in part through his obsessive rereading of Blake, K is able to see that things are not always what they seem, especially where his son is concerned, and to trust his heart as well as his mind.","torrent":{"xt":"urn:btih:cb09d2bec06a38724fd0cf420367462454ca4a3e","amp;dn":"Rouse+Up%2C+O+Young+Men+of+the+New+Age%21+by+Kenzaburo+Oe++%28retail%29+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cb09d2bec06a38724fd0cf420367462454ca4a3e","infoHashBuffer":{"type":"Buffer","data":[203,9,210,190,192,106,56,114,79,208,207,66,3,103,70,36,84,202,74,62]},"announce":[],"urlList":[]}}