{"title":"Tower of Powe - Live &amp; In Living Color","uid":7906023,"size":88607201,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:cb7a1511735a5e8989a6df37c0bdd6a97c269ec8&amp;dn=Tower+of+Powe+-+Live+%26amp%3B+In+Living+Color&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"jazznbluz","files":-1,"time":1355098176,"description":"The band's final album for Warner Bros. before it decamped to Columbia, the absolutely stunning 1975 Live and in Living Color ensured that Tower of Power left in a blaze of glory. Recorded at Sacramento Memorial Auditorium and Cerritos College, the group brought what remains one of the era's finest live albums to glorious fruition. Leaving behind the dismal soul of its previous In the Slot, the band fell back on its two great strengths -- classy live performance and unerring funk. With every ounce of the group's full energy packed into the grooves and a little more added for emphasis, Live squeezes out five tracks of epic proportions. Reaching back to its debut LP, East Bay Grease, Tower of Power jammed on a majestic 23-minute rendition of &quot;Knock Yourself Out&quot; and the sleepy classic &quot;Sparkling in the Sand,&quot; before continuing its sonic domination across two songs pulled from Bump City. &quot;Down to the Nightclub (Bump City)&quot; is effusive, while &quot;You're Still a Young Man&quot; is an absolutely outstanding performance of one of TOP's finest songs -- and judging by the audience enthusiasm, it packed as much power in 1976 as it did in 1972 (and indeed, still does today). Courageously, only one track, &quot;What Is Hip?,&quot; emerges from the group's most successful era, but with its rock riffing slices and roiling organ solo, you really don't need anything else -- it stands well as a lone representative of what many hail as TOP's finest hour. There's nothing to fault here except, possibly, the decision to release a mere single disc at a time when live double albums were becoming de rigueur, a move guaranteed to leave listeners crying for more. But perhaps that was the intent all along -- too little is always sweeter than too much.","torrent":{"xt":"urn:btih:cb7a1511735a5e8989a6df37c0bdd6a97c269ec8","amp;dn":"Tower+of+Powe+-+Live+%26amp%3B+In+Living+Color","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cb7a1511735a5e8989a6df37c0bdd6a97c269ec8","infoHashBuffer":{"type":"Buffer","data":[203,122,21,17,115,90,94,137,137,166,223,55,192,189,214,169,124,38,158,200]},"announce":[],"urlList":[]}}