{"title":"Radiohead - The Best Of (2008) WMA320","uid":6051305,"size":189600379,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:cb981ba7cbfc22172f5e4d699e0255f451dd712c&amp;dn=Radiohead+-+The+Best+Of+%282008%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MARCELODRGZ","files":-1,"time":1292746004,"description":"When Radiohead decided with the &quot;In Rainbows&quot; album not to re-up with EMI, it was only a matter of time before the label would squeeze a few more drops out of the money machine that Radiohead was for EMI. The label simply had to find a good time and excuse to do so, and that time has come (new tour!). The band has made clear that it has nothing to do with this &quot;best of&quot;, all the while also acknowledging that EMI has the legal right to do this. Now the question is: is this compilation any good? \n\n&quot;The Best of Radiohead&quot; (17 tracks; 76 min.) not surprisingly focuses on tracks from three albums: a whopping 6 tracks from 1995's commercial breakthrough album &quot;The Bends&quot;, including the singles Just, My Iron Lung, High and Dry, Fake Plastic Trees, Street Spirit (Fade Out) and also the fabulous title tracks. 1997's &quot;OK Computer&quot; album, viewed by many as one of the most important albums of the 90s, gets 4 tracks, including the singles Paranoid Android, Karma Police, No surprises, and also Lucky. 2000's &quot;Kid A&quot; gets 3 tracks: Optimistic, Idioteque, and Everything In Its Right Place. With that, 75% of this &quot;best of&quot; compilation is filled. The remaining 3 studio albums get a mere 4 tracks: the monster hit Creep from 1993's &quot;Pablo Honey&quot;; Pyramid Song from 2001's &quot;Amnesiac; and finally There There and 2+2=5 from 2004's &quot;Hail to the Thief&quot;. \n\nIn all, it is difficult to argue with that selection. Only 2 singles did not make in on here (Knives Out from &quot;Amnesiac&quot; and Go to Sleep from &quot;Hail to the Thief&quot;, but this is not &quot;The Singles of Radiohead&quot;. I will say that I am not crazy with the sequencing of the album (notice that the 3 tracks from &quot;Kid A&quot; are buried in the second half). But all in all, EMI actually did make a pretty good job of it, imagine that! For anyone not all that familiar with Radiohead, this is a great place to start. If you are wondering whether to buy this, or instead the 2CD &quot;Special Edition&quot; (which comes with an additional 13 songs on a second CD), I'd recommend to buy this single CD compilation. If you like what you hear, the next step is to explore the individual studio albums of Radiohead. \n\nby Paul Allaer\n\nTRACKLIST:\n\n01 - Just.wma                                                    \n02 - Paranoid Android.wma                                        \n03 - Karma Police.wma                                            \n04 - Creep.wma                                                   \n05 - No Surprises.wma                                            \n06 - High And Dry.wma                                            \n07 - My Iron Lung.wma                                            \n08 - There There.wma                                             \n09 - Lucky.wma                                                   \n10 - Optimistic.wma                                              \n11 - Fake Plastic Trees.wma                                      \n12 - Idiotesque.wma                                              \n13 - 2+2=5.wma                                                   \n14 - The Bends.wma                                               \n15 - Pyramid Song.wma                                            \n16 - Street Spirit (Fade Out).wma                                \n17 - Everything In Its Right Place.wma \n\nWMA 320Kbps 44100Hz STEREO","torrent":{"xt":"urn:btih:cb981ba7cbfc22172f5e4d699e0255f451dd712c","amp;dn":"Radiohead+-+The+Best+Of+%282008%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cb981ba7cbfc22172f5e4d699e0255f451dd712c","infoHashBuffer":{"type":"Buffer","data":[203,152,27,167,203,252,34,23,47,94,77,105,158,2,85,244,81,221,113,44]},"announce":[],"urlList":[]}}