{"title":"El secreto de los barcos vikingos DVDrip.avi","uid":6109162,"size":514374898,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:cd465e432520a4b4ba18c694cce050f0abd8327c&amp;dn=El+secreto+de+los+barcos+vikingos+DVDrip.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"erato99","files":1,"time":1295281574,"description":"Calidad de video: DVD RIP\nPeso: 491 mb\nIdioma del audio: Espanol\n\nEl 1 de julio de 2007, por primera vez en 900 anos, un barco guerrero vikingo zarpo de Dinamarca para realizar un extraordinario viaje de descubrimiento rumbo a Gran Bretana e Irlanda. El barco era el resultado de cuarenta anos de conservacion, investigacion y trabajo concienzudo realizado por arqueologos, historiadores y constructores de barcos. Utilizando exclusivamente herramientas y tecnologia vikingas, estos expertos estaban seguros de haber recreado una replica exacta de un barco de guerra que nos permitiria, por primera vez, comprender como los vikingos consiguieron dominar vastos territorios. Los miembros de la tripulacion pusieron sus vidas en peligro para demostrar la correcta construccion de la nave. Con un acceso exclusivo a bordo, relataremos la cronica de este extraordinario viaje seguido por miles de personas. Tras seis semanas de travesia, el viaje toco a su fin en Dublin, donde la tripulacion tuvo una numerosa y entusiasta acogida. Esta increible aventura, que ahora podremos disfrutar, puso de manifiesto el secreto de los constructores de barcos vikingos. \n\nNos vemos por TorrentSpain","torrent":{"xt":"urn:btih:cd465e432520a4b4ba18c694cce050f0abd8327c","amp;dn":"El+secreto+de+los+barcos+vikingos+DVDrip.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cd465e432520a4b4ba18c694cce050f0abd8327c","infoHashBuffer":{"type":"Buffer","data":[205,70,94,67,37,32,164,180,186,24,198,148,204,224,80,240,171,216,50,124]},"announce":[],"urlList":[]}}