{"title":"The Great Comic Relief Bake Off - S02E02 - HD-WebDL -- STS","uid":11710957,"size":1045622159,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:ce6f06b86bebb1e5c3aac224cb90964e7db17d07&amp;dn=The+Great+Comic+Relief+Bake+Off+-+S02E02+-+HD-WebDL+--+STS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"uggauga","files":2,"time":1424339150,"description":"The Great Comic Relief Bake Off - Series 2: Episode 2\n\nIn the second episode of the Great Comic Relief Bake Off, presenter Mel Giedroyc welcomes four more gallant celebrities into the Bake Off tent to test out their baking expertise. They are Gok Wan, Jonathan Ross, Abbey Clancy and Zoe Sugg - also known as internet sensation Zoella.\n\nWith mixed baking abilities amongst the group there is fierce competition in the quest to impress the judges, legendary cookery writer Mary Berry and acclaimed master baker Paul Hollywood. This closely-fought contest sees the four bakers tackle a traditional recipe in the signature challenge (24 cupcakes), struggle with a taxing technical bake (20 profiteroles) and flaunt their creative skills in the show-stopper challenge (a marble cake inspired by their favourite building).\n\nWhen the going gets tough the pressure proves to be a recipe for disaster for some, but who will manage to keep their cool and walk away with the Comic Relief Star Baker title?\n\nWhile the bakers aim to inspire others to bake and raise money for Comic Relief, comedian Ed Byrne visits a Comic Relief-funded project in Uganda to see how your donations really are making a difference to those who really need it. He visits a hospital where babies are being vaccinated against deadly diseases thanks to money raised by Comic Relief","torrent":{"xt":"urn:btih:ce6f06b86bebb1e5c3aac224cb90964e7db17d07","amp;dn":"The+Great+Comic+Relief+Bake+Off+-+S02E02+-+HD-WebDL+--+STS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ce6f06b86bebb1e5c3aac224cb90964e7db17d07","infoHashBuffer":{"type":"Buffer","data":[206,111,6,184,107,235,177,229,195,170,194,36,203,144,150,78,125,177,125,7]},"announce":[],"urlList":[]}}