{"title":"The.Ascent.of.Woman.s01e04.EN.SUB.WEBRIP.[MPup]","uid":12482027,"size":1048820784,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:ceba617c8ed42aca48fb33792f3a3daf7dd69590&amp;dn=The.Ascent.of.Woman.s01e04.EN.SUB.WEBRIP.%5BMPup%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"makinapufterpup","files":2,"time":1443062593,"description":"The.Ascent.of.Woman.s01e04.EN.SUB.WEBRIP.[MPup]\r\nRevolution\r\n\r\nFormat: MPEG-4\r\nSize: 1280x720\r\nDisplayAspectRatio: 16:9\r\nFrameRate: 25.000 fps\r\nAudioCodec: AAC\r\nChannels: 2 channels\r\nSamplingRate: 48.0 KHz\r\n\r\n[b]4 of 4[/b]\r\n\r\nDr Amanda Foreman explores the role of women in society. In the final episode, Amanda looks at women in revolutions that have transformed the modern world.\r\n\r\n[img]http://extraimago.com/images/2015/09/24/ad8759e6dfe9ff3f7104a77f68559a30.jpg[/img]\r\n\r\nIn this final film, Dr Amanda Foreman looks at the role of women in revolutions that have transformed the modern world, from political uprisings to reproductive rights. Amanda discovers, through women like campaigner and writer Olympe De Gouges, that the French Revolution's promise of equality, liberty and brotherhood would be limited to men. Bolshevik radical Alexandra Kollontai would find that while her fellow Russian revolutionaries may have put women's rights at the forefront of ideological change, the post-revolutionary world would be as rife with gender bias as the societies they'd helped transform.\r\n\r\nIn the end, revolutionary change for women would come from within the private sphere - in America, with activists like Margaret Sanger, who coined the term birth control and developed the pill which would finally give women control over when to have children. Amanda discusses the experiences of women in contemporary uprisings - in what's been called the Arab spring, when women defied cultural and political traditions, marched into public squares and called for change, only to find that once they demanded rights for women, they were denied them. Amanda discusses the growth of grass roots women's movements in Africa, like those in Liberia and Malawi, and interviews African women involved in democratic politics - Lindiwe Mazibuko, the South African leader of the opposition and Phumzile Mlambo-Ngcuka, executive director of UN Women. Amanda finishes the series with a bold statement - she believes the most critical issue of the 21st century is to address the inclusion of women, to break from the past and create a new model for social revolution - one of gender equality","torrent":{"xt":"urn:btih:ceba617c8ed42aca48fb33792f3a3daf7dd69590","amp;dn":"The.Ascent.of.Woman.s01e04.EN.SUB.WEBRIP.%5BMPup%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ceba617c8ed42aca48fb33792f3a3daf7dd69590","infoHashBuffer":{"type":"Buffer","data":[206,186,97,124,142,212,42,202,72,251,51,121,47,58,61,175,125,214,149,144]},"announce":[],"urlList":[]}}