{"title":"Beperkt Houdbaar [docu, 2007, Dutch version]: unreal beauty idea","uid":4188654,"size":734009344,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:cf35fff7ef5bb74e97b80d8ea5600c0f9dd0019d&amp;dn=Beperkt+Houdbaar+%5Bdocu%2C+2007%2C+Dutch+version%5D%3A+unreal+beauty+idea&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pbdryden","files":1,"time":1210814011,"description":"Documentaire over vrouwelijke schoonheids idealen en de invloed van plastische chirurgie, de cosmetische industrie, en beauty  magazines.\n\nDe 34-jaar-oude regisseur Sunny Bergman, voormalig model, afgestudeerd filosoof, dochter van een feministische filmmaakster, en zelf moeder, maakt zich zorgen dat haar dagen als aantrekkelijke jonge vrouw geteld zijn. Tegelijkertijd is ze boos dat vrouwen continu worden beoordeeld op hun uiterlijk en worden beschouwd als uitgerangeerd wanneer ze de 35 bereiken. Het is deze ambivalentie die haar motiveert om de manier onder de loep te nemen waarop plastische chirurgie, de cosmetische industrie, en vrouwen tijdschriften bijdragen aan en tegelijkertijd grof verdienen aan de toenemende onzekerheid van vrouwen over hun uiterlijk. Naast het interviewen van chirurgen, redacteuren en wetenschappers, laat Sunny zich ook kritisch bekijken door een plastisch chirurg, en ziet ze zichzelf getransformeerd tot een glamour girl door de kracht van photoshop. Een vergelijking met de film die haar moeder 30 jaar geleden maakte, geeft aan dat de schoonheids idealen van vandaag niet verder van de realiteit verwijderd kunnen zijn.\n\nNederland, 2007, 59 min. Geregisseerd door Sunny Bergmann. Documentaire. Getoond op Prix Europa 2007. Wordt nog vertoond op &amp;#039;the 10th International Womens Filmfestival in Seoul (IWFFIS 2008)&amp;#039;.","torrent":{"xt":"urn:btih:cf35fff7ef5bb74e97b80d8ea5600c0f9dd0019d","amp;dn":"Beperkt+Houdbaar+%5Bdocu%2C+2007%2C+Dutch+version%5D%3A+unreal+beauty+idea","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf35fff7ef5bb74e97b80d8ea5600c0f9dd0019d","infoHashBuffer":{"type":"Buffer","data":[207,53,255,247,239,91,183,78,151,184,13,142,165,96,12,15,157,208,1,157]},"announce":[],"urlList":[]}}