{"title":"Slade - Get Yer Boots On (The Best Of Slade) [VBR]","uid":3704813,"size":118525380,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d04edd5b1cac6634220e97824270c6367ff64a56&amp;dn=Slade+-+Get+Yer+Boots+On+%28The+Best+Of+Slade%29+%5BVBR%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bumblefook","files":20,"time":1180900487,"description":"EAC Secure Mode, LAME 3.97, VBR q-1.  Covers included.\n\nWhile there has been an enormous number of Slade collections over the years, Shout Factory&amp;#039;s 2004 release Get Yer Boots On: The Best of Slade is the first comprehensive U.S. compilation, containing both their &amp;#039;70s peak and their early-&amp;#039;80s comeback. If the track listing looks vaguely familiar to Slade-heads, that&amp;#039;s because it does share numerous similarities to the 1994 British collection Wall of Hits, which also covered the band&amp;#039;s entire career, extending it to their brief return to the U.K. charts in the early &amp;#039;90s. As a matter of fact, the track listing is exactly the same for the first nine tracks, then Get Yer Boots On inserts &quot;Merry Xmas Everybody&quot; to its proper chronological placing (Wall of Hits had it tacked onto the end), before resuming the Wall of Hits track listing for the next four songs, then skipping ahead to the &amp;#039;80s hits &quot;Run Runaway&quot; and &quot;My Oh My,&quot; whose order is flipped from the 1994 comp. So, all 16 tracks on Get Yer Boots On are also on the 20-track Wall of Hits and pretty much in the same order to boot, but that&amp;#039;s fine because not only is the Shout Factory release easier to find, it could be argued that the shorter running time results in a tighter, harder-rocking listen, particularly since it focuses on the group&amp;#039;s mid-&amp;#039;70s peak, with none of the &amp;#039;90s tracks. The result is a terrific rock &amp; roll record, full of big, dumb riffs, anthemic singalong choruses, and songs that are impossible to get out of your head. Because Slade&amp;#039;s music was so deliberately dumb (and because it made no waves in America until Quiet Riot did note-for-note covers in the early &amp;#039;80s), they tend to be either forgotten (as they are in the U.S.) or dismissed (as they sometimes are in the U.K.), but Get Yer Boots On proves they made some of the most addictive, tuneful hard rock of the &amp;#039;70s -- it&amp;#039;s blue-collar glitter, as primal as AC/DC and catchy as bubblegum pop. Anybody who loves loud guitars and humongous hooks will find this irresistible, and this long-overdue U.S. compilation is the best place to discover how great this band really was.","torrent":{"xt":"urn:btih:d04edd5b1cac6634220e97824270c6367ff64a56","amp;dn":"Slade+-+Get+Yer+Boots+On+%28The+Best+Of+Slade%29+%5BVBR%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d04edd5b1cac6634220e97824270c6367ff64a56","infoHashBuffer":{"type":"Buffer","data":[208,78,221,91,28,172,102,52,34,14,151,130,66,112,198,54,127,246,74,86]},"announce":[],"urlList":[]}}