{"title":"The Secret Team [1973] L. Fletcher Prouty","uid":8552944,"size":1736555,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d1964462424052e157008fc8bbfb6ffc6457e060&amp;dn=The+Secret+Team+%5B1973%5D+L.+Fletcher+Prouty&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"diannao","files":1,"time":1370651687,"description":"From Wikipedia http://en.wikipedia.org/wiki/The_Secret_Team\n\nThe Secret Team: The CIA and Its Allies in Control of the United States and the World (ISBN 0-13-798173-2) is a book by L. Fletcher Prouty, a former colonel in the US Air Force, first published in 1973. From 1955 to 1963 Prouty was the &quot;Focal Point Officer&quot; for contacts between the CIA and the Pentagon on matters relating to military support for &quot;special operations&quot; but he was not assigned to the CIA and was not bound by any oath of secrecy. (From the first page of the 1974 Printing) It was one of the first tell-all books about the inner workings of the CIA and was an important influence on the Oliver Stone movie JFK. But the main thrust of the book is how the CIA started as a think tank to analyze intelligence gathered from military sources but has grown to the monster it has become. The CIA had no authority to run their own agents or to carry out covert operations but they quickly did both and much more. This book tells about things they actually did and a lot about how they operate.\n\nIn Prouty's own words, from the 1997 edition of The Secret Team:\n\n        &quot;This is the fundamental game of the Secret Team. They have this power because they control secrecy and secret intelligence and because they have the ability to take advantage of the most modern communications system in the world, of global transportation systems, of quantities of weapons of all kinds, and when needed, the full support of a world-wide U.S. military supporting base structure. They can use the finest intelligence system in the world, and most importantly, they have been able to operate under the canopy of an assumed, ever-present enemy called &quot;Communism.&quot; It will be interesting to see what &quot;enemy&quot; develops in the years ahead. It appears that &quot;UFO's and Aliens&quot; are being primed to fulfill that role for the future. To top all of this, there is the fact that the CIA, itself, has assumed the right to generate and direct secret operations. &quot; [L. Fletcher Prouty, Alexandria, VA 1997]\n\n\nAlso see: http://www.prouty.org/\n\nRe-upload, thanks OUL\n","torrent":{"xt":"urn:btih:d1964462424052e157008fc8bbfb6ffc6457e060","amp;dn":"The+Secret+Team+%5B1973%5D+L.+Fletcher+Prouty","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d1964462424052e157008fc8bbfb6ffc6457e060","infoHashBuffer":{"type":"Buffer","data":[209,150,68,98,66,64,82,225,87,0,143,200,187,251,111,252,100,87,224,96]},"announce":[],"urlList":[]}}