{"title":"Taylor Swift &amp; Stevie Nicks-Live 2010 Grammy Awards(Xvid-2nafish","uid":5326065,"size":154691910,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:d217f202c6347a4dbb5dbf4599f02451ce4564f8&amp;dn=Taylor+Swift+%26+Stevie+Nicks-Live+2010+Grammy+Awards%28Xvid-2nafish&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1265023659,"description":"Source: TV\n\nFile Info:\n\nValid : Yes [AVI]\nDuration : 00:06:06\n\n[Video]\nResolution : 720x540\nCodec : XviD MPEG-4 codec\nFPS : 29.97\nBitRate : 1845 Kbps\nQuality Factor : 0.16 b/px\n\n[Audio]\nCodec : Microsoft PCM Format\nNumber of channels : 2\nSample Rate : 48000 Hz\nBitRate : 1536 Kbps\n\n\nTaylor Alison Swift (born December 13, 1989) is an American country artist singer-songwriter, record producer and actress. In 2008, her albums sold a combined four million copies, making her the best-selling musician of the year in the United States, according to Nielsen SoundScan.\n\nIn 2006, she released her debut single &quot;Tim McGraw&quot;, then her self-titled debut album, which was subsequently certified Platinum several times by the Recording Industry Association of America.\n\nIn November 2008, Swift released her second album, Fearless. Fearless and Taylor Swift finished 2008 at number three and number six respectively, with sales of 2.1 and 1.5 million. Fearless has topped the Billboard 200 in 11 non-consecutive weeks; no album has spent more time at No. 1 since 2000. Forbes ranked Swift 2009's 69th-most powerful celebrity with earnings of $18 million. Swift was named Artist of the Year by Billboard Magazine in 2009. \n\nIn January 2010, Nielsen SoundScan lists Swift as the top-selling digital artist in music history with over 24.3 million digital tracks sold to date.\n\nStephanie Lynn &quot;Stevie&quot; Nicks (born May 26, 1948) is an American singer-songwriter, best known for her work with Fleetwood Mac and an extensive solo career, which collectively have produced over forty Top 50 hits and has sold nearly 120 million albums. She has been noted for her ethereal visual style and symbolic lyrics. In the early 1980s, and after a hugely successful first solo album, Rolling Stone deemed her &quot;The Reigning Queen of Rock and Roll&quot;.\n\nNicks was invited to join Fleetwood Mac in 1975 after Mick Fleetwood heard &quot;Frozen Love&quot;, a song she had written and recorded with her boyfriend Lindsey Buckingham. Initially, Fleetwood only intended to hire Lindsey Buckingham, but Buckingham told him: &quot;We're a package deal.&quot; Fleetwood Mac's second album after the incorporation of Nicks and Buckingham produced four Top 40 singles and it remained #1 on the American album charts for over 30 weeks. With the commercial and critical success of Fleetwood Mac's Rumours album in 1977 (which sold over 33 million copies worldwide), Fleetwood Mac gained international fame.\n\nNicks began her solo career in 1981 with Bella Donna, and she has produced five more solo studio albums to date. Overcoming cocaine addiction, dependency on tranquilizers, and chronic fatigue syndrome, Nicks remains a successful solo performer. Nicks has been nominated for seven Grammy Awards, and, with Fleetwood Mac, won the 1977/1978 Grammy for Album of the Year for Rumours. As a member of Fleetwood Mac, she was inducted into the Rock and Roll Hall of Fame in 1998. Nicks has a contralto vocal range.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n\n","torrent":{"xt":"urn:btih:d217f202c6347a4dbb5dbf4599f02451ce4564f8","amp;dn":"Taylor+Swift+%26+Stevie+Nicks-Live+2010+Grammy+Awards%28Xvid-2nafish","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d217f202c6347a4dbb5dbf4599f02451ce4564f8","infoHashBuffer":{"type":"Buffer","data":[210,23,242,2,198,52,122,77,187,93,191,69,153,240,36,81,206,69,100,248]},"announce":[],"urlList":[]}}