{"title":"Supernatural S01E05,6,7,8,9 10 DVDrip DutchReleaseTeam (dutch su","uid":6311147,"size":1586189278,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:d23fe233f9e77dccb7dec1d116a9f16d4f219042&amp;dn=Supernatural+S01E05%2C6%2C7%2C8%2C9+10+DVDrip+DutchReleaseTeam+%28dutch+su&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MtotheAtiash","files":25,"time":1302539998,"description":"USA\ngenre: Fantasy\nformaat: DVDrip\ntaal: Engels\nondertitels: vaste Nederlandse ondertiteling\nSeizoen 01 Aflevering 06,7,8,9 &amp; 10\n\nSkin\nWhen one of Sam's old school friends is framed for the murder of his girlfriend, Sam and Dean investigate, discovering that a shapeshifter is responsible for that murder and possibly other similar murders.\n\nHook Man\nSam and Dean help a girl whose date became a victim of the &quot;Hook Man,&quot; a famous urban legend that turns out to be real, in a small college town somewhere in Iowa. In order to save her and her father, the local minister, the brothers have to find the ghost's bones so they can destroy them. But Sam and Dean run into a problem when they discover that the bones are in an unmarked grave.\n\nBugs\nSam and Dean head to Oklahoma to investigate a recent spate of insect related deaths around a new housing development\n\nHome\nWhen Sam starts to have nightmares about their old home, he and Dean head back to Kansas. They soon discover that the new owners of their old house are being plagued by a malevolent entity, could it be the same thing that killed their mother many years earlier?\n\nAsylum\nSam and Dean investigate an abandoned sanitarium and discover that when the hospital was open, the patients held a revolt against the cruel and unusual experimental treatments carried out by the head doctor. Now the ghosts roam the halls, driving anyone who spends the night insane. While trying to rescue two lost teenagers, Sam is captured and turns against Dean.\n\ndeze upload wordt u aangeboden door het DutchReleaseTeam\nVoor de reviews van de nieuwste films, muziek, series, games etc.\nga eens naar http://www.hetmultimediacafe.be\nDutchReleaseTeam = Hardcoded Dutch Subs","torrent":{"xt":"urn:btih:d23fe233f9e77dccb7dec1d116a9f16d4f219042","amp;dn":"Supernatural+S01E05%2C6%2C7%2C8%2C9+10+DVDrip+DutchReleaseTeam+%28dutch+su","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d23fe233f9e77dccb7dec1d116a9f16d4f219042","infoHashBuffer":{"type":"Buffer","data":[210,63,226,51,249,231,125,204,183,222,193,209,22,169,241,109,79,33,144,66]},"announce":[],"urlList":[]}}