{"title":"Paintbrush 1.1 for Mac","uid":4058858,"size":2779427,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:d28befdebff439e10a1fd1ae791ca44f7ff19ebf&amp;dn=Paintbrush+1.1+for+Mac&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"carlchernih","files":1,"time":1204498190,"description":"Paintbrush description\tDownload\n\nPaintbrush is a Cocoa-based paint program for Mac OS X, similar to Microsoft Paint and the now-defunct MacPaint. \n\nThe project&amp;#039;s ultimate goal is to recreate the basic functionality of Microsoft Paint, which has been noticeably absent from Mac OS X for years. \n\nPaintbrush can open and save to most major image formats, including BMP, JPEG, PNG, and GIF.\n\nPaintbrush is not intended to replace Photoshop or other high-end image editors. Instead, it aims to fill the need for a basic, streamlined editor for those times when you just feel the need to doodle.\n\n\n\nWhat&amp;#039;s New in This Release:\n\nÃ‚Â· Added in 1.1:\nÃ‚Â· Fill tool completely rewritten, resulting in a significant speed gain\nÃ‚Â· Limited undo stack to 10 undos (reducing chance for memory overflow)\nÃ‚Â· SUBMITTED: Grid overlay now available\nÃ‚Â· Zooming image will not cause funny scrolling to occur\nÃ‚Â· By default, images created by Paintbrush will open in Paintbrush in the Finder\nÃ‚Â· Bomb tool animation can be immediately completed by pressing ESC\nÃ‚Â· Preliminary support for Shift key in Selection tool\nÃ‚Â· Text insertion uses front color, automatically opens font panel\nÃ‚Â· Color accuracy has been improved (now using calibrated instead of device colors)\nÃ‚Â· Added button to switch foreground and background colors\nÃ‚Â· Toolbox shortcut key changed to better represent functionality\nÃ‚Â· Fixed in 1.1:\nÃ‚Â· REQUESTED: No longer uses wrong size when opening certain JPEGs\nÃ‚Â· REQUESTED: Second click on either color well hides panel, avoiding confusion\nÃ‚Â· Pastes in correct bottom-left corner when zoomed\nÃ‚Â· Changing colors during bomb animation will not change the color being used\nÃ‚Â· Undo no longer makes duplicates of image clippings when used with Selection tool\nÃ‚Â· Paste no longer occasionally places image in Toolbox instead of the document window\nÃ‚Â· Scrollbars in correct location after zoom, opening large images...","torrent":{"xt":"urn:btih:d28befdebff439e10a1fd1ae791ca44f7ff19ebf","amp;dn":"Paintbrush+1.1+for+Mac","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d28befdebff439e10a1fd1ae791ca44f7ff19ebf","infoHashBuffer":{"type":"Buffer","data":[210,139,239,222,191,244,57,225,10,31,209,174,121,28,164,79,127,241,158,191]},"announce":[],"urlList":[]}}