{"title":"SUPERAntiSpyware Professional v5.6.1008 with Key [iahq76]","uid":7699179,"size":20905880,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:d358a2a52ab476ec65d41d039b5aa81d34b768f1&amp;dn=SUPERAntiSpyware+Professional+v5.6.1008+with+Key+%5Biahq76%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TorDigger","files":4,"time":1349456063,"description":"SUPERAntiSpyware Professional\n \nSUPERAntiSpyware is the most thorough scanner on the market. Our Multi-Dimensional Scanning and Process Interrogation Technology will detect spyware that other products miss! SUPERAntiSpyware will remove ALL the Spyware, NOT just the easy ones!\n \nBenefits and Features:\n \nQuick, Complete and Custom Scanning of Hard Drives, Removable Drives, Memory, Registry, Individual Folders and More! Includes Trusting Items and Excluding Folders for complete customization of scanning!\n\n Detect and Remove Spyware, Adware, Malware, Trojans, Dialers, Worms, KeyLoggers, HiJackers and many other types of threats.\n\n Repair broken Internet Connections, Desktops, Registry Editing, Task Manager and more with our unique Repair System! Spyware application often disable system components to prevent removal - SUPERAntiSpyware resets and restores these items in seconds!\n\n Real-Time Blocking of threats! Prevent potentially harmful software from installing or re-installing!*\n\n Schedule either Quick, Complete or Custom Scans Daily or Weekly to ensure your computer is free from harmful software.*\n\n Quarantine items detected and removed for complete protection. Items in the quarantine may be restored to your computer if desired.\n\n Detailed scan logs with complete information about detected and removed threats and their locations within your computer. Scan logs allow you to review scheduled scan results at anytime\n\nSystem Requirements:\n \nWindows 2000, XP, Media Center, Vista, Windows 2003 and Windows 7\n\n 400Mhz or Faster Processor with at least 256MB RAM\n \nHomepage: http://www.superantispyware.com/superantispyware.html\n \nInstallation Instruction:\n \n1. Edit Hosts file (Read Hosts editing Instructions)\n2. Install program.\n3. Use given serial to register.\n4. Done, Enjoy. ","torrent":{"xt":"urn:btih:d358a2a52ab476ec65d41d039b5aa81d34b768f1","amp;dn":"SUPERAntiSpyware+Professional+v5.6.1008+with+Key+%5Biahq76%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d358a2a52ab476ec65d41d039b5aa81d34b768f1","infoHashBuffer":{"type":"Buffer","data":[211,88,162,165,42,180,118,236,101,212,29,3,155,90,168,29,52,183,104,241]},"announce":[],"urlList":[]}}