{"title":"Music.For.Misfits.The.Story.of.Indie.EN.SUB.x264.WEBRIP.[MPup]","uid":12532464,"size":1062881267,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:d36354106e9e4d623d6e89cb154a55ae60c330dd&amp;dn=Music.For.Misfits.The.Story.of.Indie.EN.SUB.x264.WEBRIP.%5BMPup%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"makinapufterpup","files":2,"time":1444283257,"description":"Music For Misfits The Story of Indie EN SUB x264 WEBRIP [MPup] The DIY Movement s01e01\r\n\r\nMusic.For.Misfits.The.Story.of.Indie.EN.SUB.x264.WEBRIP.[MPup]\r\nThe DIY Movement\r\n\r\nFormat: MPEG-4\r\nSize: 1280x720\r\nDisplayAspectRatio: 16:9\r\nFrameRate: 25.000 fps\r\nAudioCodec: AAC\r\nChannels: 2 channels\r\nSamplingRate: 48.0 KHz\r\n\r\n[b]1 of 3[/b]\r\n\r\nMusic documentary series. In the 1970s, a time when even the Sex Pistols were on a major label, the true act of rebellion was to release music independently.\r\n\r\n[img]http://extraimago.com/images/2015/10/04/6b8a5568acba8e74603902a7eaa10233.jpg[/img]\r\n\r\nThe story of British indie over three musically diverse episodes. Much more than a genre of music, it is a spirit, an attitude and an ethos.\r\n\r\nIn the 1970s, the music industry was controlled by the major record labels, and the notion of releasing a record independently seemed like an impossible dream. At a time when even the Sex Pistols were on a major label, the true act of rebellion was would be to do it yourself.\r\n\r\nIt took an independent release from Buzzcocks in 1976 with the Spiral Scratch EP to begin a change in the game. The initial pressing of 1,000 copies was funded by family and friends and sold out immediately. The notion of independently releasing your own music was compelling, and it became a call to action.\r\n\r\nIndependent record labels began to pop up all over the UK, each one with its own subculture and sound - from Factory in Manchester to Zoo in Liverpool, Postcard in Glasgow and London labels such as Mute, Beggars Banquet and Rough Trade. They were founded by people with no business experience, just a passion for music and a commitment to helping others achieve creative autonomy. These labels were cutting, releasing and distributing the music themselves. Bedsits became offices and basements became studios. This was DIY, and it felt like a countercultural movement set against all that the mainstream had to offer.\r\n\r\nThese labels were pivotal in getting the new sounds to a generation hungry for change. Queues of hopeful bands waited to drop off demo tapes, and the first wave of indie bands emerged from the newly formed labels. It was a fantastically creative, if somewhat hand-to-mouth time, yet bands also had the freedom to make all the decisions about their image and musical direction themselves. Pioneering music from bands such as Joy Division, Throbbing Gristle, Echo and the Bunnymen, Orange Juice and Aztec Camera is featured in this episode.\r\n\r\nThese new indie sounds offered a defiantly oppositional stance to prevailing trends in popular culture. With new music exploding out of cities everywhere, it was indie label founder Iain McNay, from Cherry Red, who had the idea for an indie chart - its music spoke to a generation of kids who did not identify with the mainstream sounds on the radio","torrent":{"xt":"urn:btih:d36354106e9e4d623d6e89cb154a55ae60c330dd","amp;dn":"Music.For.Misfits.The.Story.of.Indie.EN.SUB.x264.WEBRIP.%5BMPup%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d36354106e9e4d623d6e89cb154a55ae60c330dd","infoHashBuffer":{"type":"Buffer","data":[211,99,84,16,110,158,77,98,61,110,137,203,21,74,85,174,96,195,48,221]},"announce":[],"urlList":[]}}