{"title":"[SoM]Il mio nemico[DvdRip-Divx-Ita-Mp3]","uid":4835821,"size":736621568,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d3648199d2dc4859fa23dfc63ceb07ffac372850&amp;dn=%5BSoM%5DIl+mio+nemico%5BDvdRip-Divx-Ita-Mp3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mitimex","files":1,"time":1239312768,"description":"Nello spazio, durante la seconda metÃƒÂ  del duemila, il terrestre Davidge, incurante degli ordini, si scaglia all'assalto dell'alieno Jeriba. Uno dei Dracon - esseri unisex, abitanti l'omonimo antichissimo pianeta - il quale ÃƒÂ© entrato con la sua navetta nell'orbita della stazione spaziale avversaria. Nel furioso scontro, il terrestre e l'alieno precipitano con le loro navi spaziali sul medesimo pianeta Fyrine IV, mondo vulcanico spettrale a causa dei suoi due soli e sei lune. Il pianeta ÃƒÂ¨ abitato da carnivori umani, sempre in agguato per procurarsi preda. E' subito chiaro che i due riusciranno a sopravvivere solo superando la inimicizia e riducendosi a collaborare. Dopo un primo feroce corpo a corpo, Davidge e Jeriba si dividono, ma ben presto il terrestre deve soccorrere il nemico, che sta per essere catturato dagli spietati fyrinesi. Molto stentatamente e lentamente i due riescono a intendersi e a comunicare, finchÃƒÂ© Davidge, sul punto di cader preda di un misterioso rettile di Fyrine IV, viene a sua volta salvato dal nemico. Durante una violenta tempesta di meteoriti che si abbatte sul pianeta, Davidge e Jeriba trovano riparo in una caverna, dove l'alieno muore dando alla luce un altro piccolo Drac. Davidge s'improvvisa balio e tutore del piccolo alieno, finchÃƒÂ©, ferito in uno scontro con i fyrinesi e soccorso dai suoi, viene fortunosamente ripreso a bordo dalla stazione spaziale dei terrestri, con l'inseparabile Drac Junior.","torrent":{"xt":"urn:btih:d3648199d2dc4859fa23dfc63ceb07ffac372850","amp;dn":"%5BSoM%5DIl+mio+nemico%5BDvdRip-Divx-Ita-Mp3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d3648199d2dc4859fa23dfc63ceb07ffac372850","infoHashBuffer":{"type":"Buffer","data":[211,100,129,153,210,220,72,89,250,35,223,198,60,235,7,255,172,55,40,80]},"announce":[],"urlList":[]}}