{"title":"PBS.Nova.HD.The.Four.Winged.Dinosaur.XviD.AC3","uid":4257261,"size":781924352,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:d3d9cb37e476d5c9175d7453d0784aa224ca53ee&amp;dn=PBS.Nova.HD.The.Four.Winged.Dinosaur.XviD.AC3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"circlensess","files":1,"time":1214301378,"description":"The Four-Winged Dinosaur\n\nNature Documentary hosted by Lance Lewman and published by PBS broadcasted as part of PBS Nova series in 2008 - English narration\n\n\nInformation\n------------------------------\n\nOriginal PBS Broadcast Date: February 26, 2008\n\nIn 2002, the discovery of a beautiful and bizarre fossil astonished scientists and reignited the debate over the origin of flight. With four wings and superbly preserved feathers, the 130 million-year-old creature was like nothing paleontologists had ever seen before.\n\nIn this program, NOVA travels to the Chinese stone quarry where the fossil was discovered-a famed fossil treasure-trove-and teams up with the world&amp;#039;s leading figures in paleontology, biomechanics, aerodynamics, animation, and scientific reconstruction to perform an unorthodox experiment: a wind tunnel flight test of a scientific replica of the ancient oddity.\n\nDubbed Microraptor, the crow-sized fossil is one of the smallest dinosaurs ever found and one of the most controversial, challenging conventional theories and assumptions about the evolution of flight. (Compare Microraptor&amp;#039;s skeleton with those of the earliest known bird and a nonflying dino relative.)\n\nBut how did Microraptor use its wings? Did it array its arm- and leg-mounted wings in the style of an early 20th-century biplane to produce high lift at low speed? Did it use them to create a single lifting surface for efficient, swift gliding? Did it employ some combination of these two methods? Or were the extra wings useless for flight and likely to have been for some other purpose, such as attracting a mate?\n\nTo answer these questions, NOVA interviews Chinese paleontologist Xu Xing, who first recognized the importance of Microraptor and gave it its name; paleontologist Mark Norell and artist Mick Ellison of the American Museum of Natural History; paleontologist Larry Martin of the University of Kansas; anatomist Farish Jenkins of the Museum of Comparative Zoology at Harvard University; and aerodynamicist Kenny Breuer of Brown University.\n\nIn addition, NOVA commissions a &quot;flight-ready&quot; wind tunnel model of Microraptor complete with feathers and articulating joints. (Test-fly Microraptor yourself in a virtual wind tunnel.)\n\nArtists have historically played an important role in paleontology by helping to reconstruct the appearance and behavior of ancient animals. In the case of Microraptor, two completely different reconstructions were made, one at the American Museum of Natural History, and the other at the University of Kansas, based on different specimens and different techniques.\n\nThe two markedly different reconstructions play into a long-running scientific controversy over the origin of flight in birds. For years the debate has been a standoff between two camps-those who believe dinosaurs were the ancestors of birds, and those who do not. (Hear from the film&amp;#039;s producer, Mark Davis, on why this debate has fascinated him for two decades.)\n\nBelievers in the dinosaur-bird connection have generally assumed that flight must have begun from the ground up, with fast-running dinosaurs that eventually got airborne as feathered arms evolved into wings, and running leaps evolved into powered flight.\n\nSkeptics of the bird-dinosaur link say it would have been physically impossible for running dinosaurs to overcome gravity and get off the ground. It made more sense for flight to evolve from the trees down, with small, arboreal reptiles that glided from the treetops on their way to becoming full-fledged fliers. And that seemed to rule out dinosaurs, which presumably couldn&amp;#039;t climb trees.\n\nAs seen in this program, the American Museum&amp;#039;s Mark Norell is one of the proponents of the &quot;birds-are-dinosaurs&quot; hypothesis, which is the predominant view among most paleontologists, while Larry Martin of the University of Kansas speaks out for the minority view that birds descended from non-dinosaur tree dwellers.\n\nTantalizingly, Microraptor is the unexpected missing link that has reignited the debate and, with the help of NOVA&amp;#039;s model and wind tunnel tests, just might settle the issue-or at the very least deepen our understanding of the long-ago era when the ancestors of birds first took to the air.\n\nScreenshots\n------------------------------\n\n\nTechnical Specs\n------------------------------\n\nVideo Codec: XviD ISO MPEG-4\nVideo Bitrate: 1520 kbps\nVideo Resolution: 720x416\nVideo Aspect Ratio: 1.731:1\nFrames Per Second: 29.970\nAudio Codec: 0x2000 (Dolby AC3) AC3\nAudio Bitrate: 384kb/s CBR 48000 Hz\nAudio Streams: 6\nAudio Languages: English\nRunTime Per Part: 54:31.935\nNumber Of Parts: 1\nPart Size: 745MB\nSubtitles: No\nCapped and encoded by: Syoung333\nRe-encoded by: Cj4gta\n\nLinks\n------------------------------\n\n1) Further Information \n* More about Microraptor\n\n2) Related Documentaries \n* Prehistoric Park\n* The Dinosaur Feather Mystery\n* The Dinosaur that Fooled the World\n\n3) ed2k Links \n\ned2k://|file|PBS.Nova.HD.The.Four.Winged.Dinosaur.XviD.AC3.MVGroup.Forum.avi|781924352|0D05B152A146DE2AF57269777463E12D|h=DLLQHL5KQJ3N55FE42THWGZPXHQ2LD4H|/\n\n\n\n\n\nSource: http://docuwiki.net/index.php?title=The_Four-Winged_Dinosaur","torrent":{"xt":"urn:btih:d3d9cb37e476d5c9175d7453d0784aa224ca53ee","amp;dn":"PBS.Nova.HD.The.Four.Winged.Dinosaur.XviD.AC3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d3d9cb37e476d5c9175d7453d0784aa224ca53ee","infoHashBuffer":{"type":"Buffer","data":[211,217,203,55,228,118,213,201,23,93,116,83,208,120,74,162,36,202,83,238]},"announce":[],"urlList":[]}}