{"title":"Most wanted books Part VIII","uid":10106862,"size":972390883,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d3fa632a6a3c9f12a7e4834e0c3739498ec9bce0&amp;dn=Most+wanted+books+Part+VIII&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"tscosj","files":95,"time":1399423689,"description":"IF YOU HAVE AN IDEAS HOW TO EXPAND AND TO WIDER BOOKS SHARING OVER THE INTERNET, DON'T HESITATE AND FEEL FREE TO TALK ABOUT IT WITH VIA \n\nOR HTTP://ALBERTNIKANOROV.COM/\n\nGOOD LUCK!\n\n---\n\nFirst of all, this torrent is for seeders, for those, who are ready to share!\nSecond, this torrent is for those, who believe in power of knowledge, and in power of sharing with that knowledge.\nAnd the last, this torrent for those, who believe in that every worth to know information has to be free on the internet!\n\n\n---\n\nThe community of this website is the best I've ever seen in my life. \n\nThepiratebay.# and the people around it helped me in various aspects of my life.\n\nThis torrent is my special thanks to everybody who is here to share with the knowledge.\n\nA long time ago I wanted to create unique torrent with lots of worth to have and to read books.\n\nI guess this day has come and I'm going to publish my huge collection with that books. (Thanks to my provider that doubled my connection twice. So my connection I hope is ready to share almost 7GBs of books.) \n\nFiction and non-fiction, programming, journalism, PR,  languages, and many many others... I'd downloaded one by one, in various sites, typing each capthas... all these stuff is here.\n\nI created this torrent because I wanted to have like this torrent before I registered and started to download other torrents, I mean books. \n\nGuerilla Open Access Manifesto. R.I.P Aaron Swartz!\n","torrent":{"xt":"urn:btih:d3fa632a6a3c9f12a7e4834e0c3739498ec9bce0","amp;dn":"Most+wanted+books+Part+VIII","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d3fa632a6a3c9f12a7e4834e0c3739498ec9bce0","infoHashBuffer":{"type":"Buffer","data":[211,250,99,42,106,60,159,18,167,228,131,78,12,55,57,73,142,201,188,224]},"announce":[],"urlList":[]}}