{"title":"Need.for.Speed.The.Run.PAL.XBOX360-COMPLEX","uid":6821098,"size":8618020424,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:d510a71834f790f61f5c483636fbc4537b555cce&amp;dn=Need.for.Speed.The.Run.PAL.XBOX360-COMPLEX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"micko84","files":90,"time":1321391008,"description":"- C O M P L E X -\n\nP R E S E N T S :\nNeed for Speed : The Run Ã‚Â© Electronic Arts\n\nRegion : PAL Languages: English\nSize : 01 DVD Genre : Racing\nPlatform : XBOX 360 Date : November 2011\n\nRelease Info:\n~~~~~~~~~~~~~\nIt's called The Run. An illicit, high-stakes race across the country. The\nonly way to get your life back is to be the first from San Francisco to New\nYork. No speed limits. No rules. No allies. All you have are your driving\nskills and sheer determination as you battle hundreds of the world's most\nnotorious drivers on the country's most dangerous roads.\nIn Need for Speed The Run, you'll weave through dense urban centers, rocket\ndown icy mountain passes and navigate narrow canyons at breakneck speeds,\nall the while evading a relentless police force prepared - and willing - to\nuse lethal force to take you down.\n\nFrom the Golden Gate to the Empire State - Compete in The Run, an\nillicit race across the most iconic and treacherous roads from San\nFrancisco to New York. There are no rules and no allies in the cities,\ndeserts, mountains and canyons than stand between you and the finish line.\nYou are Jack's Competitive Edge - Jack is in a race for his life, but\nhe's got something the competition doesn't: You. Keep Jack one step ahead\nof the dangers from his dark past, both inside and outside the car. It's up\nto you to get Jack to New York in one piece and ahead of the competition.\nBeat Your Friends - Connect to Autolog. Compare your times against those\nthat matter most. Compete to be the best. Autolog now tracks your entire\ncareer - making every second of every race count in the battle to be the\nfastest to New York. Racing Powered by Frostbite 2 - The powerful new\nFrostbite 2 engine, created by the award-winning DICE studio, advances\ntechnical achievements to deliver a gameplay experience with an\nunprecedented level of visual detail, environmental immersion, and\nemotional impact.\nCompete in High Octane Multi-Player Racing - The most accessible online\nracing experience ever offered. With matchmaking technology, join races\nalready in progress instead of waiting in lobbies. Create a party with\nfriends, pick a playlist of your favorite challenges and compete for\nsupremacy across every stage of The Run. By mastering all of the playlists\nyou can level up and earn access to exclusive vehicles, upgrades and\nabilities.\n\nNotes:\n~~~~~~~\nEnjoy\n\nEnjoy This Fine COMPLEX Release\nbmx! ","torrent":{"xt":"urn:btih:d510a71834f790f61f5c483636fbc4537b555cce","amp;dn":"Need.for.Speed.The.Run.PAL.XBOX360-COMPLEX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d510a71834f790f61f5c483636fbc4537b555cce","infoHashBuffer":{"type":"Buffer","data":[213,16,167,24,52,247,144,246,31,92,72,54,54,251,196,83,123,85,92,206]},"announce":[],"urlList":[]}}