{"title":"Stefan Molyneux - How (NOT) To Achieve Freedom ebook","uid":10404329,"size":5972962,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d538e35d845e9625f2c734bbe9812a641fd2de49&amp;dn=Stefan+Molyneux+-+How+%28NOT%29+To+Achieve+Freedom+ebook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"FDRURL","files":-1,"time":1403434299,"description":"For the past several hundred years - really since the late 18th century - intellectuals, priests, philosophers, academics and activists of every stripe and hue have been striving with all their considerable intellectual and moral might to place theoretical and practical limits upon the power of the state.\nThe original American experiment was at least intellectually founded upon the ideal of creating a government by and for the people, with the express knowledge that the state was a dangerous servant and a terrible master...\n\nAbout the author:\nStefan Molyneux is a Canadian philosopher, author, speaker, and host of Freedomain Radio. Molyneux's areas of focus include libertarian political philosophy, voluntaryism based on the strict application of the non-aggression principle, secular ethics, strong atheism, cryptocurrency (Bitcoin), history, non-violent parenting, and familial relationship issues. He has written and self-published eight non-fiction books, and his essays have been published on libertarian websites such as LewRockwell.com and antiwar.com. He is a frequent public speaker at political and technology conferences and has appeared on television, radio, and podcasts to discuss his views. His online philosophy show, Freedomain Radio, has independently produced over 1,500 videos and 2,700 podcasts as of June 2014. Jeffrey Tucker of the Ludwig von Mises Institute described Molyneux as &quot;one of the single most influential libertarian thinkers of our times&quot;\nMore of his books can be found here: &lt;a href=&quot;\nhttps://freedomainradio.com/free/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://freedomainradio.com/free/&lt;/a&gt;\n","torrent":{"xt":"urn:btih:d538e35d845e9625f2c734bbe9812a641fd2de49","amp;dn":"Stefan+Molyneux+-+How+%28NOT%29+To+Achieve+Freedom+ebook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d538e35d845e9625f2c734bbe9812a641fd2de49","infoHashBuffer":{"type":"Buffer","data":[213,56,227,93,132,94,150,37,242,199,52,187,233,129,42,100,31,210,222,73]},"announce":[],"urlList":[]}}