{"title":"Shrimad Valmiki Ramayana - Yuddha Kanda Uttarardh","uid":6919914,"size":21570011,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d591d8e2dd822128422b1dea1c49105b7fc0114e&amp;dn=Shrimad+Valmiki+Ramayana+-+Yuddha+Kanda+Uttarardh&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"594mgnav","files":-1,"time":1325173038,"description":"Shrimad Valmiki Ramayana - Yuddha Kanda Uttarardh [Team Nanban][TPB]\n\n\n\nAbout Valmiki:\n\n\n\n&quot;Valmiki&quot; (during Lord Rama's time) is celebrated as the poet harbinger \nin Sanskrit literature. \n\nHe is the author of the epic Ramayana, based on the attribution in the text of \nthe epic itself.\n\nHe is revered as the Adi Kavi, which means First Poet, for he discovered the first sloka \ni.e. first verse, which set the base and defined the form to Sanskrit poetry.\n\nThe Ramayana, originally written by Valmiki, consists of 24,000 verses in seven cantos \n(some say six i.e. excluding the Uttara Ramayana) (Kandas). \n\nThe Ramayana tells the story of a prince, Rama of Ayodhya, whose wife Sita is abducted \nby the demon (Raakshasa) king of Lanka, Ravana. \n\nThe Valmiki Ramayana is dated variously from 500 BC to 100 BC, or about co-eval with \nearly versions of the Mahabharata.\n\nAs with many traditional epics, it has gone through a long process of interpolations \nand redactions, making it impossible to date accurately.\n\n\n\nSHORT DESCRIPTION ON Shrimad Valmiki Ramayana - Yuddha Kanda Uttarardh:\n\n\n\n\nThis book describes the battle between the forces of Rama and Ravana. \n\nHaving received Hanuman's report on Sita, Rama and Lakshmana proceed with their allies \ntowards the shore of the southern sea. \n\nThere they are joined by Ravana's renegade brother Vibhishana. \n\nThe monkeys named &quot;Nal&quot; and &quot;Neel&quot; construct a floating bridge (known as Rama Setu) \nacross the ocean, and the princes and their army cross over to Lanka. \nA lengthy battle ensues and Rama kills Ravana. \n\nRama then installs Vibhishana on the throne of Lanka.\n\nOn meeting Sita, Rama asks her to undergo agni Pariksha (test of fire) to prove her purity,\nsince she had stayed at the demon's palace. \n\nWhen Sita plunges into the sacrificial fire, Agni the lord of fire raises Sita, unharmed,\nto the throne, attesting to her purity.\n\n\n\nI WILL POST ALL THE KANDAS ONE BY ONE...\n\nPLZ SEED THIS DIVINE TORRENT AS MUCH AS POSSIBLE..\n\nYOU WILL BE ONE OF THE GOOD PEOPLE WHO SPREAD THE MESSAGE OF RAMAYANA THROUGHOUT THE WORLD..\n\nTHIS TORRENT IS NOT RESTRICTED TO HINDUS ONLY...\n\nANY ONE CAN SPREAD GOOD MESSAGE IF THEY HAVE NICE, PEACEFUL HEART..\n\nPLZ SEED GUYZ...\n\nTHANK YOU..\n\n\nPLZ SEED AS MUCH AS POSSIBLE..I AM LACKING SEEDS...","torrent":{"xt":"urn:btih:d591d8e2dd822128422b1dea1c49105b7fc0114e","amp;dn":"Shrimad+Valmiki+Ramayana+-+Yuddha+Kanda+Uttarardh","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d591d8e2dd822128422b1dea1c49105b7fc0114e","infoHashBuffer":{"type":"Buffer","data":[213,145,216,226,221,130,33,40,66,43,29,234,28,73,16,91,127,192,17,78]},"announce":[],"urlList":[]}}