{"title":"John Shuttleworth's Lounge Music 3/4","uid":10642664,"size":33079860,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:d5e6ca5a27bb877d9fbef7e0d8b294b40c713d10&amp;dn=John+Shuttleworth%27s+Lounge+Music+3%2F4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"shardlow","files":1,"time":1406495776,"description":"Aspiring singer/songwriter John Shuttleworth has been posting audio cassettes of his &quot;finest songs to date&quot; to pop stars throughout the land, in the hope that someone would record his material. But all to no avail.\n\nHowever, the BBC has very kindly given John a series and asked him to invite pop starts to bring their music to his Sheffield home. So it is that Chas and Dave, Heaven 17, Toyah Wilcox and Leee John find themselves in John's lounge having tea with wife Mary, being flirted with by Mary's friend Joan and hassled by John's agent Ken Worthington, as they try and perform not only one their greatest hits but more importantly, one of John's.\n\nThis week Mary is not happy as John has invited Toyah Wilcox to the lounge and she's worried that Toyah will live up to her wild 80's image and wreak havoc in the house. So, as Mary busies herself hiding the valuables and even the pillows in case Toyah throws them around and spreads feathers everywhere, John has to keep Toyah entertained in the garden. How will he explain all this to Toyah, who is expecting to sing in the lounge?\n\nAlso Gordon Giltrap tells John how to make his songs commercial in 'Top Tips on the Telephone' and, hopefully, there's Ken in the Konservatory.\n\nWritten and Performed by Graham Fellows with special guests Toyah Wilcox and Gordon Giltrap.Episode 3 of 4","torrent":{"xt":"urn:btih:d5e6ca5a27bb877d9fbef7e0d8b294b40c713d10","amp;dn":"John+Shuttleworth%27s+Lounge+Music+3%2F4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d5e6ca5a27bb877d9fbef7e0d8b294b40c713d10","infoHashBuffer":{"type":"Buffer","data":[213,230,202,90,39,187,135,125,159,190,247,224,216,178,148,180,12,113,61,16]},"announce":[],"urlList":[]}}