{"title":"Italian X - Storia di una Moglie troppo libidinosa (1999) - anal","uid":4979696,"size":591478784,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:d61b80d3fc55da3d1bfa6092ee31793dcadda3c6&amp;dn=Italian+X+-+Storia+di+una+Moglie+troppo+libidinosa+%281999%29+-+anal&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pure_screens","files":1,"time":1246214550,"description":"Storia di una Moglie troppo libidinosa\n\naka &quot;Red Vibe Diaries 2: Dark Desires&quot; (1998)\n\n\n\n\nscreens: &lt;a href=&quot;\nhttp://www.jam-hot.com/pictures/1653/storia-di-una-moglie-troppo-libidinosa.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.jam-hot.com/pictures/1653/storia-di-una-moglie-troppo-libidinosa.html&lt;/a&gt;\n\n\n\nDVD-covers: &lt;a href=&quot;\nhttp://www.jam-hot.com/pictures/1654/storia-di-una-moglie-troppo-libidinosa-covers.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.jam-hot.com/pictures/1654/storia-di-una-moglie-troppo-libidinosa-covers.html&lt;/a&gt;\n\n\n\n\n\n\nSynopsis (English):\n\nStacy is a rich Beverly Hills wife. Her life at home with her doctor husband is\nunfulfilling so she becomes a whore at a high class brothel. There\nStacy satisfies her sexual needs. She also writes down her experiences\nand thoughts in her diary. Things get out of hand when a rich client\nof the brothel try's to possess Stacy. They argue and Stacy leaves the\nbrothel and never returns. She hears that the guy has been looking for\nher and that scares and excites her at the same time. Towards the end\nStacy and her husband seem to patch up their problems, but Stacy still\nhas her diary, fantasies and her red vibrator. \n\n\nSynopsis (Italian):\n\nStacy Valentine, nella sua migliore performance erotica di tutti i tempi. E' l'interprete di questo film &quot;scandalo&quot; di James Avalon: la trasformazione di una bellissima donna di casa nella piu vissuta &quot;puttana&quot; dell'alta societa di Beverly Hills. Ma questa trasformazione sara veramente liberatoria per lei? Oppure la rendera schiava di questo nuovo modo di vivere? E come nasconder cio al suo amante? Il suo comportamento non sara piu lo stesso, quando lei capira che il suo uomo la vuole solo per lui, in esclusiva, a costo di distruggerla completamente. La soluzione la troverete godendovi l'ingordigia erotica e le depravazioni sessuali della bella Stacy Valentine.\n\n\nActresses\n\n    * Alyssa Allure\n    * Holli Woods \n    * Misty Rain \n    * Laura Palmer (as Petra Sexton) \n    * Stacy Valentine\n \n   \nScene Breakdowns\n\n    * Scene 1. guy, Sean Rider, Stacy Valentine\n    * Scene 2. Chad Thomas, guy, Misty Rain, Peter North\n    * Scene 3. Alyssa Allure, Holli Woods, Julian\n    * Scene 4. Ian Daniels, Marc Wallice, Stacy Valentine\n    * Scene 5. Ian Daniels, Marc Wallice, Stacy Valentine, Tony Tedeschi\n    * Scene 6. Stacy Valentine, Tony Tedeschi\n\n\n\n\nREVIEW:\n\nGood story that actually goes on for more than 10 minutes after the last sex scene.\nJames Avalon directs another fine erotic and stylish film. The girls\nare beautiful and made to look as such. Buxom blonde Stacy Valentine\nis the center of three of the five scenes and performs a solo act in\nanother scene. In a dark scene with several flashlights, Misty takes\non two guys which ends with a double facial. People that like a good\nerotic film will enjoy this video. Though you should be into Stacy\nValentine being she plays such a large role in the film. \n\nScene One: Stacy Valentine and Sean Rider. \nStacy is trying on clothes in a boutique with the changing room door\npartly open so Vince can see inside. Stacy try's on a few dresses.\nAfter, salesperson, Sean Rider brings her a dress, Stacy asks him to\ncome in and give his opinion of how she looks. She asks him if he\nlikes her breasts and if he'd like to touch them. She does the same\nthing with her thigh as Sean rubs her pussy over her panties. Stacy\nshows him her tits and let's him suck on them. Sean eats her out and\nfingers her as she lifts a leg in the air. **Vince is watching from\noutside the changing room. She pushes Sean against a wall, squats down\nand blows him. Stacy eyes Sean as she strokes his cock and as he fucks\nher mouth with no hands of hers. Standing, he fucks her from behind.\nShe rides him reverse cowgirl and they screw with her shoulders on the\nfloor and him standing over her. Sean jerks off and cums on her chin\nand neck as she eyes him. Stacy licks and sucks on his cock. She looks\nat Vince as Vince puts on sunglasses and leaves. We find out soon that\nthis was a fantasy Vince had paid for. \n\nScene Two: Misty Rain, Chad Thomas and Peter North. \nMisty takes Chad to a room. Peter and Chad are in white shirts and\npants. Both have on white helmets (with flashlights on them),\nsunglasses and have hand held flashlights and mirrors. They shine\ntheir lights on Misty. Misty shows off her pussy. They undress Misty.\nThe guys lick her tits as the several flashlights shine all over her.\nChad fingers her pussy as she blows them both. Misty strokes Peter's\ncock in her mouth as Chad fucks her from behind. With Peter on his\nknees and Misty behind him getting fucked by Chad doggie style, she\npulls Peter's balls and cock backwards between his legs so she can\nlick his balls and suck on his dick (Very Hot). From this position\nMisty also strokes Peter's cock and deep throats him. She blows Peter\nbefore putting a condom on him so he can fuck her. Chad gets a little\nhead as Peter screws Misty. She gets off Peter's, condom covered, cock\nto get on Chad's, condom covered, cock (first time I ever saw Chad use\na condom with Misty). Misty jerks Peter off in her mouth as Chad fucks\nher on her side. Peter shoots his cum over, and on, her face and\ntongue. Chad is also cumming by her face, but I couldn't see him cum\nbecause of Peter cumming next to him. Misty sucks on both cocks. \n\nScene Three: Holly Woods (Holli), Alyssa Allure, Julian and Stacy\nValentine (solo). \nMisty, Vince and Stacy watch the sex scene on a small television in\nthe brothel. {**Stacy uses a red vibrator on herself during the scene.\nVince talks dirty to Stacy and she gets pussy juice all over the\nvibrator.} Julian and Alyssa enter a room where Holly is seated.\nJulian kisses on Holly's leg as Alyssa stands behind Holly moving a\nrose over Holly's face. Julian fingers Holly as Alyssa moves the rose\ndown by Holly's pussy. He then eats out Holly. Alyssa undresses Julian\nand offers his cock to Holly. Holly gives him oral sex while Alyssa\nfingers Holly's pussy. Both girls give him head. Holly deep throats\nJulian. Alyssa blows Julian while Holly fingers her own pussy. Julian\nscrews Holly from behind and Alyssa missionary. Holly rides him\nreverse cowgirl and he sodomizes Alyssa doggie style. Julian cums on\nboth ladies tongues and on Alyssa's face. They both lick and suck his\ncock as Stacy sucks on the vibrator. \n\nScene Four: Stacy Valentine, Marc Wallace, Ian Daniels, and Vince\nVouyer. \nAt the brothel Vince has a surprise for Stacy, &quot;Marc and Ian&quot;. The\nguys join her on a bed and go right at her. Ian goes to taste her\npussy as Marc helps undress her. Very briefly Ian fucks her and she\nblows Marc. Stacy then blows Ian as Marc fucks her doggie style. Stacy\nturns and blows Marc while Ian fucks her doggie style. *Vince sits on\nthe bed and watches (as does Laura from the small television). Vince\njoins in and fucks her, on her back, as she blows Marc. She then rides\nVince reverse cowgirl as she gives Marc some no hands head. Two cocks\nunload cum on her face simultaneously. A third cock joins the scene\nand cums in her open mouth and on her face (as the other two continue\njerking off over her face). Stacy briefly takes a suck on one of the\ndicks. \n\nScene Five: Stacy Valentine and Tony Tedeschi. \nStacy goes home to find her husband home early. He kisses her\npassionately. They move to a couch and kiss some more as he undresses.\nTony tongues her asshole before Stacy gives him a blowjob. The two\nscrew in a few positions (condom used). Stacy eyes him while sucking\non his cock. Tony jerks off and cums on his stomach as Stacy licks the\nhead of his cock. Stacy sucks on his cock and eyes him as she licks\nthe cum on his belly. She sucks on his cock some more. \n\n\nLanguage:   Italian\nDuration:   01:31:52\nVideo:      AVI, 352x240 25.00fps 757Kbps\nAudio:      MP3, MPEG Audio Layer 3 48000Hz stereo 96Kbps \n\n2,500+ torrents: \n(ALWAYS with honest screens &amp; detailed info)\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/pure_screens&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/pure_screens&lt;/a&gt;\n\n\n\n\n","torrent":{"xt":"urn:btih:d61b80d3fc55da3d1bfa6092ee31793dcadda3c6","amp;dn":"Italian+X+-+Storia+di+una+Moglie+troppo+libidinosa+%281999%29+-+anal","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d61b80d3fc55da3d1bfa6092ee31793dcadda3c6","infoHashBuffer":{"type":"Buffer","data":[214,27,128,211,252,85,218,61,27,250,96,146,238,49,121,61,202,221,163,198]},"announce":[],"urlList":[]}}