{"title":"The familiar of zero(chap 1-12)(eng.)","uid":7721963,"size":41029249,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d65a1ce4bf35347f86612c8656efd2dd04623981&amp;dn=The+familiar+of+zero%28chap+1-12%29%28eng.%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"shirokira","files":1,"time":1350095685,"description":"Louise is a noble girl who is terrible at magic, as her attempts usually result in an explosion. She is nicknamed &quot;Louise the Zero&quot; by her classmates, due to the inability to use any of the four magic elements. Early in the school year at the Tristain Academy of Magic, the second year students perform a special ritual where they summon their familiar, which serves as their eternal protector and partner, and is usually some sort of magical creature. But Louise summons Saito Hiraga, an ordinary teenage boy from Japan, leaving her totally humiliated.\nDue to the sacredness of the ritual, Louise reluctantly accepts Saito as her familiar, but proceeds to treat Saito as any other familiar, only worse, making him wash her clothes, sleep on a bed of hay, and whipping him with a riding crop for little or no reason. The Familiar of Zero follows the adventures of Louise and Saito as they help their classmates and friends, while occasionally blundering into situations where they risk their lives to save one another. Saito tries to find a way to get back to Japan, but he also has a mysterious power that allows him to wield swords and other weapons to perform heroic feats. They also eventually learn the truth behind Louise's magic inabilities.\n\n","torrent":{"xt":"urn:btih:d65a1ce4bf35347f86612c8656efd2dd04623981","amp;dn":"The+familiar+of+zero%28chap+1-12%29%28eng.%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d65a1ce4bf35347f86612c8656efd2dd04623981","infoHashBuffer":{"type":"Buffer","data":[214,90,28,228,191,53,52,127,134,97,44,134,86,239,210,221,4,98,57,129]},"announce":[],"urlList":[]}}