{"title":"Audition by Ryu Murakami translated by Ralph McCarthy","uid":8850160,"size":3419635,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d730a3a2cfed845644a76de8888820d1c22f96c2&amp;dn=Audition+by+Ryu+Murakami+translated+by+Ralph+McCarthy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":-1,"time":1377500898,"description":"Audition (ã‚ªãƒ¼ãƒ‡ã‚£ã‚·ãƒ§ãƒ³?) is a Japanese novel by Ryu Murakami published in 1997 and published in English in 2009. It was the basis for the film by Takashi Miike released in 1999.\n\nAoyama is a documentary maker who hasn't dated anyone since the death of his wife, Ryoko. He lives a placid existence with his teenage son, Shige, dreaming of remarrying. One day, his best friend Yoshikawa comes up with a plan to hold fake film auditions for young women looking for a breakout role. Of the thousands who apply, Aoyama only has eyes for the young, beautiful Yamasaki Asami - a shy, modest girl whose dreams of becoming a ballerina were cut short by an accident. Aoyama is infatuated by her and instigates several dates with her after the audition. Despite learning about her troubled past, which included consistent abuse as a child by her crippled step-father, Aoyama believes he is falling in love with her. He is given warnings by Yoshikawa that Asami may not be all that she seems, but Aoyama ignores him, seeing only the perfect woman he imagines Yamasaki Asami to be. It is only when it is possibly too late, that Aoyama discovers the horrifying truth about his new girlfriend...\n\n","torrent":{"xt":"urn:btih:d730a3a2cfed845644a76de8888820d1c22f96c2","amp;dn":"Audition+by+Ryu+Murakami+translated+by+Ralph+McCarthy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d730a3a2cfed845644a76de8888820d1c22f96c2","infoHashBuffer":{"type":"Buffer","data":[215,48,163,162,207,237,132,86,68,167,109,232,136,136,32,209,194,47,150,194]},"announce":[],"urlList":[]}}