{"title":"[ScoreLand] Alanna Ackerman (More To Fuck / 25 890 / 01.18.2013)","uid":8051947,"size":423631262,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:d738a92fd6f0ddddc12d9b925085d0f81efd7717&amp;dn=%5BScoreLand%5D+Alanna+Ackerman+%28More+To+Fuck+%2F+25+890+%2F+01.18.2013%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"chkm8te","files":1,"time":1358874530,"description":"[ScoreLand] Alanna Ackerman (More To Fuck / 25 890 / 01.18.2013)\n\nAlanna Ackerman and her Big Boobs Sampled have a Lot of guys in her life Horny Young. She's especially very fond of big black studs. In this scene, Alanna gets the black snake courtesy of us because she's a special girl and more to fuck .. She's kept her bush, loves having her ass plundered and will jerk off a guy herself to release his load of nut-sauce instead of him doing it to himself. She's pro-active that way. This is a dirty hot screwing session.\n\n&quot;When I Swing, two guys I Enjoy More as a male-Female-male,&quot; says Alanna. &quot;So it was only natural I would start to wonder what anal sex felt like. I did it the first time just me and a boyfriend. I started off slow, but quickly found out I liked it a lot. Also that I could handle a Real Ass Pounding in the very Nicely. It feels even Better with one in both holes at the Same time. &quot;\n\n&quot;Sex With vaginal, a Guy Has to hit the right spots for IT to Feel Good, but with Anal Sex there is not much work required from the Guy to Give me Pleasure. There are SO many nerves just go there That I'm Crazy When Getting IT slow or hard. &quot;\n\n&quot;I Love to Talk dirty. I am not one to Blurt out pre-Thought out phrases . I only scream when you make me, and I say what pops in my head at the time. Whatever is going to turn me on. Yes, I said me. I don't just talk dirty for you. I like it too. &quot;\n\n&quot;My Favorite Cock Size is over 11.&quot; Nice and thick. Not many guys have That. &quot;\n\n&quot;I Stopped Keeping Track of guys When I was 18. Don't worry, though. I Remember by every Guy He did something I liked or maybe He was just really hot. &quot;\n\n&quot;People ask if I Get Together with Girlfriends Talk About and the guys We've HAD with the Biggest Cocks. I guess you could say this is where I am a little selfish. I don't like to give the girls names, but, yes, sometimes we chat about the last hot piece of ass we got. I am just not too quick to give out my favorites, the ones I want for myself. &quot;\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=8snhe1e4jefdvyababst.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=8snhe1e4jefdvyababst.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=3rjhdp4qptnyupbut6ph.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=3rjhdp4qptnyupbut6ph.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:d738a92fd6f0ddddc12d9b925085d0f81efd7717","amp;dn":"%5BScoreLand%5D+Alanna+Ackerman+%28More+To+Fuck+%2F+25+890+%2F+01.18.2013%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d738a92fd6f0ddddc12d9b925085d0f81efd7717","infoHashBuffer":{"type":"Buffer","data":[215,56,169,47,214,240,221,221,193,45,155,146,80,133,208,248,30,253,119,23]},"announce":[],"urlList":[]}}