{"title":"Encyclopedia of Body Adornment","uid":7733743,"size":6586036,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d7a790519971b46d592b66c269ad2f807f2720f2&amp;dn=Encyclopedia+of+Body+Adornment&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Djofullinn","files":1,"time":1350414109,"description":"People everywhere have attempted to change their bodies in an effort to meet their cultural standards of beauty, as well as their religious and/or social obligations. Often times, this modification or adornment of their bodies is part of the complex process of creating and re-creating personal and social identities. Body painting has probably been practiced since the Paleolithic as archaeological evidence indicates, and the earliest human evidence of tattooing goes back to the Neolithic with mummies found in Europe, Central Asia, the Andes and the Middle East. Adornments such as jewelry have been found in the earliest human graves and bodies unearthed from five thousand years ago show signs of intentional head shaping. It is clear that adorning and modifying the body is a central human practice. Over 200 entries address the major adornments and modifications, their historical and cross-cultural locations, and the major cultural groups and places in which body modification has been central to social and cultural practices. This encyclopedia also includes background information on the some of the central figures involved in creating and popularizing tattooing, piercing, and other body modifications in the modern world. Finally, the book addresses some of the major theoretical issues surrounding the temporary and permanent modification of the body, the laws and customs regarding the marking of the body, and the social movements that have influenced or embraced body modification, and those which have been affected by it.\n &lt;a href=&quot;\nhttp://www.amazon.com/Encyclopedia-Body-Adornment-Margo-DeMello/dp/0313336954/ref=sr_1_1?ie=UTF8&amp;qid=1350406423&amp;sr=8-1&amp;keywords=encyclopedia+of+body+adornment&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Encyclopedia-Body-Adornment-Margo-DeMello/dp/0313336954/ref=sr_1_1?ie=UTF8&amp;qid=1350406423&amp;sr=8-1&amp;keywords=encyclopedia+of+body+adornment&lt;/a&gt;","torrent":{"xt":"urn:btih:d7a790519971b46d592b66c269ad2f807f2720f2","amp;dn":"Encyclopedia+of+Body+Adornment","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d7a790519971b46d592b66c269ad2f807f2720f2","infoHashBuffer":{"type":"Buffer","data":[215,167,144,81,153,113,180,109,89,43,102,194,105,173,47,128,127,39,32,242]},"announce":[],"urlList":[]}}