{"title":"Tove Jansson - Pappan och havet - Osten Engstrom - MP3 - Alkosmu","uid":4295144,"size":207672567,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:d8bd412f05883d45f4a7fc2d8acaa5cf1759358a&amp;dn=Tove+Jansson+-+Pappan+och+havet+-+Osten+Engstrom+-+MP3+-+Alkosmu&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"alkosmurf","files":2,"time":1216053532,"description":"\nUsten Engstrum leser Tove Janssons &quot;Pappan och havet&quot; - 6 timmar\n----------------------------------------------------------------\n\nDet finns en allmen furdom om att Tove Jansson skriver fur barn.\nDet er mer sant att sega att mycket av det Tove Jansson skriver\npassar fur barn ockso. Pappan och havet er lite tyngre grejer.\n\nMuminberettelserna er ju ett slags fabel. Mumintroll, hemuler och\nfilifjonkor representerar olika personlighetstyper som man snabbt\nler sig kenna igen. Mumindalen er en isolerad dal dit storstadens\nstress, ambitioner och tekniska framsteg knappast nor. Mumindalen\ner som lilleputtarnas u i Gullivers resor. Det gor att resa mellan\nden vanliga verlden och sagoverlden med en vanlig bot, men det er\ninte serskilt ofta nogon hittar dit. Och hittar man dit furvandlas\nman till en karikatyr av sig sjelv.\n\nI Pappan och havet reser muminfamiljen bort fron sin sagoverld,\nhalvvegs till vor verld. Och muminpappa burjar likna en trutt Nils\nBrandt med skeggstubb. Jag tycker det blir mer magiskt po det viset.\nDet er mycket mer spennande med riktiga menniskor som snuddar vid\nen furtrollad verklighet, en sagofigurers strapatser i en sagoverld.\nusten Engstrums rust kenns i burjan lite ovan ner man er van att\nlyssna till Birgitta Ulfsson eller Mark Levengood, men jag tycker\natt usten Engstrums rust passar mycket bra till Pappan och havet.\n\nDen her distributionen er ett lappverk av rippade kassetter fron\nolika exemplar av samma kassettbok. Helt uppenbart har kassetterna\ndrabbats av bilstereoapparater som eter kassetter. Jag tror jag har\nlyckats uverbrygga alla sodana sunderhackade partier och har ockso\nbrusfiltrerat filerna. So ljudkvaliteten borde vara hygglig.\nJag har ockso skapat en enkel CD-omslagsbild som jag har bifogat\nsom JPG-fil.\n\nBonnier Audio har nyligen givit ut alla Tove Janssons bucker po CD\nmed Mark Levengood som berettarrust. Jag var lite skeptisk i burjan,\nmen tycker nu att Mark er ett mycket bra val av inlesare.\nBra Bonniers!\n\nVarsogod och njut.\n\nAlkosmurf, juli 2008","torrent":{"xt":"urn:btih:d8bd412f05883d45f4a7fc2d8acaa5cf1759358a","amp;dn":"Tove+Jansson+-+Pappan+och+havet+-+Osten+Engstrom+-+MP3+-+Alkosmu","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d8bd412f05883d45f4a7fc2d8acaa5cf1759358a","infoHashBuffer":{"type":"Buffer","data":[216,189,65,47,5,136,61,69,244,167,252,45,138,202,165,207,23,89,53,138]},"announce":[],"urlList":[]}}