{"title":"MacCarrick Brothers Trilogy","uid":5152750,"size":1144043,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d9a373eb9e2c31c41f9cd8c3b7abfc3a0d5e7468&amp;dn=MacCarrick+Brothers+Trilogy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"elisabeth1990","files":3,"time":1257658088,"description":"Kresley Cole's MacCarrick Brothers Trilogy. \n\nIf You Dare is about a young noblewoman alone in Andorra and the rough Scottish mercenary whose life she begins to regret saving. \n\nIf You Desire is about a Scottish assassin and the Englishwoman he's been obsessed with for the ten years he has carefully avoided her, knowing that he could never have her. When her life is threatened, her father insists upon a temporary marriage of convenience while the assassin protects her.\n\nIf You Deceive is about a Scotsman who doesn't realise at first that the woman whose virginity he took is the daughter of his most hated enemies, the couple who ruined his life. She knows nothing of the connexion, but he realises it as soon as he finally hears her surname. He can't get her off his mind, though, so he decides to pretend that he will marry her, until he's worked his lust for her out of his system, when he plans to dump her.\n\nTo top it all off, the three brothers are under an ancient Scottish curse that apparently foretells that none of them can marry. So lots of star-crossed lovers stuff.\n\nI'm sure you can find many much better synopses and reviews, but there's a quick guide. \n\nThere is some pretty explicit sexual content. The men are fiercely possessive and, of course, amazingly virile. The sex is aggressive but always more than consensual, although the men become so aroused it's painful while the women only want it quite badly. There are some scenes of seduction, too, and plenty of emotional drama.\n\nThey're very well-written, but they're definitely erotic romance, for adults only.","torrent":{"xt":"urn:btih:d9a373eb9e2c31c41f9cd8c3b7abfc3a0d5e7468","amp;dn":"MacCarrick+Brothers+Trilogy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d9a373eb9e2c31c41f9cd8c3b7abfc3a0d5e7468","infoHashBuffer":{"type":"Buffer","data":[217,163,115,235,158,44,49,196,31,156,216,195,183,171,252,58,13,94,116,104]},"announce":[],"urlList":[]}}