{"title":"[1968] Krzysztof Kieslowski - Z miasta Lodzi (EN)","uid":4407793,"size":104786164,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:d9e9794ab05a9508a044ec32bb2f46a146ed94d5&amp;dn=%5B1968%5D+Krzysztof+Kieslowski+-+Z+miasta+Lodzi+%28EN%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"vpadilla23","files":5,"time":1222057125,"description":"This is something like a school assignment from when Kieslowski was a film student in Lodz. It is a simple visual celebration of the passing of old Lodz (what was left of it from the war) as new building replace the old and new people replace the old. The old are really resentful at being displaced. This expresses itself in the music. The old people, long time workers at the factory, are upset because the factories traditional mandolin band is being, well, disbanded, to be replaced by pop music. Believe me when I tell you that the pop music, taking on all sorts of forms from the kind of euro rock derived from misheard American and British bands to rumba rhythms with corny lyrics. Really the old stuff was great and now its gone. The women of the factory are being pensioned off one by one and they&amp;#039;re all reluctant to leave but leave they must. Of course Lodz is something of an interesting case. A village which was chosen to be the Manchester of the Russian empire it became known as The Promised Land because of the availability of work in the huge textile plants and became the second largest city in Poland. The Polish population was further shaken by the war and virtually no one lives where either their parents or grand parents lived. The turnover has be the one constant of this synthetically created place. Kieslowski is unable to display his nostalgia except reflected from the hard surface of this little gem.\n\nSUBS IN ENGLISH, SPANISH AND PORTUGUESE","torrent":{"xt":"urn:btih:d9e9794ab05a9508a044ec32bb2f46a146ed94d5","amp;dn":"%5B1968%5D+Krzysztof+Kieslowski+-+Z+miasta+Lodzi+%28EN%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d9e9794ab05a9508a044ec32bb2f46a146ed94d5","infoHashBuffer":{"type":"Buffer","data":[217,233,121,74,176,90,149,8,160,68,236,50,187,47,70,161,70,237,148,213]},"announce":[],"urlList":[]}}