{"title":"Vulvodynia Survival Guide","uid":4563180,"size":45909038,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:da19a5280824084b48b23f73f4476fb6d7475f99&amp;dn=Vulvodynia+Survival+Guide&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"kachara","files":-1,"time":1228763669,"description":" Vulvodynia Survival Guide: How to Overcome Painful Vaginal Symptoms &amp; Enjoy an Active Lifestyle\n\nAuthor: Howard I. Glazer, PhD; Gae M. Rodke, MD\n\nThe Vulvodynia Survival Guide offers women information, support and strategies to eliminate the symptoms of this chronic condition, which include burning, itching, stinging, rawness and painful intercourse.\n\nThe authors define vulvodynia and provide a checklist of common symptoms. The female anatomy is described to help the reader identify the location of her pain and communicate more effectively with her doctor. Readers will learn how to identify triggers, modify diets to reduce symptoms, find knowledgeable medical help, learn how to reduce debilitating pain, and renew enjoyment of sexual relations and normal daily activities.\n\nA resource section containing lists of clinics, websites, and organizations is included, along with a list of references, index and glossary.\n\nHoward I. Glazer, PhD, is a clinical psychologist in New York City using surface electromyographic feedback in the treatment of pelvic floor muscle dysfunctions and vulvovaginal pain syndromes. He is also clinical associate professor of psychology in psychiatry and in obstetrics and gynecology at Cornell University Medical College/New York Presbyterian Hospital. Gae M. Rodke, MD, is clinical assistant professor of obstetrics and gynecology at Columbia University College of Physicians and Surgeons, and a clinical associate attending physician at St. Luke&amp;#039;s Roosevelt Hospital Center.\n\nPurpose:  Consumer information/support; Health information\n\nGeographic Origin:  United States\n\nLanguage of Resource:  English\n\nGroups:  Adult women\n\nPublisher:  New Harbinger\n\nDate Published:  2002\n\nLast Reviewed by Women&amp;#039;s Health Matters:  June 25, 2008 ","torrent":{"xt":"urn:btih:da19a5280824084b48b23f73f4476fb6d7475f99","amp;dn":"Vulvodynia+Survival+Guide","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"da19a5280824084b48b23f73f4476fb6d7475f99","infoHashBuffer":{"type":"Buffer","data":[218,25,165,40,8,36,8,75,72,178,63,115,244,71,111,182,215,71,95,153]},"announce":[],"urlList":[]}}