{"title":"Preston Sterling v1.1 full and data","uid":14163437,"size":327343467,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:da70b5f202156e1129c73362c6be8d7d948b40cf&amp;dn=Preston+Sterling+v1.1+full+and+data&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"tiropitaki","files":2,"time":1459726657,"description":"PRESTON STERLING AND THE LEGEND OF EXCALIBUR \r\nis an adventure that will transport you into the world of English myths and legends. Tackle tricky puzzles and enjoy an exciting story, lovable characters and stunning scenes and locations!\r\n\r\nAN INNOVATIVE DESIGN\r\nThe game's quick-to-learn touch controls and gradually increasing level of difficulty make the adventure easy to grasp, even for beginners. It also offers dynamic help tools and optional tips to help you to successfully master frustrating stages of the game without missing out on the fun involved in solving the challenging tasks and activities faced by Preston.\r\n\r\nAN EXCITING ADVENTURE\r\nPreston Sterling is an adventurer, traveler and treasure-hunter all rolled into one. He's normally never afraid of a challenge, but his new job quickly tests him to his limits. Preston's latest task is to find the most mystical artefact in English mythology: Excalibur, the sword of the legendary King Arthur. Little does he know, however, that the hunt for this fabled treasure will involve far more danger than he could ever have imagined ...\r\n\r\nREALISTIC SCENES AND LOCATIONS\r\nExperience an amazingly detailed and lovingly created world of adventure. Every location on Preston's journey has its own special charm that contributes towards your exciting game experience.\r\n\r\nMULTIPLE LANGUAGES\r\nThe game is available in German, English and Russian (please note that you can change the language in the options menu of the app).\r\n\r\nWE RECOMMEND PLAYING ON DEVICES WITH 1 GB RAM OR MORE. \r\nPlease adjust the level of graphic details in the options menu within the title screen if the app isn't working properly.\r\n\r\nWhat’s new:\r\n- added more levels of graphic details to target a wider spectrum of devices and make our game playable on low-end devices too (this option can be found in the options menu within the title screen)\r\n- fixed some bugs\r\n\r\nRequires Android OS 2.3 and up \r\nInstall APK,Place data folder in SDCard/Android/Obb/ and play","torrent":{"xt":"urn:btih:da70b5f202156e1129c73362c6be8d7d948b40cf","amp;dn":"Preston+Sterling+v1.1+full+and+data","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"da70b5f202156e1129c73362c6be8d7d948b40cf","infoHashBuffer":{"type":"Buffer","data":[218,112,181,242,2,21,110,17,41,199,51,98,198,190,141,125,148,139,64,207]},"announce":[],"urlList":[]}}