{"title":"Joan Jett &amp; The Blackhearts - Backlash (2nafish)","uid":5734123,"size":169549828,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:dbc9987271406c8e128430bef1afaf9bca2ae373&amp;dn=Joan+Jett+%26+The+Blackhearts+-+Backlash+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1280709734,"description":"File Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 8000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\nNotorious is a studio album by Joan Jett and the Blackhearts. The album was released in 1991.\n\nJoan Jett (born Joan Marie Larkin; September 22, 1958) is an American rock guitarist, singer, songwriter, producer and actress.\n\nShe is best known for her work with Joan Jett &amp; the Blackhearts including their hit cover &quot;I Love Rock 'n' Roll&quot;, which was #1 on the Billboard charts from March 20 to May 1, 1982, as well as for their other popular recordings including &quot;Crimson and Clover,&quot; &quot;I Hate Myself for Loving You,&quot; &quot;Do You Want to Touch Me,&quot; &quot;Light of Day,&quot; &quot;Love Is All Around,&quot; &quot;Bad Reputation,&quot; and &quot;Little Liar.&quot;\n\nHer musical and songwriting approach is heavily influenced by the hard-edged, hard beat-driven rhythms common to many rock bands of her native Philadelphia, often featuring lyrics surrounding themes of lost love, criticisms of insincerity, the quest for authenticity, the struggles and resolutions of the American middle class.\n\nJoan Jett and the Blackhearts became the first rock band to perform a series of shows at the Lunt-Fontanne Theatre on Broadway, breaking the record at the time for the fastest ticket sell-out. Her next release, Up Your Alley, went multi-platinum and was followed by The Hit List, which was an album consisting of cover songs. During this time, Jett co-wrote the song &quot;House of Fire,&quot; which appeared on Alice Cooper's 1989 album Trash.\n\nHer 1991 release Notorious, which featured The Replacements' Paul Westerberg and former Billy Idol bassist Phil Feit, was the last with Sony/CBS as Jett switched to Warner Brothers. A CD single of &quot;Let's Do It&quot; featuring Jett and Westerberg was also released during this time and appeared in the song credits for the movie Tank Girl. In 1993, Jett and Laguna released Flashback, a compilation of various songs on their own Blackheart Records.\n\nJett produced several bands prior to releasing her debut and her label Blackheart Records released recordings from varied artists such as thrash-rock band Metal Church and rapper Big Daddy Kane.\n\nThe press touted Jett as the &quot;Godmother of Punk&quot; and the &quot;Original Riot Grrrl.&quot; In 1994, the Blackhearts released the well-received Pure and Simple, which featured tracks written with Babes in Toyland's Kat Bjelland, L7's Donita Sparks and Bikini Kill's Kathleen Hanna.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:dbc9987271406c8e128430bef1afaf9bca2ae373","amp;dn":"Joan+Jett+%26+The+Blackhearts+-+Backlash+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dbc9987271406c8e128430bef1afaf9bca2ae373","infoHashBuffer":{"type":"Buffer","data":[219,201,152,114,113,64,108,142,18,132,48,190,241,175,175,155,202,42,227,115]},"announce":[],"urlList":[]}}