{"title":"Posterino v. 2.5.2 with SK patch","uid":6913263,"size":22267563,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:dbd0671e2e8390074b729e9820c5157da67d913b&amp;dn=Posterino+v.+2.5.2+with+SK+patch&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"polisdavid","files":-1,"time":1324927142,"description":"Official Web Site: &lt;a href=&quot; http://zykloid.com/posterino&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://zykloid.com/posterino&lt;/a&gt;\n\nPosterino offers enhanced customization and flexibility including a variety of new stylish templates featuring grids of identical or odd sized image boxes. You can customize the size and shape of these boxes at any time. And with a single click, the application will automatically fill those boxes with random images drawn from the photos you uploaded. If you prefer to manually select images, you can simply drag and drop images into the template.\n\nSharing your photos is quick and simple as well. You can directly upload your completed collages to your Flickr account from inside the app and export photos to iPhoto and your email. Posterino 2 also lets you create and send custom e-cards with your very own stamps and postmarks.\n\nFeatures:\n\n* Easily customize the layout of your images: grid, irregular, random\n\n* Easily change the number of images in a document\n\n* Alter the frame you use for your images\n\n* Tailor the image filter (black &amp; white, sepia, sharpening etc.) to your\n  needs\n\n* Enjoy new themed templates: A &quot;western&quot; theme automatically\n  transforms all images into sepia. A &quot;Black &amp; White&quot; theme makes all\n  images B&amp;W.\n\n* Integrate Posterino 2 with the latest versions of iPhoto, Aperture and\n  Lightroom\n\n* Export to disk, as an e-mail, to iPhoto, to Flickr and as your desktop\n  background\n\n* More easily customize your printing\n\n* Gain more fine grained control of your document with a new inspector\n\n* View your document in full-screen mode\n\nBecause of its ease and compatibility with Apple iLife suite, Posterino 2 is the ideal app for creating beautiful photo collages whether you are a casual user or photography professional. The only limit is your imagination.\n\nWhat's New:\n\n* Added Spanish and Japanese language support for the calendar feature.\n\n* Added some new articles regarding the calendar object to the online\n  help.\n\n* Solved a problem that could result in a white hairline around a rendered\n  document. This effect has been visible on documents with colored\n  background.\n\n* Solved a newsletter subscription problem.\n\nSystem Requirements:\n\nIntel Mac, OS X.6.6 or later\n\n--- PLEASE SEED ---","torrent":{"xt":"urn:btih:dbd0671e2e8390074b729e9820c5157da67d913b","amp;dn":"Posterino+v.+2.5.2+with+SK+patch","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dbd0671e2e8390074b729e9820c5157da67d913b","infoHashBuffer":{"type":"Buffer","data":[219,208,103,30,46,131,144,7,75,114,158,152,32,197,21,125,166,125,145,59]},"announce":[],"urlList":[]}}