{"title":"Bill Medley - Your Heart to Mine: Dedicated to the Blues [2013] ","uid":10399210,"size":310046792,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:dcd217624ae7d2ac28799ff29b1882ad277b0630&amp;dn=Bill+Medley+-+Your+Heart+to+Mine%3A+Dedicated+to+the+Blues+%5B2013%5D+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":-1,"time":1403328363,"description":"FLAC / Lossless / Log (100%)\nLabel/Cat#: Fuel 2000 #061987\nCountry: USA\nYear: November 19, 2013\nGenre: blues\nFormat: CD,Album\n\n[b]\n\n1\t Drowned In My Own Tears\t\n2\t Your Precious Love\t\n3\t I Wanna Make Love To You\t\n4\t Change Gonna Come\t\n5\t I've Been Lovin You Too Long\t\n6\t Rock Me Baby\t\n7\t You're The One\t\n8\t Pledging My Love\t\n9\t Hold On I'm Comin\t\n10\t What You Want Me To Do\t\n11\t This Magic Moment\t\n12\t This Will Be The Last Time\n\n\n\nAlthough they had a handful of solid hits in the 1960s, the Righteous Brothers will always be remembered for the masterful &quot;You've Lost That Lovin' Feelin'&quot; from 1964. Written by Barry Mann and Cynthia Weil and produced by Phil Spector in his trademark Wall of Sound style, &quot;You've Lost That Lovin' Feelin'&quot; sets an ominous and emotionally ravished tone from its opening line (&quot;You never close your eyes...&quot;) and then builds even more powerfully from there. Far from being another of Spector's brilliantly crafted teen symphonies, &quot;You've Lost That Lovin' Feelin'&quot; is instead a thoroughly adult one, and the desperation that builds in Bill Medley's lead vocal (echoed by Bobby Hatfield's impassioned call-and-response interjections) comes from a man who truly understands what has been lost and is facing the darkest night of his very soul. It is a phenomenal record, and any singer would be hard put to equal it. the Righteous Brothers' impressive blue-eyed soul catalog, and that song in particular, leave a lot to be lived up to, and perhaps to his credit, Medley hasn't claimed he could. Hatfield died in 2003, and Medley has recorded sparingly since, releasing Damn Near Righteous in 2007, and a live album recorded in Branson in 2009. This set, which features Medley covering some of the R&amp;B and blues songs that informed both his and Hatfield's careers, including songs made famous by Ray Charles, B.B. King, Johnny Ace, Jimmy Reed, Sam Cooke, Bobby &quot;Blue&quot; Bland, and others, is a sparsely accompanied (mostly piano and/or acoustic guitar, with drums on only a couple of the tracks) muted gem, and it shows to great effect how well Medley's signature baritone has aged and sweetened. His vocals have a hoarse, ravaged quality to them now, but make no mistake, he's singing as well as he ever has, bringing deep, soulful wisdom, patience, and sincerity to each of these classics, making each feel lived in and known. Highlights here, for an album that shows a remarkable consistency of tone and slow-burning emotional balance, are the opener, a version of Ray Charles' &quot;Drown in My Own Tears,&quot; a geared-down and acoustic guitar rendition of B.B. King's &quot;Rock Me Baby,&quot; an emotional deepening and reshaping of Johnny Ace's &quot;Pledging My Love,&quot; and a fine cover of the Drifters' &quot;This Magic Moment,&quot; given weight, depth, and urgency by being slowed-down by half. Nothing here changes Medley's impossible dilemma of living up to earlier successes like &quot;You've Lost That Lovin' Feelin',&quot; and he isn't really trying to, but is instead reaching for the same musical sources he and Hatfield reached for back in the day, honoring and playing tribute to those songs and artists, and in the process, he's singing with the same sort of passion and balance, but given the years, he sounds almost more comfortable. He's still got that voice, and he knows what songs to put it to, making this quiet album a powerful emotional statement rather than simply a cash-in footnote to the Righteous Brothers.","torrent":{"xt":"urn:btih:dcd217624ae7d2ac28799ff29b1882ad277b0630","amp;dn":"Bill+Medley+-+Your+Heart+to+Mine%3A+Dedicated+to+the+Blues+%5B2013%5D+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dcd217624ae7d2ac28799ff29b1882ad277b0630","infoHashBuffer":{"type":"Buffer","data":[220,210,23,98,74,231,210,172,40,121,159,242,155,24,130,173,39,123,6,48]},"announce":[],"urlList":[]}}