{"title":"Mark D. White &amp; Robert Arp - Batman and Philosophy (The Dark","uid":7297511,"size":4331243,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dee03110c605de89d2698becc12906f60223f311&amp;dn=Mark+D.+White+%26amp%3B+Robert+Arp+-+Batman+and+Philosophy+%28The+Dark&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"iradins","files":-1,"time":1337931781,"description":"White (political science, economics, &amp; philosophy, Coll. of Staten Island/CUNY) and Arp (research associate, National Ctr. for Biomedical Ontology, Univ. at Buffalo; ed., South Park and Philosophy) use the story of a comic book figure-Batman-to deal with myriad philosophical questions. White contributes two of the 20 chapters, and the other 18 are written by various philosophy scholars. The writing in each chapter is engaging as the detailed story of Batman's fictional life and experiences unfold. The philosophical questions concern, e.g., the nature of personal identity; responsibility, or lack of it, for action, including the so-called insane act; free will vs. determinism; the nature of moral acts; social obligation; political commitment; and the ethics of right and wrong. Scattered throughout the chapters are pertinent insights from well-known philosophers of the past and present, including Plato, Aristotle, Kant, Kierkegaard, Heidegger, Hobbes, Nietzsche, and Wittgenstein. There are extensive footnotes for each chapter so that readers can turn to original sources. This philosophical examination of Batman's actions through nearly 70 years of comic books, television shows, and movies is highly recommended for all libraries.\n\n\n","torrent":{"xt":"urn:btih:dee03110c605de89d2698becc12906f60223f311","amp;dn":"Mark+D.+White+%26amp%3B+Robert+Arp+-+Batman+and+Philosophy+%28The+Dark","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dee03110c605de89d2698becc12906f60223f311","infoHashBuffer":{"type":"Buffer","data":[222,224,49,16,198,5,222,137,210,105,139,236,193,41,6,246,2,35,243,17]},"announce":[],"urlList":[]}}