{"title":"Wie is...de Mol? - S09E05","uid":4709351,"size":542541174,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:df8efb78ffeb34eaa1936b666d587c656fa3d150&amp;dn=Wie+is...de+Mol%3F+-+S09E05&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Gtaboy107","files":-1,"time":1233960233,"description":"Aflevering 5 van het 9e seizoen 'Wie is...de Mol?' in Nederland. \nUitgezonden op 05-02-2009\n\n10 Nederlanders reizen af naar Noord-Ierland. Ze zullen moeten samenwerken om allerlei opdrachten uit te voeren en geld te verdienen voor de pot. Maar ÃƒÂ©ÃƒÂ©n van de tien is een bedrieger, en die is er alles aangelegen om de opdrachten te saboteren. EÃƒÂ©n van de tien is namelijk de Mol. Na elke ronde krijgen de kandidaten 20 vragen (in de finale 40 vragen) over de identiteit van de Mol. Degene die de minste goede antwoorden geeft, ligt uit het spel. Uiteindelijk blijven er drie kandidaten in de finale over (m.u.v. seizoen 7.) EÃƒÂ©n zal er winnen, ÃƒÂ©ÃƒÂ©n zal verliezen en de derde is de Mol. De kandidaat die de finale wint, oftewel de test in de finale het beste maakt, wint het geld in de pot. Bij gelijkspel wordt gekeken wie het snelst was.\n\nDe makers van het Avro-programma 'Wie is de Mol?' hebben de hulp ingeroepen van vier oudgedienden om het nieuwe seizoen in januari met een verrassing te laten beginnen. De programmamaker lieten zich voor de negende editie adviseren door de voormalige mollen Dennis Weening, Inge Ipenburg, Yvon Jaspers en Milouska Meulens. Dit viertal vormt de secret mol society. Over de rol van dit gezelschap willen de makers nog niet uit de school klappen. Wel is duidelijk dat Pieter Jan Hagens nog meer grote verassing voor de kijkers in petto heeft.\n\nDe kandidaten van dit jaar zijn:\n\nAnniek Pheifer, Dennis Storm, Froukje Jansen, Hans Schiffers, Jon van Eerd, Paula Udondek, Rick Engelkes, Sebastiaan Labrie, Vera Mann en ViviÃƒÂ«nne van den Assem.\n\n\n.divx bestand\naf te spelen met VLC Media Player http://www.videolan.org/vlc/","torrent":{"xt":"urn:btih:df8efb78ffeb34eaa1936b666d587c656fa3d150","amp;dn":"Wie+is...de+Mol%3F+-+S09E05","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"df8efb78ffeb34eaa1936b666d587c656fa3d150","infoHashBuffer":{"type":"Buffer","data":[223,142,251,120,255,235,52,234,161,147,107,102,109,88,124,101,111,163,209,80]},"announce":[],"urlList":[]}}