{"title":"#014 - You Are There (Mono)","uid":4305386,"size":93608440,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e24f481be708925038b9af5715785512775e721d&amp;dn=%23014+-+You+Are+There+%28Mono%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"West-Independent","files":7,"time":1216515137,"description":"Catalog:\n#014\n\nArtist \nMono\n\nAlbum \nYou Are There\n\nRating\t \t\n4.5/5\t\t\n\nRelease Date \nApr 11, 2006\n\nRecording Date \nFeb 2005-Sep 2005\n\nLabel\nTemporary Residence\n\n\n\nReview by Thom Jurek\nJapanese power quartet Mono return with a fifth album, and their fourth for Temporary Residence. You Are There, engineered and mixed by Steve Albini, picks up the formula where he and the band left off on Walking Cloud and Deep Red Sky, Flag Fluttered and the Sun Shined. Much has been made of Mono&amp;#039;s engagement and deployment of dynamics. While it&amp;#039;s true that earlier recordings paid homage to the band&amp;#039;s collective heroes and influences, Mono have increasingly carved out their own terrain in composition, recording, and performance. You Are There is comprised of six pieces. They range in duration from just under four minutes to over 15. &quot;The Flames Beyond Cold Mountain&quot; begins quietly yet forbiddingly with rounded, hushed guitars playing in droned harmony. Sustained, rounded tones are joined by what sounds like voices, sparsely registering before a single guitar states a skeletal melody above the whispering din, establishing tension gradually, repetitively. Another six-string joins in, cymbals shimmer, a bass plays a simple droned line to signify the chord changes. As the tom toms enter gradually, the melodic invention becomes more pronounced. There is texture, ambience; silence in the slowly decreasing space. The entire thing splits open at six minutes and begins to roar, ever insistently, until it is a humming throng of feedback and axe scree while never losing sight of the harmonic framework of the tune. Tempi remain static, but everything becomes punishing and loud before returning to some semblance of halting lyricism at ten minutes in before whispering out and returning to the din before disappearing into silence. By contrast, &quot;The Heart Has Asked for the Pleasures&quot; is brief, almost a folk song. It is sheer &quot;prettiness,&quot; is enhanced by its brevity (3:43). It feels like a lullaby. &quot;Yearning&quot; begins much the same way, and it feels like the guitars are seeking out a lyric they eventually find. Leads are twinned harmonically, playing counterpoint with only the cymbals embellishing the sound. But of course it cannot remain. Layers are added very slowly and purposefully until the tension begins to mount, though it mounts in such a gorgeous way. Mono&amp;#039;s guitarists almost feel like they are a young Tom Verlaine and Richard Lloyd from Television as they breathe one another in, observe one another, and wind one another further inside the melody they cook up. When this one heats up, it shakes the entire speaker set to the foundation as elements of flamenco, classical, and Nippon folk music get stitched into the mix with a rusty stiletto and C4. And lest one think that moving from softly initiated melodic fragments to full-on volume shred jarring, one need only to hear the haunted aesthetic in the title cut that never, ever moves beyond a mournful whisper. And this continues only a bit more insistently with a kind of quiet majesty on &quot;The Remains of the Day.&quot; The set&amp;#039;s final cut moves from crystalline riffing to power rock and back, through an intricate, finger-picked series of motifs. Even when it erupts it remains knotty and narcotic in its appeal. Unlike Pelican and Isis, Mono have no use for heavy metal post-rock pomp. They are rock songwriters whose lyrics are guitar lines sung, shrieked, and wailed to the accompaniment of a masterful rhythm section. Mono are a rock band -- and a damn fine one -- and they only get better with time. \n","torrent":{"xt":"urn:btih:e24f481be708925038b9af5715785512775e721d","amp;dn":"%23014+-+You+Are+There+%28Mono%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e24f481be708925038b9af5715785512775e721d","infoHashBuffer":{"type":"Buffer","data":[226,79,72,27,231,8,146,80,56,185,175,87,21,120,85,18,119,94,114,29]},"announce":[],"urlList":[]}}