{"title":"Son.of.Paleface.1952.720p.HDDVD.x264-Codres","uid":6090990,"size":4376129080,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:e2561f12d4106cac585a377099dc129414dabfa3&amp;dn=Son.of.Paleface.1952.720p.HDDVD.x264-Codres&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"codres","files":1,"time":1294562199,"description":"My personal rip from a very rare HDDVD just bought from Ebay It's the best version available. This is a must see comedy!!!!\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0045177/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0045177/&lt;/a&gt;\n\nQuote:\n\nWhen one ponders the wacky western film romp, one thinks immediately of Blazing Saddles. \nForget Blazing Saddles. I'm putting my big, fat western wallet down on an early Frank Tashlin film from 1952 starring the ineffable Bob Hope entitled Son of Paleface.\n\nSon of Paleface was a sequel to Hope's colossal 1948 hit The Paleface, on which Tashlin was one of the writers. But fed up with how his ideas were executed, when Tashlin had the chance to do a sequel, he smashed it out of the ball park.\n\nHope plays Junior Potter, the son of 'Paleface' -- the man who won the West, but, as Junior points out, if he won it he was using loaded dice. Junior comes to the town of Sawbuck Pass to claim his inheritance, but finds not only is there no inheritance but there are a lot of angry creditors waiting to be paid. Pretending to be rich, Junior tries to woo the local saloon singer Mike (Jane Russell) and she tries to woo him in return, thinking that Junior is rolling in dough. What Junior doesn't know is that Mike is also the nefarious outlaw 'The Torch.' And what they both don't know is that The Torch is being tracked by Roy Barton (Roy Rogers), a federal agent posing as a singing cowboy. (Roy is in love with his horse Trigger, pointing out straight-faced that he prefers horses over women and that Trigger is 'a one man horse.')\n\nThe great thing about Son of Paleface is that Tashlin knows when to quit. The film is hilarious because everything in the film isn't played as a farce. The B-western plot about Rogers tracking down The Torch is played straight and probably could have passed as an actual Roy Rogers second feature. But then Hope enters and busts everything up.\n\nSon of Paleface is a film that marks the end of the great Hope classic comedies. Pushing 50 at the time, Hope plyaing a Harvard undergraduate is so absurd it's hysterical. Son of Paleface was also Hope's pinnacle before his steep decline into films like Paris Holiday and Boy, Did I Get a Wrong Number. But here, Hope is at the height of his powers as both comic actor (his sly camera looks are a scream) and as a rapid-fire one-liner quipster.\n\nNot only is Hope working on all cylinders, but so is Tashlin. As a former cartoon director at Warner Brothers, the cartoon jokes abound, most prominently with a gag involving Hope guzzling down the Paleface Special in the saloon -- his Harvard letter on his shirt curls up, his pipe stretches out and spits sparks, and Hope's head disappears into his torso, smoke billowing from his neck hole. Tashlin's 'grace and elegance' in shot composition is also in evidence (when one of the doors to the Dirty Shame Saloon open up, the remaining door spells 'Dirty Sal,' and in another shot Junior is strategically framed looking up at a statue of his Daddy from the rear between the statue's legs). Cecil B. De Mille even interrupts Hope's bath to snap a picture.\n\nIt is only in the climactic Indian attack that Tashlin's world begins to consume the B-western plot. Hope in a runaway car holds up a rope from a rear axle to keep the car level as Rogers on Trigger gallops to retrieve a tire. Hope yells out, 'Hurry up. This is impossible!' And most stupefyingly, when the car shoots off a ledge into a gorge and plummets downward Russell screams, 'Alright, alright. I'll marry you!' Hope then opens an umbrella and the car rises to land on the other side of the gorge.\n\nThe most disturbing sequence of the film is when Hope shares a bed with Trigger and they fight over the covers. The next morning, Hope tells Russell, 'I'd hate to tell you who I slept with last night. Those cold hooves on my back.' Magna c*m laude!\n\nSpecifications:\nFormat                           : Matroska\nFile size                        : 4.08 GiB\nDuration                         : 1h 34mn\nOverall bit rate                 : 6 147 Kbps\n\nVideo\nFormat                           : AVC\nFormat profile                   : &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;367e5f515e767a021807&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\nFormat settings, CABAC           : Yes\nFormat settings, ReFrames        : 4 frames\nDuration                         : 1h 34mn\nBit rate                         : 5 703 Kbps\nWidth                            : 960 pixels\nHeight                           : 720 pixels\nDisplay aspect ratio             : 4/3\nFrame rate                       : 23.976 fps\nBits/(Pixel*Frame)               : 0.344\nWriting library                  : x264 core 98 r1649 c54c47d\n\nAudio\nFormat                           : AC-3\nDuration                         : 1h 34mn\nBit rate mode                    : Constant\nBit rate                         : 192 Kbps\nSampling rate                    : 48.0 KHz\n\nScreenshots\n[URL=http://www.imagebam.com/image/81d613105681661][IMG]http://thumbnails9.imagebam.com/10569/81d613105681661.jpg[/IMG][/URL] [URL=http://www.imagebam.com/image/6b1715105681665][IMG]http://thumbnails35.imagebam.com/10569/6b1715105681665.jpg[/IMG][/URL] [URL=http://www.imagebam.com/image/dfa1c8105681666][IMG]http://thumbnails7.imagebam.com/10569/dfa1c8105681666.jpg[/IMG][/URL][URL=http://www.imagebam.com/image/f9dc0c105681668][IMG]http://thumbnails26.imagebam.com/10569/f9dc0c105681668.jpg[/IMG][/URL] [URL=http://www.imagebam.com/image/b7074f105681671][IMG]http://thumbnails37.imagebam.com/10569/b7074f105681671.jpg[/IMG][/URL] [URL=http://www.imagebam.com/image/90e94d105681673][IMG]http://thumbnails28.imagebam.com/10569/90e94d105681673.jpg[/IMG][/URL] ","torrent":{"xt":"urn:btih:e2561f12d4106cac585a377099dc129414dabfa3","amp;dn":"Son.of.Paleface.1952.720p.HDDVD.x264-Codres","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e2561f12d4106cac585a377099dc129414dabfa3","infoHashBuffer":{"type":"Buffer","data":[226,86,31,18,212,16,108,172,88,90,55,112,153,220,18,148,20,218,191,163]},"announce":[],"urlList":[]}}