{"title":"Djembefola (1991) [RMVB] [FR EN] [African Music]","uid":4898800,"size":222267188,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e2d1f11dfc1e37d528e1e535825a86b3d8454f62&amp;dn=Djembefola+%281991%29+%5BRMVB%5D+%5BFR+EN%5D+%5BAfrican+Music%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"djembe123","files":-1,"time":1242498657,"description":"Type: documentary/music\nLanguage: audio FR with EN subtitles\nYear: 1991\n\nResolution : 352x336\nCodec : RMVB\nFPS : 25,0\nAudio: unknown/rm\nTime: 1:04:48\nFile size: 211 MB\n\nIn French, English and African dialects, with English subtitles. Produced, directed and photographed by Laurent Chevalier.\n\nA story that is heard more than once in Laurent Chevalier's &quot;Djembefola&quot;, a documentary portrait of the African master drummer Mamady Keita, tells of how as a baby he cried so much that his father took him to a witch doctor. After predicting a great future in which the baby would grow up to overshadow everybody else in the village, the doctor washed the infant's hands in a rare herbal potion.\n\nMamady Keita became a prodigy who at 14 was one of five percussionists selected for membership in the National Djoliba Ballet. His instrument, the djembe, is a large drum that is made of goat's hide tautly stretched over yoroko wood and is beaten with the hands. Depending on which part of the instrument is touched, it yields three distinctive tones. Even now he marvels at how, after hours of playing, his hands never become stiff or blistered.\n\nThe straightforward, smoothly edited film follows Mamady from Brussels on a pilgrimage to his native village of Balandugu, Guinea. After flying from Brussels to Conakry, Guinea's capital, Mamady Keita and the film crew make the rest of the trip by jeep to the remote village. There, he has a tear-filled reunion with friends and relatives who had assumed he was dead.\n\n&quot;Djembefola&quot; accomplishes a lot in its 65 minutes. In addition to sketching a vivid portrait of its subject, it clearly describes the basic qualities of the djembe. The film's several extended musical sequences suggest how the instrument's beats and tones become a complex emotional language that serves as a kind of communal heartbeat for the people of Balandugu.\n","torrent":{"xt":"urn:btih:e2d1f11dfc1e37d528e1e535825a86b3d8454f62","amp;dn":"Djembefola+%281991%29+%5BRMVB%5D+%5BFR+EN%5D+%5BAfrican+Music%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e2d1f11dfc1e37d528e1e535825a86b3d8454f62","infoHashBuffer":{"type":"Buffer","data":[226,209,241,29,252,30,55,213,40,225,229,53,130,90,134,179,216,69,79,98]},"announce":[],"urlList":[]}}