{"title":"Soft Matter Physics prabhu_","uid":10493163,"size":3385318,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e2e4bc262e2a01c89a4511a9e40dd1785a5c51ad&amp;dn=Soft+Matter+Physics+prabhu_&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"prabhu_","files":2,"time":1404574257,"description":"Soft Matter Physics\n\nby Masao Doi\n &lt;a href=&quot;\nhttp://www.kt.dtu.dk/~/media/Institutter/Kemiteknik/Nyheder/2014/01/Doi_samlet.ashx&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.kt.dtu.dk/~/media/Institutter/Kemiteknik/Nyheder/2014/01/Doi_samlet.ashx&lt;/a&gt;\n\n\nabout book :-\n\n\nFirst coherent graduate text on soft matter physics\nUnique features of soft matter are discussed starting from general principles of physics: what are their characteristics, and where do they come from\nPhenomena we see in everyday life are discussed: examples are blowing of a rubber balloon, dewetting of liquid droplets, squeezing of gels, and unusual flow of polymer solutions\nSimple and clear style of presentation, while mathematical rigour is maintained\nContains problem sets at chapter ends to stimulate students' intellectual challenges\nSolutions manual available to lecturers\n\nSoft matter (polymers, colloids, surfactants and liquid crystals) are an important class of materials in modern technology. They also form the basis of many future technologies, for example in medical and environmental applications. Soft matter shows complex behaviour between fluids and solids, and used to be a synonym of complex materials. Due to the developments of the past two decades, soft condensed matter can now be discussed on the same sound physical basis as solid condensed matter. The purpose of this book is to provide an overview of soft matter for undergraduate and graduate students in physics and materials science. \n\nThe book provides an introduction to soft matter (what it is, and what are the characteristics of such materials), and also provides the reader with the physical basis for understanding and discussing such characteristics in more detail. Many basic concepts, which are required in advanced courses of condensed matter physics, such as coarse graining, scaling, phase separation, order-disorder transition, Brownian motion, and fluctuation-dissipation theorem, are explained in detail with various forms of soft matter used as examples.\nReadership: Undergraduate and graduate students in physics. Graduate students in material science and chemical engineering\n\n &lt;a href=&quot;\nhttp://www.kt.dtu.dk/~/media/Institutter/Kemiteknik/Nyheder/2014/01/Doi_samlet.ashx&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.kt.dtu.dk/~/media/Institutter/Kemiteknik/Nyheder/2014/01/Doi_samlet.ashx&lt;/a&gt;\n\n\nabout author :-\n\nMasao Doi, Department of Applied Physics, University of Tokyo\n\nMasao Doi graduated from the Department of Applied Physics of University of Tokyo in 1970. In 1976 he received his Doctoral Degree in Engineering at the University of Tokyo and began his academic career as an Assistant Professor of Physics at the Tokyo Metropolitan University. He moved to Nagoya University in 1989 and to Tokyo University in 2004. He retired from Tokyo University in 2012, and is now working as a fellow of Toyota Physical and Chemical Research Institute. His early research was concerned with the dynamics and rheology of flexible polymers, especially with developing a theoretical description of the role of molecular entanglements for determining the transport properties to flexible polymer solutions and melts. He then worked on various aspects of the rheological properties of soft matter, polymers, liquid crystals, colloidal suspensions and gels. His current research is focused on the surface phenomena of polymers, such as adhesion, friction, and drying.\n\n\n\n   `~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~`\n  SEED PLEASE , LET OTHERS GET IT TOO. \n `~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~`\t\n","torrent":{"xt":"urn:btih:e2e4bc262e2a01c89a4511a9e40dd1785a5c51ad","amp;dn":"Soft+Matter+Physics+prabhu_","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e2e4bc262e2a01c89a4511a9e40dd1785a5c51ad","infoHashBuffer":{"type":"Buffer","data":[226,228,188,38,46,42,1,200,154,69,17,169,228,13,209,120,90,92,81,173]},"announce":[],"urlList":[]}}