{"title":"The Enid - Invicta (2012) [HD Tracks] 24.96","uid":10573033,"size":895787875,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e3010c7aab97e8d91cf000cc6b229942f561896c&amp;dn=The+Enid+-+Invicta+%282012%29+%5BHD+Tracks%5D+24.96&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":4,"uploader":"politux","files":-1,"time":1405606002,"description":"\n  The Enid - Invicta (2012) [HD Tracks] 24.96\n\n  Genre: Rock\n  Style: Symphonic Progressive\n  Source: 2012 Operation Seraphim HD Tracks\n  Codec: FLAC\n  Bit Rate: ~ 2,500 kbps\n  Bit Depth: 24\n  Sample Rate: 96 kHz\n\n  01+02 Anthropy - One &amp; the Many\n  03+04 Who Created Me? - Execution Mob\n  05 Witch Hunt\n  06 Heaven's Gate\n  07 Leviticus\n  08 Villian of Science\n  09 The Whispering \n\n  Release Info\n\n  &quot;A digital FLAC format release with a higher dynamic range than the CD/MP3 versions. The tracks have been remixed with more exciting dynamics, no dynamic compression has been used and true 24bit 96kHz audio format has been retained during mixing and mastering process...Tracks 1+2 and 3+4 segue and are included as 1 file each to match the way the CD plays back - which we felt was quite important. The rest of the album is single tracks.&quot;\n\n  Artist Bio   \n\n  British group the Enid were formed in 1974. The founder of the band was Robert John Godfrey (Barclay James Harvest). In forming the group he was joined by Stephen Stewart and Francis Lickerish. They released their first album in 1976. Coming at the heart of the punk rock era, the jazz/progressive rock-ish release (In the Region of the Summer Stars) certainly did not fit into that genre. Two years later the group followed that release with Aerie Faerie Nonsense. In 1979 they released Touch Me and Six Pieces came out the following year. The group, for all intents and purposes, broke up for a time after that album. However, they wound up continuing on as a two-piece, recording Something Wicked This Way Comes in 1983. That same year saw the release of a two-disc live set, Live at Hammersmith. In 1985 the group released The Spell and the following year saw the release of Salome. In 1988 the Enid performed a farewell gig and called it a day. The show was later released as Final Noise. However, the end was not permanent as the band reformed in 1995. Since then they have released two new albums, Tripping the Light Fantastic and Sundialer.","torrent":{"xt":"urn:btih:e3010c7aab97e8d91cf000cc6b229942f561896c","amp;dn":"The+Enid+-+Invicta+%282012%29+%5BHD+Tracks%5D+24.96","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e3010c7aab97e8d91cf000cc6b229942f561896c","infoHashBuffer":{"type":"Buffer","data":[227,1,12,122,171,151,232,217,28,240,0,204,107,34,153,66,245,97,137,108]},"announce":[],"urlList":[]}}