{"title":"UFO Files Ingenieria extraterrestre.(Docu.Spanish).","uid":5586922,"size":441501842,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:e3e2cacc647767a63ea233a40f99b866a8bc95a7&amp;dn=UFO+Files+Ingenieria+extraterrestre.%28Docu.Spanish%29.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"cholo24","files":2,"time":1274727056,"description":"UFO Files. IngenierÃƒÂ­a extraterrestre\n\nPrepÃƒÂ¡rense para un ejercicio de imaginaciÃƒÂ³n. Supongamos que una nave extraterrestre chocÃƒÂ³ en el desierto y que los humanos la recuperaron. Ã‚Â¿QuÃƒÂ© podrÃƒÂ­amos aprender de sus ingenieros? Con los datos deducidos de aÃƒÂ±os de avistamientos de OVNIS, recrearemos una tÃƒÂ­pica nave utilizando la mÃƒÂ¡s avanzada animaciÃƒÂ³n. Descubriremos por quÃƒÂ© los extraterrestres eligieron las formas de sus naves, conoceremos cÃƒÂ³mo superaron los efectos de la atmÃƒÂ³sfera terrestre, desafiaron a la gravedad, anularon la inercia y viajaron Ã‚Â¡mÃƒÂ¡s rÃƒÂ¡pido que la luz! Nuestros expertos en ingenierÃƒÂ­a inversa nos mostrarÃƒÂ¡n lo que hay dentro de una nave extra-terrestre. Exploraremos la tecnologÃƒÂ­a que hace posible las visitas procedentes de otros mundos, el dispositivo para &quot;encoger distancias&quot; o el agujero de gusano que permite a las naves viajar por el espacio en cuestiÃƒÂ³n de minutos; asÃƒÂ­ como las funciones del recubrimiento semi-transparente de la nave. A primera vista, este tipo de tecnologÃƒÂ­a parece una locura, pero segÃƒÂºn nuestros expertos, nada estÃƒÂ¡ mÃƒÂ¡s allÃƒÂ¡ de la esfera de la posibilidad.\n\nSi una nave espacial extraterrestre aterrizara en la Tierra, lo primero que querrÃƒÂ­amos hacer serÃƒÂ­a desmontarla y descubrir cÃƒÂ³mo funciona. A lo mejor, hacer un tour por el interior de la nave y conocer los aparatos de los que dispone: como un reactor anti-materia, armas lÃƒÂ¡ser, e incluso un tele-transportador. Sorprendentemente, muchos de estos aparatos de &quot;ciencia ficciÃƒÂ³n&quot; estÃƒÂ¡n basados en la ciencia real. AdemÃƒÂ¡s, muchos de ellos tienen homÃƒÂ³logos desarrollados por el hombre aquÃƒÂ­ en la Tierra. Entre nuestras armas prototipo podemos encontrar armas lÃƒÂ¡ser de gran potencia. Incluso hemos investigado formas de esconder vehÃƒÂ­culos detrÃƒÂ¡s de &quot;capas invisibles&quot; generadas por plasma. La mÃƒÂ¡s avanzada animaciÃƒÂ³n y recreaciones nos ayudarÃƒÂ¡n a &quot;imaginar&quot; una nave extra-terrestre y aprender cÃƒÂ³mo muchos aparatos y mecanismos asombrosos son posibles en realidad y es probable que estÃƒÂ©n disponibles en unos pocos aÃƒÂ±os.\n","torrent":{"xt":"urn:btih:e3e2cacc647767a63ea233a40f99b866a8bc95a7","amp;dn":"UFO+Files+Ingenieria+extraterrestre.%28Docu.Spanish%29.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e3e2cacc647767a63ea233a40f99b866a8bc95a7","infoHashBuffer":{"type":"Buffer","data":[227,226,202,204,100,119,103,166,62,162,51,164,15,153,184,102,168,188,149,167]},"announce":[],"urlList":[]}}