{"title":"Coffin Hill 01-04 (2013) (1440+2048px-HD) (TaruTariat-Novus) [NV","uid":9594346,"size":383866852,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:e4b83f635109c2cbd1bf977fc7fab8ca9250deed&amp;dn=Coffin+Hill+01-04+%282013%29+%281440%2B2048px-HD%29+%28TaruTariat-Novus%29+%5BNV&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"RubrumPopulus","files":-1,"time":1391976806,"description":"\n\nThis torrent includes both 1440px and 2048px-HD versions.\n*Note: You can download both or only choose which version you'd prefer by deselecting the one you don't want when you add the torrent to your client software.  If you're adding the torrent via magnet link, you can deselect any undesired file in the list of files once the torrent has begun downloading.\n========================================================\n\n \nCOFFIN HILL stars Eve Coffin, a rebellious, teenage lowlife from a high-society family with a curse that goes back to the Salem Witch trials. Following a night of sex, drugs and witchcraft in the woods, Eve wakes up naked, covered in blood and unable to remember how she got there. One friend is missing, one is in a mental ward-and one knows that Eve is responsible. After a stint as a Boston cop that ends in a bullet wound and unintended celebrity, Eve returns to Coffin Hill, only to discover the darkness that she unleashed ten years ago in the woods was never contained. It continues to seep through the town, cursing the soul of this sleepy Massachusetts hollow, spilling secrets and enacting its revenge. Set against the haunted backdrop of New England, COFFIN HILL explores what people will do for power and retribution. Noted novelist Caitlin Kittredge, author of the Black London series, brings a smart, mesmerizing style to comics. Artist Inaki Miranda (FABLES) brings his dynamic storytelling to COFFIN HILL, following an acclaimed run on FAIREST.\n\n\nThanks goes to Tarutaru and theProletariat for this release.\n\n\n","torrent":{"xt":"urn:btih:e4b83f635109c2cbd1bf977fc7fab8ca9250deed","amp;dn":"Coffin+Hill+01-04+%282013%29+%281440%2B2048px-HD%29+%28TaruTariat-Novus%29+%5BNV","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e4b83f635109c2cbd1bf977fc7fab8ca9250deed","infoHashBuffer":{"type":"Buffer","data":[228,184,63,99,81,9,194,203,209,191,151,127,199,250,184,202,146,80,222,237]},"announce":[],"urlList":[]}}