{"title":"Bangkok Love Story (Eng sub) [Thai Movie]","uid":4006123,"size":724830513,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e4d950c0e7f81d3592e4b6256df6492e217ed7e5&amp;dn=Bangkok+Love+Story+%28Eng+sub%29+%5BThai+Movie%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"poothaijaa","files":2,"time":1201832488,"description":"&quot;Special Thank To Uploader&quot; (not me)\n\n&quot;Please check out at official website before download&quot;\n\nDetail: Drama / Gay Action\nTitle: Bangkok Love Story\nYear : 2007\nStarring : Rattaballung Toesawat, Chaiwat Tongsang, Weeradit Srimalai, Chatcha Rujinanon\nDirector : Poj Anon\nSound : Thai\nSubtitle: English\nRelease date : 22 November 2007\nRating: NC-17\n\nOfficial Website:\n\nIMDB: http://www.imdb.com/title/tt1135961/\n\nInfo: http://en.wikipedia.org/wiki/Bangkok_Love_Story\n\nAward winning: the Grand Award in all Categories at\n\nBrussels International Independent Film Festival\n\nPlot:\n\nA loner gunman named Mhek is assigned to kidnap a police informant named It, but Mhek has a change of heart when he is ordered to kill It. In a gunbattle with his employers, Mhek is wounded, but It grabs Mhek&amp;#039;s gun and returns fire. The two men then escape on Mhek&amp;#039;s motorcycle. At Mhek&amp;#039;s rooftop hide-out, It tends to Mhek&amp;#039;s wound and finds himself attracted to Mhek. While giving Mhek a bath one day, It initiates sexual intercourse with the hitman. Conflicted, Mhek demands that It leave him alone. It returns home to his fiancee, Sai, but is no longer interested in continuing a relationship with her. It spends his days pining over Mhek, and tracks down Mhek&amp;#039;s brother, Mhok, and their mother. Mhok is HIV positive, as the result of sexual abuse by his and Mhek&amp;#039;s stepfather, and their mother is dying of AIDS.\n\nMhek&amp;#039;s dream is to take his mother and brother away from Bangkok to the mountains of Mae Hong Son Province. But after Mhek&amp;#039;s mother witnesses Mhek and It kissing each other, she commits suicide by hanging herself. It&amp;#039;s fiancee, Sai, also witnesses the kissing by Mhek and It, and terminates their marriage plans. Meanwhile, Mhek&amp;#039;s former employers are gunning for him. It decides to take matters into his own hands, and goes to Mhek&amp;#039;s bosses&amp;#039; hide-out and shoots them both. Mhek, meanwhile, is planning to meet his brother at the railway station to leave Bangkok for good. But before he can board the train, he is apprehended by the police and sent to prison.\n\nYears pass by. Mhok dies of AIDS at a hospice in northern Thailand. It visits Mhek in prison and reveals that he was left blind in the final gunbattle with Mhek&amp;#039;s bosses. Eventually, Mhek is released from prison, and It meets him. But before the two men can leave to start their life together, Mhek is gunned down by an assassin. It eventually gets his sight back, and the first thing he does is to look at his mobile phone, which has a picture of Mhek on it that he took many years before.","torrent":{"xt":"urn:btih:e4d950c0e7f81d3592e4b6256df6492e217ed7e5","amp;dn":"Bangkok+Love+Story+%28Eng+sub%29+%5BThai+Movie%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e4d950c0e7f81d3592e4b6256df6492e217ed7e5","infoHashBuffer":{"type":"Buffer","data":[228,217,80,192,231,248,29,53,146,228,182,37,109,246,73,46,33,126,215,229]},"announce":[],"urlList":[]}}