{"title":"sokoban.zip","uid":3589864,"size":18394,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:e518e147bf60304b4678197e0f1b1548ac592f65&amp;dn=sokoban.zip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"trialanderror","files":1,"time":1167953593,"description":"Sokoban (???, Japanese for &quot;warehouse keeper&quot;) is a transport puzzle in which the player pushes boxes around a maze, viewed from above, and tries to put them in designated locations. Only one box may be pushed at a time, not two, and boxes cannot be pulled. As the puzzle would be extremely difficult to create physically, it is usually implemented as a video game.\n\nSokoban was created in 1980 by Hiroyuki Imabayashi, and was published in 1982 by Thinking Rabbit, a software house based in Takarazuka, Japan. Thinking Rabbit also released three sequels: Boxxle, Sokoban Perfect and Sokoban Revenge.\n\nImplementations of Sokoban have been written for numerous computer platforms, including almost all home computer and personal computer systems. Versions also exist for several hand held and video game consoles, including mobile phones. Many other puzzle games, such as Chip&amp;#039;s Challenge and Rocks and Diamonds, implement Sokoban-based gameplay. The roguelike computer game NetHack contains a sequence of dungeon levels deliberately designed to simulate a Sokoban game. (wikipedia)\n\n\n---\n\nThis version:\n\nSokoban\nVersion 2.2.5 (for Microsoft Windows)\n\n(c) 1992\nAllan B. Liss\n\nAll rights reserved. Permission is granted to freely distribute this program\n\n\n---\n\nfiles:\npacked: \t\tsokoban.zip\t18.274 bytes\nfiles in archive:\tsokoban.exe\t45.056 bytes\n\nnotes:\nGame contains the 50 original levels from 1982. The increasing difficulty and the fact, that levels must be solved in given order (progress can be saved) make it a real challenge. Help file seems to be missing, but the game should be to a great part self-explaining. Use the keyboard arrows for control. The yellow boxes should be pushed to the black spots. A level is solved when all black spots are covered by boxes. Despite its small filesize, this is not scam, but a fully functional logic game with hours of hard thinking (of fun, if you prefer).","torrent":{"xt":"urn:btih:e518e147bf60304b4678197e0f1b1548ac592f65","amp;dn":"sokoban.zip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e518e147bf60304b4678197e0f1b1548ac592f65","infoHashBuffer":{"type":"Buffer","data":[229,24,225,71,191,96,48,75,70,120,25,126,15,27,21,72,172,89,47,101]},"announce":[],"urlList":[]}}