{"title":"The Magic Kingdom of Landover Series  -  Terry Brooks","uid":6761709,"size":5731786480,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:e535f07d4c7af14a3676d91fa4e0b7d1d4ae9c7d&amp;dn=The+Magic+Kingdom+of+Landover+Series++-++Terry+Brooks&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"neil1966hardy","files":259,"time":1319229537,"description":"-------------Magic Kingdom of Landover Audio Collection-------------\nThe Magic Kingdom of Landover books by Terry Brooks have been among my favorites for a few years now. Three versions of the series have been released on audio book. One of these, however, is abridged and many of the versions online, even those which claim to be unabridged, are actually the abridged versions. I detest abridgments, so I have painstakingly collected the two unabridged series. I have processed all these recordings in the following ways:\n\n1. Most of these were ripped BY ME. All my rips are from high quality CDs.\n\n2. FULLY CHAPTERIZED. This took weeks. Each audio book was compiled into a single file (deleting bits like &quot;Disc 2, please insert Disc 3&quot;) and then separated into Parts and Chapters as defined by the original books. I find this to be the best way to enjoy audiobooks and it is perfect for iPods.\n\n3. Encoded all books to a uniform MP3 96kbps 44.1kHz.\n\n4. ID3 Tagged. All audiobook files have been fully ID3 tagged including full COVER ART.\n\nThis torrent represents a 100% complete collection of all the unabridged versions of the Magic Kingdom of Landover that exist. Both readers are quite good and both sets of recordings are of high quality. I think I slightly prefer the Dick Hill versions, but the Beierle versions are excellent as well. I highly recommend getting both versions so you may decide for yourself.\n\nPlease leave any comments, questions, or suggestions you might have as they are HIGHLY APPRECIATED! :)\n\nEnjoy!\n--CL8\n\n\n-------------Included in this torrent-------------\n1986 - Magic Kingdom For Sale -- SOLD! (read by Cameron Beierle)\n1986 - Magic Kingdom For Sale -- SOLD! (read by Dick Hill)\n1987 - The Black Unicorn (read by Cameron Beierle)\n1987 - The Black Unicorn (read by Dick Hill)\n1988 - Wizard at Large (read by Cameron Beierle)\n1988 - Wizard at Large (read by Dick Hill)\n1994 - The Tangle Box (read by Cameron Beierle)\n1994 - The Tangle Box (read by Dick Hill)\n1995 - Witches' Brew (read by Cameron Beierle)\n1995 - Witches' Brew (read by Dick Hill)\n2009 - A Princess of Landover (read by Dick Hill)\n\nplus a full set of Landover eBooks\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:e535f07d4c7af14a3676d91fa4e0b7d1d4ae9c7d","amp;dn":"The+Magic+Kingdom+of+Landover+Series++-++Terry+Brooks","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e535f07d4c7af14a3676d91fa4e0b7d1d4ae9c7d","infoHashBuffer":{"type":"Buffer","data":[229,53,240,125,76,122,241,74,54,118,217,31,164,224,183,209,212,174,156,125]},"announce":[],"urlList":[]}}