{"title":"PAUL PARKER - THE COLLECTION  - HI-NRG  (2CDs) ","uid":6602735,"size":327730821,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e60228609fd68d272ba805d3eaebf832ccff4700&amp;dn=PAUL+PARKER+-+THE+COLLECTION++-+HI-NRG++%282CDs%29+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"freaktorrent07","files":33,"time":1313274964,"description":"\n\n\n\nPaul Parker was born in San Francisco and his first brush with fame outside of that city was when he hooked up with legendary producer Patrick Cowley. \\&quot;Right On Target\\&quot; (the first release on Cowley\\'s label Megatone) reached No. 1 on Billboards Magazine\\'s Dance Chart in 1982. Their initial recording work together was with The Patrick Cowley Singers (Jo-Lo) on \\&quot;Lift Off\\&quot; for Cowley\\'s 1981 \\&quot;Megatron Man\\&quot; album. Cowley, like a modern day Phil Spector, realized the potential of all three singers and began work on a solo project for Parker and eventually Jo Carol Block and Lauren Carter.\nIn early 1983 Megatone Records released the second Paul Parker 12\\&quot; single \\&quot;Shot In The Night.\\&quot; The dark, moody, uptempo number was an instant hit and led the way for his April 1983 album \\&quot;Too Much To Dream.\\&quot; By the time of the album release Patrick Cowley had succumbed to A.I.D.S. and had Parker not been so talented his career might have ended there.\nPrior to his demise Cowley had canned quite a bit of material, perhaps sensing his impending fate, he recorded the entire Parker album, tracks with Loverde, Sarah Dash, Jo-Lo, more material with Sylvester and a complete album of his own. On Patrick\\'s last album Parker sings the lead track of \\&quot;Tech-No-Logical World\\&quot; with masculine fervor as well as contributing his voice to several other of the albums tracks. One forgets that Paul and Patrick had literally changed the landscape of club music in the early 1980\\'s. In the black-hole of 1980-1982 club records were either top 40 or R&amp;B based. But with the team of Cowley and Parker they brought the \\&quot;hi-energy\\&quot; sound into the mainstream and onto the dance floors. Parker, with his dashing good looks and gay-teen idol appeal transcended that to become an important recording artist of the 1980\\'s club scene. In September 1983 while touring in the U.K. Paul was introduced to Ian Anthony Stephens. Stephens was one of dance music\\'s most exciting producers, having just come off of a major hit with Hazell Dean\\'s \\&quot;Searching.\\&quot; This encounter led to Ian travelling to San Francisco to work on a number of recording projects. Most notably Paul\\'s follow up 12\\&quot; singles and work with Lisa and Marianna.\nThe first 12\\&quot; of this new musical reunion was the ultra high energy \\&quot;Desire.\\&quot; Once again Paul\\'s macho vocals and full throated phrasing took dance music to a new level. The song had to compete with an import 12\\&quot; single of \\&quot;Love\\'s On The Line\\&quot; from his Cowley produced album, but both found their way to the top of most club charts. 1986, his affiliation with Megatone over in 1983 with Cowley\\'s passing, found him searching for a new domestic label. Appearing on several club dates with Pamala Stanley led to a friendship and mutual desire to record together. Pamala had already signed a deal with TSR Records and his next release would be two duets with her on that label. \\&quot;Stranger In A Strange Land\\&quot; and \\&quot;Running In Circles\\&quot; were both excellent songs and showed a great deal of promise for their teaming. However the songs couldn\\'t match either of their solo successes.\nHis next release was \\&quot;Don\\'t Play With Fire\\&quot; on the Fantasia label. Since subsequent releases for Lisa, Parker, and Marianna were also on that label leads one to the speculation that either Stephens or Parker or both had ownership or controlling interests in the label. His next release was a highly-taunted cover of the Cyndi Lauper classic \\&quot;Time After Time.\\&quot; This formed a basis for his later recording of cover versions. The 1986 release was a bold move for Parker who had heretofore not been known as a remake artist. His next American release was a collaboration with Man Parrish on 1987\\'s \\&quot;One Look\\&quot; for Dice Records, the results were less than stunning. Parker struck gold again with a remake of Giorgio Moroders \\&quot;From Here To Eternity\\&quot; but outside of the club scene he wasn\\'t having much luck charting. So Parker\\'s next release was the 1993 cover of Chris Isaac\\'s \\&quot;Wicked Game.\\&quot; Another song one would have never pictured as a disco hit.\n\\&quot;Wicked Game\\&quot; was released on the fabulous ZYX Record label where Parker made his home for the next several releases. He followed that with \\&quot;With Or Without You\\&quot; the title track from his second album release. And then he rebounded with yet another remake, a 1995 cover of the Doors classic \\&quot;Riders On The Storm.\\&quot; Both 12\\&quot; singles were nice-sized hits here in the U.S. but even more popular abroad.\nHis success abroad led to his signing with the U.K. label Klone Records. His string of hits for Klone Records included: \\&quot;Can U Feel Love Coming,\\&quot; \\&quot;I Finally Found Someone\\&quot; and \\&quot;One More Hurt.\\&quot; The last two selections were duets with Angie Gold and mark the last known recordings of Paul sometime around 1996-1998. Since then he seems to have disappeared from the musical landscape.\n\n\n\nCD 1\n\nArtist...............: Paul Parker\nAlbum................: The Collection Cd 1\nGenre................: Hi-Nrg\nSource...............: CD\nYear.................: 1992\nRipper...............: EAC\nCodec................: LAME 3.97\nVersion..............: MPEG 1 Layer III\nQuality..............: Extreme, (avg. bitrate: 258kbps)\nChannels.............: Stereo / 44100 hz\nTags.................: ID3 v1.1, ID3 v2.3\n\nTracklist\n\n1. (00:06:19) Paul Parker - Right On Target\n2. (00:06:12) Paul Parker - Love\\'s On The Line\n3. (00:06:06) Paul Parker - Shot In The Night\n4. (00:05:57) Paul Parker - Too Much To Dream\n5. (00:04:45) Paul Parker - Baby You Can Have My Lovin\\' Any Time\n6. (00:04:20) Paul Parker - Travelin\\' Man\n7. (00:05:39) Paul Parker - Nighthawk\n8. (00:07:25) Paul Parker - Tech-No-Logical World\n9. (00:08:43) Paul Parker - Desire (Remix)\n10. (00:06:24) Paul Parker - Lift Off\n11. (00:03:49) Paul Parker - Right On Target (Single)\n\nPlaying Time.........: 01:05:39\n\n\nCD 2\n\nArtist...............: Paul Parker\nAlbum................: The Collection Cd2\nGenre................: Hi-Nrg\nSource...............: CD\nYear.................: 1992\nRipper...............: EAC\nCodec................: LAME 3.97\nVersion..............: MPEG 1 Layer III\nQuality..............: CBR 256, (avg. bitrate: 256kbps)\nChannels.............: Stereo / 44100 hz\nTags.................: ID3 v1.1, ID3 v2.3\n\nTracklist\n\n1. (00:08:37) Paul Parker - Desire\n2. (00:05:55) Paul Parker - Stranger In A Strange Land\n3. (00:05:52) Paul Parker - Running Around In Circles\n4. (00:06:14) Paul Parker - Body Talk\n5. (00:06:44) Paul Parker - Abracadabra\n6. (00:07:04) Paul Parker - From Here To Eternity\n7. (00:06:39) Paul Parker - Ready Or Not\n8. (00:10:01) Paul Parker - Don\\'t Play With Fire\n9. (00:06:08) Paul Parker - One Look Was Enough\n10. (00:06:42) Paul Parker - Time After Time\n\nPlaying Time.........: 01:09:56\nTotal Size...........: 127,75 MB\n\n\n\n\n","torrent":{"xt":"urn:btih:e60228609fd68d272ba805d3eaebf832ccff4700","amp;dn":"PAUL+PARKER+-+THE+COLLECTION++-+HI-NRG++%282CDs%29+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e60228609fd68d272ba805d3eaebf832ccff4700","infoHashBuffer":{"type":"Buffer","data":[230,2,40,96,159,214,141,39,43,168,5,211,234,235,248,50,204,255,71,0]},"announce":[],"urlList":[]}}