{"title":"Annet De Jong - 3 Boeken (E-Books)NLT-Release","uid":6979566,"size":1736227,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e6229f6583f98aee112e5f7c86a090905e774f11&amp;dn=Annet+De+Jong+-+3+Boeken+%28E-Books%29NLT-Release&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"linday1","files":-1,"time":1327355583,"description":"Annet De Jong - 3 Boeken (E-Books)NLT-Release\n\n\nOmschrijving:\nAnnet De Jong - 3 Boeken\n\nVuurkoraal:\n\nMerel Hoogstraten is glansrijk geslaagd voor haar eindexamen. De trotse ouders trakteren \nhaar en drie vriendinnen op een luxueuze vakantie naar het tropische eiland CuraÃƒÂ§ao. \nDe meiden volgen een duikcurcus en genieten met volle teugen van hun vrijheid. Totdat \nMerel van de ene op de andere dag verdwijnt. Dana Winter, journaliste bij het Nederlands-\ntalige dagblad Amigoe, volgt de vermissingszaak op de voet, maar raakt veel dieper bij de \naffaire betrokken dan haar lief is.\n\nVuurkoraal is een meeslepende literaire triller over een verraderlijke liefde en \nonverwacht bedrog. Annet de Jong voert haar lezers mee naar de Antillen en laat \novertuigend zien hoe een broeierige strandvakantie hun tot dan toe \nzorgeloze levens totaal kan ontwrichten.\n\nLevend bewijs:\n\nKort na zijn achttiende verjaardag doet Julius Visser een schokkende ontdekking: zijn vader en moeder blijken niet zijn biologische ouders te zijn. Omdat Julius van niemand bevredigende antwoorden krijgt, gaat hij op zoek naar zijn afkomst. Zijn speurtocht leidt naar een kliniek voor vruchtbaarheidsbehandelingen waar zich praktijken afspelen die het daglicht niet kunnen verdragen. Het brein achter de kliniek is de steenrijke Eduard Manshold, een gynaecoloog met een zeer goede reputatie. Manshold... \n\nDossier Tobias:\n\nAls het sprookjeshuwelijk tussen Isabel IJzerman en de Canadese Pool Nicolas Nowack Kozinski op de klippen loopt, wordt hun zoon Tobias het slachtoffer van een meedogenloze strijd tussen zijn ouders: Isabel gaat terug naar Nederland, maar Nicolas ontvoert het jongetje naar Polen en ontzegt het ieder contact met zijn moeder. De Nederlandse politie, gebonden aan het knellende Kinderontvoeringsverdrag, kan niets voor Isabel doen, omdat Nicolas samen met zijn ex-vrouw de voogdij over Tobias heeft. I... \n\n\nMet dank aan originele poster,scanner\n\n\nHashcode:\nE6229F6583F98AEE112E5F7C86A090905E774F11\n\n\nVOOR DE NIEUWSTE FILMS, MUZIEK EN BOEKEN GA JE NAAR NLT-RELEASE:\n &lt;a href=&quot;\nhttp://www.nlt-release.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.nlt-release.nl&lt;/a&gt;\n\n\nBy Linday","torrent":{"xt":"urn:btih:e6229f6583f98aee112e5f7c86a090905e774f11","amp;dn":"Annet+De+Jong+-+3+Boeken+%28E-Books%29NLT-Release","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e6229f6583f98aee112e5f7c86a090905e774f11","infoHashBuffer":{"type":"Buffer","data":[230,34,159,101,131,249,138,238,17,46,95,124,134,160,144,144,94,119,79,17]},"announce":[],"urlList":[]}}