{"title":"Rise of the Kasai [Ntsc], Ps2","uid":5407983,"size":2247961337,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:e68267e09ec6df5e1cfc391670cc9c20c63bdd90&amp;dn=Rise+of+the+Kasai+%5BNtsc%5D%2C+Ps2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Big_dude","files":-1,"time":1267660858,"description":"Rise of the Kasai for the Ps2                                      Rel. 04/05/2005\n\n\nFormat:        DVD5 NTSC-USA\nLang.:         English\nDiscs:         1\nImage:         ISO\nGenre.:        Beat-Em Up\nRating:        M (Mature)\nRequirements:  Modded/Chipped Ps2 or Swap Magic Disc Method. \n\n\nCompressed with 7Zip, Game was tested and works.\n\n\nNote: No Ps2 backup disc/game or copy will work unless your Ps2 Console is Modded \n      (allows playing of backups), or if you use Swap Magic.\n\n\nYou could try the homebrew exploit to (Free Mc Boot - Also known as soft modding for ps2), if your ps2 system isn't hard modded with a chip or if Swap Magic isn't working as a last resort. There are ps2 emulators but its not 100% &amp; the quality isn't as good as playing your game on your ps2 console.\n\nIf your using swap magic and don't have a flip top, you'll need to first\nremove the front cover of the disc tray for use of the slide card.\n\nHere's a link for how to remove the front cover...\n          &lt;a href=&quot;\nhttp://www.modchipstore.com/support/index.php?_m=knowledgebase&amp;_a=viewarticle&amp;kbarticleid=49&amp;nav=0,2&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.modchipstore.com/support/index.php?_m=knowledgebase&amp;_a=viewarticle&amp;kbarticleid=49&amp;nav=0,2&lt;/a&gt;\n\nAnd here's some links on using the slide tool to open the tray to swap in your ps2 copy or backup game.\n          &lt;a href=&quot;\nhttp://www.swapmagic3.com/slide-tool/Instructions.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.swapmagic3.com/slide-tool/Instructions.htm&lt;/a&gt;\n         &lt;a href=&quot;\nhttp://forums.afterdawn.com/thread_view.cfm/340944&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forums.afterdawn.com/thread_view.cfm/340944&lt;/a&gt;\n         &lt;a href=&quot;\nhttp://forums.afterdawn.com/thread_view.cfm/15105&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forums.afterdawn.com/thread_view.cfm/15105&lt;/a&gt;\n\nThose that don't have a modded Ps2 Here's a few links for Free MC Boot &amp; how to use it to soft mod your ps2 so you can be able to play burned games. Free Mc Boot won't work on newer models of ps2 you'll have to use an older version the tutorial explains this.\n\n-- &lt;a href=&quot; http://bootleg.sksapps.com/tutorials/fmcb/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://bootleg.sksapps.com/tutorials/fmcb/&lt;/a&gt;\n\nThen you will also need to patch the iso (the PS2 game) with ESR disc patcher GUI v0.24a if your using free mc boot with ESR Elf to boot your p2 copies or backups (No-swapping required for esr method).\n\nAfter patching burn the iso with Imgburn or Dvd Decrypter to respectable media\nthen use the ESR through fmcb after you installed everything to boot your game.\n\nYou will still need to use the proper media for the game to run or load properly regardless if your using fmcb, a modded ps2, or swap magic. Verbatim or Taiyo Yuden is preferred.\n\nNote: If fmcb isn't working and your Ps2 isn't Modded, Swap Magic should do the\ntrick.\n\n\nGame Description:\n\nRau, the hero of The Mark of Kri, has fallen in battle. Take control of Griz and Baumusu through the timeline of events ten years prior to discover what exactly happened to Rau. Then, take control of Rau and Tati to find out what happens in the decade that follows the events of The Mark of Kri.\n\nFeaturing a beat-'em-up style of gameplay, this action adventure differentiates itself by using a targeting system allowing the player to effectively fight oncomers from all directions. The addition of three new playable characters allows for an extension in play mechanics from the first title, opening the possibilities for different strategies depending on who the player chooses to use. Another addition is the partner system that has the AI control your partner as you traverse each stage.\n\nRise of the Kasai presents a new and innovative approach to fighting adventure games. With the unique collaborative combat system in two-player mode, gamers can strategize together, deciding how best to attack enemies in each situation and determine if using a stealth approach, deadly weapons, or a combination will garner the most carnage without being noticed.\n\nIn single-player, one character will be controlled by artificial intelligence and will naturally execute the best combat tactics, while the human player must study the fighting scenario to determine how to succeed, as both the computer and player work together to reach a common goal of defeating all enemies in their paths. The level can then be replayed as the opposite character, enabling players to experience all aspects of the game and perfect fighting techniques. Using the right analog stick, up to nine opponents in the player's immediate proximity range can be attacked by using the right analog stick to lock onto the targets and assign specific or multiple face buttons to erupt lethal combos.\n\n\nGame Pics Included.\n\n\nBurn with DVD Decrypter, (Included in download).  \n\nBurn at 8x or 4x Speed.\n\nUse Verbatim or Taiyo Yuden DVD Media for best quality, or if other media isn't \nworking.\n\n\nIf Using DVD+R booktype to DVD-ROM.\n(If your Mod-Chip or Ps2 doesn't support DVD+R)\n\n\nAny Problems or questions please post a comment.\n\n\nIf this is working fine for you let us know write a comment.\n\n\nPlease Seed this when your done.\n\n(I can't seed 24/7, do your part and seed to keep the torrent healthy).\n\n\n\nEnjoy!\t\t","torrent":{"xt":"urn:btih:e68267e09ec6df5e1cfc391670cc9c20c63bdd90","amp;dn":"Rise+of+the+Kasai+%5BNtsc%5D%2C+Ps2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e68267e09ec6df5e1cfc391670cc9c20c63bdd90","infoHashBuffer":{"type":"Buffer","data":[230,130,103,224,158,198,223,94,28,252,57,22,112,204,156,32,198,59,221,144]},"announce":[],"urlList":[]}}