{"title":"The Nitpicker's Guide for Classic Trekkers by Phil Farrand [PDF]","uid":10287598,"size":5742941,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e7a3b2d83a6da9957af21283885699d70f1db746&amp;dn=The+Nitpicker%27s+Guide+for+Classic+Trekkers+by+Phil+Farrand+%5BPDF%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"VikTSlick","files":-1,"time":1401810490,"description":"Title: The Nitpicker's Guide for Classic Trekkers\nAuthor: Phil Farrand \nCategory: Non-Fiction/Reference/Humor\nPublisher: Dell; First Edition edition (October 1, 1994)\nLanguage: English\nISBN-10: 0440506832\nISBN-13: 978-0440506836\n\nPromotional info/Publisher's summary - &quot;Six feature films, the wildly successful television spin-off Star Trek: The Next Generation, endless reruns, videotapes, conventions, a line of best-selling novels, and William Shatner's New York Times best-seller Star Trek Memories have kept the Star Trek spirit alive and well, even 25 years after its cancellation. Now this must-have book for all Trekkers -- which covers every episode of the original series, the pilot, and all six movies -- reveals all the bloopers, continuity errors, plot oversights, equipment malfunctions, and goof-ups that discerning, die-hard fans love to spot, but may have missed. Written especially for all those who find themselves thinking, &quot;Hey, if the transporter is broken, why don't they just use a shuttlecraft?&quot;, this nitpicky volume includes Kirk's toupee watch; an examination of the logic of the miniskirted female crew members; number of times Kirk violated the Prime Detective and lots of trivia questions, fun facts, quizzes, and more. Live long and nitpick.&quot;\n\nFrom Booklist Reviews:\n&quot;Farrand's companion to his Nitpicker's Guide for Next Generation Trekkers (1993) lists each episode of the original, Kirk-Spock-McCoy TV series, each of the trio's movies, and the pre-Kirk pilot TV show, &quot;The Cage,&quot; too. For each, Farrand first gives its &quot;star date&quot; (remember how the shows began: &quot;Captain's log, star date . . .&quot;), a plot summary, some of his own &quot;Ruminations&quot; on it, his choices of &quot;Great Moments&quot; in it, and two trivia questions. Then Farrand gets to the good stuff--the mistakes made in each program: production goofs, plot loopholes, continuity failures, and bits cut from a show when it was put in syndication. Concluding each entry are answers to the trivia questions; also concluding each TV episode entry is a tally of the stills shown underneath the show's closing list of production credits. As you can tell from the page count, this is no thrown-together exploitation opus. It's a thoroughgoing labor of love that ought to please Trekkers everywhere.&quot; - Ray Olson\n\nThis torrent contains the original PDF, which I tried converting in Calibre but without any success, really. It is not retail quality but highly readable. The front cover is also included. Thanks to my friend Itzy for finding this for me. Please seed, and enjoy!\n\nPlease visit and support my Suprbay release thread here, I would appreciate it:   &lt;a href=&quot;\nhttps://forum.suprbay.org/Thread-VikTSlick-s-Comics-Releases&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/Thread-VikTSlick-s-Comics-Releases&lt;/a&gt;","torrent":{"xt":"urn:btih:e7a3b2d83a6da9957af21283885699d70f1db746","amp;dn":"The+Nitpicker%27s+Guide+for+Classic+Trekkers+by+Phil+Farrand+%5BPDF%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e7a3b2d83a6da9957af21283885699d70f1db746","infoHashBuffer":{"type":"Buffer","data":[231,163,178,216,58,109,169,149,122,242,18,131,136,86,153,215,15,29,183,70]},"announce":[],"urlList":[]}}