{"title":"EnigmaT Set Rips { Cuts } - November 6th, 2013","uid":9154031,"size":1565202293,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e7eb7b1b2cd83a5d44ed87d836b22d9395ff3619&amp;dn=EnigmaT+Set+Rips+%7B+Cuts+%7D+-+November+6th%2C+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"EnigmaT","files":171,"time":1383743575,"description":"3LAU, Paris &amp; Simo feat. Bright Lights - Escape (Manse Remix) (Cut From Xabi Set)-enTc.mp3\nAbandoned Rainbow - Tornated (Martin Libsen Remix) (Cut From Summerville Set)-enTc.mp3\nAbove &amp; Beyond - Far From In Love (Above &amp; Beyond and Bob Bradley Chill Mix) (ABGT 051 Rip)-enTc.mp3\nAbove &amp; Beyond - Mariana Trench (ABGT 051 Rip)-enTc.mp3\nAdventure Club feat. Yuna - Gold (Cut From W&amp;W Set)-enTc.mp3\nAfrojack feat. Spree Wilson - The Spark (Tiesto Vs Too Loud Mix) (Cut From Emery Set)-enTc.mp3\nAggero - If I Could Ask (DJ Edit) (Cut From O'Neil Set)-enTc.mp3\nAgranda - Cinderella (Phoebus Remix) (Cut From Myon Set)-enTc.mp3\nAirscape - L'Esperanza (Peetu S Remix) (Cut From Ind Noise Set)-enTc.mp3\nAlan Morris - All About You (Cut From Tyas Set)-enTc.mp3\nAlex M.O.R.P.H. pres. Corti Organ - Magnum (Original Mix) (Cut From MORPH Set)-enTc.mp3\nAlexey Ryasnyansky - Paper Flower (Stephane Badey Remix) (Cut From Summerville Set)-enTc.mp3\nAly &amp; Fila and Susana - Without You (Mohamed Ragab Remix) (Cut From A&amp;F Set)-enTc.mp3\nAmir Hussain - Boundless (Original Mix) (Cut From Photographer Set)-enTc.mp3\nAndrew Bayer - Mirth Mobile (ABGT 051 Rip)-enTc.mp3\nAndrew StetS - Danapris (Cut From W&amp;W Set)-enTc.mp3\nAngel Esteban - Athena (Alan Cuevas Remix) (Cut From Tucandeo Set)-enTc.mp3\nAntoine Becks - Zombie Everywhere (Original Mix) (Cut From R3HAB Set)-enTc.mp3\nAraya &amp; Mark Dreamer - Pirates From Zoo (Original Mix) (Cut From Del Mar Set)-enTc.mp3\nAudiko - Exposure (Original Mix) (Cut From Anna Lee Set)-enTc.mp3\nAxwell feat. Tara McDonald - Feel The Vibe (Marcus Schossow 2013 Remode) (Cut From W&amp;W Set)-enTc.mp3\nBassjackers &amp; GRX - Gamer (Cut From Emery Set)-enTc.mp3\nBastille - Pompeii (Maor Levi &amp; Kevin Wild Bootleg Mix) (Cut From Levi Set)-enTc.mp3\nBeat Service feat. Ana Criado - Whispers (Somna &amp; Yang Remix) (Cut From Beat Service Set)-enTc.mp3\nBen Gold - Kinetic (Cut From W&amp;W Set)-enTc.mp3\nBilal El Aly &amp; Linnea Schossow - Penumbra (Tucandeo Remix) (Cut From Tucandeo Set)-enTc.mp3\nBlasterJaxx - Mystica -w- Chuckie - Who's Ready To Jump (Acappella) (Cut From W&amp;W Set)-enTc.mp3\nBlueye - 2013 (Original Mix) (Cut From Del Mar Set)-enTc.mp3\nBluEye - 2013 (We Are Still Alive) (Freelancer &amp; Perfect ct Vision Remix) (Cut From Saux Set)-enTc.mp3\nBorgore &amp; Schoolboy - Schooldays (Cut From W&amp;W Set)-enTc.mp3\nBowdidge &amp; Taylor - Flashback (Sam Jones &amp; Will Rees Remix) (Cut From Ind Noise Set)-enTc.mp3\nBraulio Stefield - Valiente (Amitacek Remix) (Cut From Amitacek Set)-enTc.mp3\nCBM &amp; Renato Dinis - Zero XL (Set Rip)-enTc.mp3\nCiro Visone &amp; Ian Standerwick featuring Sarah McLachlan - First Silence (James Alexander's Defconditioned Edition) (Set Rip)-enTc.mp3\nCJ Arthur - Pacific (Cut From Palagano Set)-enTc.mp3\nCold Rush - Soundscape (UDM Remix) (Cut From Lazarus Set)-enTc.mp3\nD-Mad - Keep Believing (Original Mix) (Cut From Tritonal Set)-enTc.mp3\nD-wayne - Project 6 (Original Mix) (Cut From R3HAB Set)-enTc.mp3\nDaam, Digital Self &amp; Tek-Tonic - The Cook (Cut From Sheperd Set)-enTc.mp3\nDamian Wasse - ID 001 -October 2013- (Set Rip)-enTc.mp3\nDamian Wasse - ID 002 -October 2013- (Set Rip)-enTc.mp3\nDamian Wasse - Lost Love (Original Mix) (Set Rip)-enTc.mp3\nDamian Wasse - Prison Break (Original Mix) (Set Rip)-enTc.mp3\nDamian Wasse feat. Irina Makosh - Under The Sky (Original Mix) (Set Rip)-enTc.mp3\nDarren Porter &amp; Gareth Weston - Malware (Cut From Tyas Set)-enTc.mp3\nDC - Black (Original Mix) (Cut From Tucandeo Set)-enTc.mp3\nDean Cohen &amp; Mednas - Apex (Original Mix) (Cut From R3HAB Set)-enTc.mp3\nDee Henry - Heavans Earth (Original Mix) (Cut From Summerville Set)-enTc.mp3\nDenis Sender Feat. Irina Makosh - Wait For Me (Dj Geri Remix) (Cut From Shah Set)-enTc.mp3\nDigital Basement - Ultravioleta (Tech Mix) (Cut From Summerville Set)-enTc.mp3\nDima Krasnik - Upliftology (Cut From Tyas Set)-enTc.mp3\nDimitri Vegas &amp; Like Mike &amp; Boostedkids - Gypsy (Cut From W&amp;W Set)-enTc.mp3\nDJ Madwave - Synergy Anthem 2013 (Dennis Sheperd Remix) (Cut From Sheperd Set)-enTc.mp3\nEssonita Feat. Irina Makosh - Letter To Angel (Original Mix) (Cut From Shah Set)-enTc.mp3\nEtienne De Crecy - We, Computers (Yolanda Be Cool &amp; Wax Motif Remix) (Cut From Levi Set)-enTc.mp3\nFloE - Blizzard (Jesser ReMode) (Cut From KvA Set)-enTc.mp3\nFrench Skies - Element Of Life (Stephane Badey Remix) (Cut From Lazarus Set)-enTc.mp3\nFuzzy &amp; Simon Moon - Lost (Original Mix) (Cut From Simon Moon Set)-enTc.mp3\nGal Abutbul &amp; Sarah Russell - You Have Realised (Original Mix) (Cut From Beat Service Set)-enTc.mp3\nGal Abutul - Serenity (Original Mix) (Cut From A&amp;F Set)-enTc.mp3\nGallagher &amp; Palagano feat. Molly Bancroft - Somewhere (Solid Stone Remix) (Cut From Knowles Set)-enTc.mp3\nGary Edgar - Insanity (Set Rip)-enTc.mp3\nGenix &amp; Las Salinas - Say Another What (Original Mix) (Cut From Koglin Set)-enTc.mp3\nGiuseppe Ottaviani with Aly &amp; Fila - Brilliant People (Snejider Remix) (Cut From Solarstone Set)-enTc.mp3\nGregori Klosman - Funk It (Cut From W&amp;W Set)-enTc.mp3\nHans Zimmer - Time (Superlifter Remix) (Cut From Tucandeo Set)-enTc.mp3\nHard Rock Sofa &amp; Skidka - Let Me Hear You Scream (Cut From W&amp;W Set)-enTc.mp3\nHusman - 360 (Cut From W&amp;W Set)-enTc.mp3\nHusman - Evol (Cut From W&amp;W Set)-enTc.mp3\nInner Peace - Ataraxia (Cut From Knowles Set)-enTc.mp3\nIzzy Meusen &amp; Beatsole - From Here To Chelyabinsk (Frank Waanders Remix) (Cut From Saux Set)-enTc.mp3\nJames Dymond - Just Let Me Be (Cut From Ind Noise Set)-enTc.mp3\nJay Z feat. Justin Timberlake - Holy Grail (Jordy Dazz Bootleg) (Cut From R3HAB Set)-enTc.mp3\nJohan de Kock, Stefan Viljoen &amp; Nanje Nowack - Silence (Noadjas Sunrise Remix) (Cut From Lazarus Set)-enTc.mp3\nJosdar - Sunsetness (Cut From KvA Set)-enTc.mp3\nJosh Silver - Set In Motion (CBM Remix) (Set Rip)-enTc.mp3\nKamil Esten - Immersion (Cut From Palagano Set)-enTc.mp3\nKat Krazy feat. Elkka - Siren (Kill The Buzz Remix) (Cut From W&amp;W Set)-enTc.mp3\nKhan Edison - Jeremy (Dub Mix) [CBM Edit] (Set Rip)-enTc.mp3\nKosheen - Harder They Fall (Original Mix) (Cut From Sheperd Set)-enTc.mp3\nKyohei Akagawa - Anbruch (Cut From Kenji Set)-enTc.mp3\nLance Mathard &amp; DJ T.H. - Smile As A Gift (Tucandeo Remix) (Cut From Anna Lee Set)-enTc.mp3\nLence &amp; Pluton - Save My Soul (Araya &amp; Mark Dreamer Remix) (Cut From Palagano Set)-enTc.mp3\nLeventina - Love America (Cut From Emery Set)-enTc.mp3\nLiam Melly &amp; Nick Sentience - Night Shift (Paul Denton Remix) (Cut From Kearney Set)-enTc.mp3\nLIZ - U Over Them (Peking Duk &amp; CRNKN Remix) (Set Rip)-enTc.mp3\nLondon Grammar - Strong (Jonas Rathsman Remix) (Cut From Levi Set)-enTc.mp3\nMaestro Harrell &amp; Antoine Becks - Drop It (Original Mix) (Cut From R3HAB Set)-enTc.mp3\nMartin Garrix - Animals (Botnek Edit) (Cut From Emery Set)-enTc.mp3\nMat Zo- Lucid Dreams (Ilan Bluestone Remix) (ABGT 051 Rip)-enTc.mp3\nMatt Eray - Long Beach (Cut From Knowles Set)-enTc.mp3\nMatt Eray - Pistol Star (Cut From Ind Noise Set)-enTc.mp3\nMaunel Rocca - Plenitude (Cut From Palagano Set)-enTc.mp3\nMax Freegrant - Catch Me If You Can (Club Edit) (Cut From O'Neil Set)-enTc.mp3\nMichael Retouch - The Breath Of Freedom (Beatsole Remix) (Cut From Anna Lee Set)-enTc.mp3\nMightyfools - Go (Original Mix) (Cut From R3HAB Set)-enTc.mp3\nMike Koglin - Sputnik (Cut From Koglin Set)-enTc.mp3\nMike Spinner - Dynamik (Original Mix) (Cut From Saux Set)-enTc.mp3\nMike van Fabio &amp; Alex van ReeVe - Skyliner (Original Mix) (Cut From Van ReeVe Set)-enTc.mp3\nMimax - Set Free (Cut From KvA Set)-enTc.mp3","torrent":{"xt":"urn:btih:e7eb7b1b2cd83a5d44ed87d836b22d9395ff3619","amp;dn":"EnigmaT+Set+Rips+%7B+Cuts+%7D+-+November+6th%2C+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e7eb7b1b2cd83a5d44ed87d836b22d9395ff3619","infoHashBuffer":{"type":"Buffer","data":[231,235,123,27,44,216,58,93,68,237,135,216,54,178,45,147,149,255,54,25]},"announce":[],"urlList":[]}}