{"title":"Charles Lewinsky - Het lot van de familie Meijer (E-Book)NLT-Rel","uid":5348585,"size":1115705,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e8e314637790682e963809bb1519eb0ffb7b3663&amp;dn=Charles+Lewinsky+-+Het+lot+van+de+familie+Meijer+%28E-Book%29NLT-Rel&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"soap22","files":6,"time":1265720788,"description":"Beschrijving: Charles Lewinsky - Het lot van de familie Meijer \n\nAls op een nacht in 1871 een ver familielid bij de deur van de Meijers aanklopt, kan niemand vermoeden dat hun leven vanaf dat moment radicaal zal veranderen. Hun wereld in het dorp Endingen is op dat moment klein, maar nog intact. Dan duikt wervelwind Janki op, een ver familielid, al weet niemand er het fijne van. Een jaar later heeft hij een bruid - de aangenomen dochter annex dienstmeid Chanele, een vrouw die op vele momenten een beslissende rol gaat spelen in het leven van de Meijers - en een stoffenwinkel in Baden.\n\nVijf generaties beslaat de geschiedenis van de Meijers, een geschiedenis vol liefdesgeluk en levensdroefenis, en vol strijd om succes en acceptatie. Van de kleine, gave wereld van Endingen, waar veehandelaar Salomon Meijer zijn altijd opgevouwen paraplu tot een symbool van zijn betrouwbaarheid heeft gemaakt, gaat het naar het mooiste warenhuis van ZÃƒÂ¼rich, en voorbij de landsgrenzen. En steeds raakt de wereld een stukje meer uit zijn voegen.\n\nCharles Lewinsky schrijft met een verbeeldingskracht die de lezer onherroepelijk tot een bang, hoopvol en hunkerend deel van deze familie laat worden.\n\nMet Het lot van de familie Meijer heeft Charles Lewinsky een ongelooflijk indrukwekkende, mooie, grappige, ontroerende familieroman geschreven. De stemmen van Salomon Meijer en de zijnen zullen nog lang nagonzen.\n\n","torrent":{"xt":"urn:btih:e8e314637790682e963809bb1519eb0ffb7b3663","amp;dn":"Charles+Lewinsky+-+Het+lot+van+de+familie+Meijer+%28E-Book%29NLT-Rel","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e8e314637790682e963809bb1519eb0ffb7b3663","infoHashBuffer":{"type":"Buffer","data":[232,227,20,99,119,144,104,46,150,56,9,187,21,25,235,15,251,123,54,99]},"announce":[],"urlList":[]}}