{"title":"(Bhajan) Vinod Agarwal - Radha Raman Temple Live-mickjapa108","uid":5480171,"size":70557092,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e8f39941ae878d4d13ffc0cef620df3f11c5962c&amp;dn=%28Bhajan%29+Vinod+Agarwal+-+Radha+Raman+Temple+Live-mickjapa108&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mickjapa108","files":5,"time":1270340400,"description":"Vinod Agarwal - Radha Raman Temple Live\n\nRadha Raman Temple(Mandir)is in Vrindavan,the place where Sri Krishna had\nhis childhood pastimes,In the month of Kartik thousands of people &amp; sadhu's\nFile past and pay their Dandavat Pranaams to their lordships Sri Sri Radha Raman\nThese deities are self manifest.\nVinod Agarwal has a realy nice Devotional voice.\n\nVyenkata Bhatta invited Lord Chaitanya to stay at his house during Chaturmasya in Sri Rangam. Gopal Bhatta was at that time small boy and got the chance to serve the Lord and hear directly from Him. After some time Lord Chaitanya left on his tour to South India and told Gopal Bhatta to go in the future to Vrindavan\nGopal Bhatta became learned in Sanskrit, poetry, rhetoric and all aspects of devotional service. After passing of his parents, he left home and proceeded towards Vrindavan where he joined Rupa and Sanatan\nAfter some time studying in Vrindavan Gopal Bhatta made a trip to Nepal. One day when he was taking bath in Kali-Gandakini river, he dipped his kamandalu into the water and 12 silas mysteriously entered his water pot\nHe put them back into the water and dipped the kamandalu again in the water of the holy river, but the silas again entered his water pot\nWhen it happened for the third time, Gopal Bhatta realized, that those are not ordinary stones, but they must be some very special ones and there must be some divine arrangement behind it. He kept them in a cloth bag hung around his neck and from that time on he started to worship them and then returned to Vrindavan\nAs previously mentioned, once he intensely desired to decorate his salagram as the other Goswamis could decorated their Deities, then seat Him on a swing and serve Him as other devotees can. &quot;If only He had arms and legs like a Deity,&quot; he thought\nLord Krisna, being very kind to His devotees, that very night transformed Himself from one of small salagram-sila into threefold form of Radharaman. If one has darsan of Radharaman's back, one will see that it resemble salagram-sila. Although the Deity is quite small many devotees find Him to be extremely attractive.","torrent":{"xt":"urn:btih:e8f39941ae878d4d13ffc0cef620df3f11c5962c","amp;dn":"%28Bhajan%29+Vinod+Agarwal+-+Radha+Raman+Temple+Live-mickjapa108","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e8f39941ae878d4d13ffc0cef620df3f11c5962c","infoHashBuffer":{"type":"Buffer","data":[232,243,153,65,174,135,141,77,19,255,192,206,246,32,223,63,17,197,150,44]},"announce":[],"urlList":[]}}