{"title":"Public Enemy - Fear of a Black Planet 1990 [FLAC] TNT Village","uid":8891627,"size":416075204,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e9a988b8edd1d669ac379020da7b874f9b6749a4&amp;dn=Public+Enemy+-+Fear+of+a+Black+Planet+1990+%5BFLAC%5D+TNT+Village&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"l.diliberto","files":20,"time":1378594797,"description":"Public Enemy - Fear of a Black Planet 1990 [FLAC] TNT Village\n\n.: Release Originale :.\n &lt;a href=&quot;\nhttp://forum.tntvillage.scambioetico.org/index.php?showtopic=358531&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.tntvillage.scambioetico.org/index.php?showtopic=358531&lt;/a&gt;\n\nAnno: 20 marzo 1990\nGenere: Hardcore Rap\n\nAt the time of its release in March 1990 -- just a mere two years after It Takes a Nation of Millions -- nearly all of the attention spent on Public Enemy's third album, Fear of a Black Planet, was concentrated on the dying controversy over Professor Griff's anti-Semitic statements of 1989, and how leader Chuck D bungled the public relations regarding his dismissal. References to the controversy are scattered throughout the album -- and it fueled the incendiary lead single, &quot;Welcome to the Terrordome&quot; -- but years later, after the furor has died down, what remains is a remarkable piece of modern art, a record that ushered in the '90s in a hail of multiculturalism and kaleidoscopic confusion. It also easily stands as the Bomb Squad's finest musical moment. Where Millions was all about aggression -- layered aggression, but aggression nonetheless -- Fear of a Black Planet encompasses everything, touching on seductive grooves, relentless beats, hard funk, and dub reggae without blinking an eye. All the more impressive is that this is one of the records made during the golden age of sampling, before legal limits were set on sampling, so this is a wild, endlessly layered record filled with familiar sounds you can't place; it's nearly as heady as the Beastie Boys' magnum opus, Paul's Boutique, in how it pulls from anonymous and familiar sources to create something totally original and modern. While the Bomb Squad were casting a wider net, Chuck D's writing was tighter than ever, with each track tackling a specific topic (apart from the aforementioned &quot;Welcome to the Terrordome,&quot; whose careening rhymes and paranoid confusion are all the more effective when surrounded by such detailed arguments), a sentiment that spills over to Flavor Flav, who delivers the pungent black humor of &quot;911 Is a Joke,&quot; perhaps the best-known song here. Chuck gets himself into trouble here and there -- most notoriously on &quot;Meet the G That Killed Me,&quot; where he skirts with homophobia -- but by and large, he's never been so eloquent, angry, or persuasive as he is here. This isn't as revolutionary or as potent as Millions, but it holds together better, and as a piece of music, this is the best hip-hop has ever had to offer.\n\n.: Cover :.\n &lt;a href=&quot;\nhttp://24.media.tumblr.com/tumblr_m89onjaXey1qcsj9co1_500.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://24.media.tumblr.com/tumblr_m89onjaXey1qcsj9co1_500.jpg&lt;/a&gt;\n\n.: Tracklist :.\n\nContract on the World Love Jam (strumentale) - 1:44\nBrothers Gonna Work It Out - 5:07\n911 Is a Joke - 3:17\nIncident at 66.6 FM (strumentale) - 1:37\nWelcome to the Terrordome - 5:25\nMeet the G That Killed Me - 0:44\nPollywanacraka - 3:52\nAnti-Nigger Machine - 3:17\nBurn Hollywood Burn - 2:47\nPower to the People - 3:50\nWho Stole the Soul? - 3:49\nFear of a Black Planet - 3:45\nRevolutionary Generation - 5:43\nCan't Do Nuttin' for Ya Man - 2:46\nReggie Jax - 1:35\nLeave This off Your Fuckin Charts (strumentale) - 2:31\nB Side Wins Again - 3:45\nWar at 33 1/3 - 2:07\nFinal Count of the Collison Between Us and the Damned (strumentale) - 0:48\nFight the Power - 4:42","torrent":{"xt":"urn:btih:e9a988b8edd1d669ac379020da7b874f9b6749a4","amp;dn":"Public+Enemy+-+Fear+of+a+Black+Planet+1990+%5BFLAC%5D+TNT+Village","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e9a988b8edd1d669ac379020da7b874f9b6749a4","infoHashBuffer":{"type":"Buffer","data":[233,169,136,184,237,209,214,105,172,55,144,32,218,123,135,79,155,103,73,164]},"announce":[],"urlList":[]}}