{"title":"Flowering Plants","uid":6537196,"size":5462811,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e9c465544a15c02f83c6be75f425e00d65027bd9&amp;dn=Flowering+Plants&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"_F1_","files":-1,"time":1310555351,"description":"Armen Takhtajan, &quot;Flowering Plants&quot;\n Sp rin ger | 2009 | ISBN: 1402096089 | 905 pages | PDF | 5.20 MB \n\n Armen Takhtajan is among the greatest authorities in the world on the evolution of plants. This book culminates almost sixty years of the scientist's research of the origin and classification of the flowering plants. It presents a continuation of Dr. Takhtajan's earlier publications including &quot;Systema Magnoliophytorum&quot; (1987), (in Russian), and &quot;Diversity and Classification of Flowering Plants&quot; (1997), (in English). In his latest book, the author presents a concise and significantly revised system of plant classification ('Takhtajan system') based on the most recent studies in plant morphology, embryology, phytochemistry, cytology, molecular biology and palynology. Flowering plants are divided into two classes: class Magnoliopsida (or Dicotyledons) includes 8 subclasses, 126 orders, c. 440 families, almost 10,500 genera, and no less than 195,000 species; and, class Liliopsida (or Monocotyledons) includes 4 subclasses, 31 orders, 120 families, more than 3,000 genera, and about 65,000 species. This book contains a detailed description of plant orders, and descriptive keys to plant families providing characteristic features of the families and their differences.","torrent":{"xt":"urn:btih:e9c465544a15c02f83c6be75f425e00d65027bd9","amp;dn":"Flowering+Plants","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e9c465544a15c02f83c6be75f425e00d65027bd9","infoHashBuffer":{"type":"Buffer","data":[233,196,101,84,74,21,192,47,131,198,190,117,244,37,224,13,101,2,123,217]},"announce":[],"urlList":[]}}