{"title":"Celine Dion - A New Day Has Come  (2nafish)","uid":5291501,"size":145899524,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:ea320161a312de39756d435241fe95b6675d1933&amp;dn=Celine+Dion+-+A+New+Day+Has+Come++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1263914395,"description":"File Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 4000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;A New Day Has Come&quot; is the lead single from CÃƒÂ©line Dion's comeback album A New Day Has Come, released on March 11, 2002.\n\nThe song was written by Aldo Nova and Stephan Moccio and produced by Walter Afanasieff and Nova as a piano-driven ballad. However, the midtempo radio remix co-produced by Ric Wake was released as the lead track. Both versions are included on the album.\n\nThe &quot;A New Day Has Come&quot; music video was directed by Dave Meyers and premiered in March 2002.\n\n&quot;A New Day Has Come&quot; was very successful around the world. On the U.S. Hot Adult Contemporary Tracks, the song broke the record for most weeks at number 1: it stayed on top twenty-one weeks. The previous record holders were Phil Collins' &quot;You'll Be in My Heart&quot; and CÃƒÂ©line Dion's own &quot;Because You Loved Me,&quot; both of which lasted nineteen weeks at number 1. However, as of today, the record has been surpassed, as &quot;Drift Away&quot; by Uncle Kracker featuring Dobie Gray remained twenty-eight weeks at number 1 in 2004. Ironically, it was CÃƒÂ©line Dion who almost took the crown from &quot;Drift Away,&quot; but &quot;Have You Ever Been in Love&quot; stopped at number 2 for fourteen weeks, which is another record. In the U.S., the single appeared on the Billboard Hot 100 because of airplay only, reaching number 22 (also number 22 on the Billboard Hot 100 Airplay).\n\nThe DVD single was released four months later in the U.S., peaking at number 11 on the Top Music Video and number 16 on the Hot 100 Singles Sales. It has sold 45,000 copies and was certified gold. &quot;A New Day Has Come&quot; CD single was also certified gold in Australia (35,000), Greece (30,000) and Norway (10,000). In the United Kingdom it has sold 110,000 copies.\n\nDion performed this song five nights a week during her show A New Day... at Caesars Palace, Las Vegas and released it on the Live in Las Vegas - A New Day... DVD in December 2007. In October 2008, &quot;A New Day Has Come&quot; was included on My Love: Essential Collection greatest hits.\n\nA New Day Has Come is an album by Canadian singer CÃƒÂ©line Dion, which marked her return after two-year hiatus to have a child. It was released on March 22, 2002. A New Day Has Come is Dion's 9th English album and 28th in total. The limited edition, containing bonus DVD with two audio and two video tracks, was released in November 2002.\n\nLet's Talk About Love / Falling into You / A New Day Has Come 3CD set was released in October 2007. Later, it was repacked and released in a reusable gift box on September 29, 2009, titled The Collection. Also on October 2, 2009 Let's Talk About Love / A New Day Has Come 2CD set was released.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:ea320161a312de39756d435241fe95b6675d1933","amp;dn":"Celine+Dion+-+A+New+Day+Has+Come++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ea320161a312de39756d435241fe95b6675d1933","infoHashBuffer":{"type":"Buffer","data":[234,50,1,97,163,18,222,57,117,109,67,82,65,254,149,182,103,93,25,51]},"announce":[],"urlList":[]}}