{"title":"Devo - Recombo DNA Disc 2 of 2 Sequence B (2000) [FLAC]","uid":4670956,"size":546062086,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:eb5a0a26b5f26ed7584240edb8ac876586c28ef1&amp;dn=Devo+-+Recombo+DNA+Disc+2+of+2+Sequence+B+%282000%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"storoa","files":20,"time":1232732133,"description":"Review\tby Aaron Badgley\n\nThis is a brilliant package and an excellent example of how creative and informative artists can make such releases. Everything spread over this two CD set is previously unreleased (with the exception of &quot;Bushwacked&quot; which had appeared on a flexi-disc in an edited form for the magazine Reflex). There is a wealth of material here, which is mostly all quite good. Devo is, for the most part, an underrated and misunderstood band. Fans know this, but the general public still has the image of the &quot;dome heads&quot; look (as seen in the &quot;Whip It&quot; video). But Devo was, and is, more. This package demonstrates this fact. From early punk to the techno-driven dance beats of their early-'90s career, Devo remained truly unique, adventurous, and creative. This package lets fans have a sneak peak into their creativity with demos of favorites (&quot;Gates of Steel&quot; is particularly brilliant in its early carnation), as well as live material not many have heard, especially songs performed by their alter ego Dove (just rearrange the letters). Dylan's &quot;Gotta Serve Somebody&quot; is enlightening, as well as their own gem, &quot;I Saw Jesus.&quot; Wonderful stuff that would have been lost in time were it not for an astounding compilation such as this. Booji Boy also makes an appearance with the concert favorite &quot;The Words Get Stuck in My Throat,&quot; which the band finally recorded in the studio for their 2000 compilation, Pioneers Who Got Scalped. Actually this is a fantastic companion to the CD, and just as indispensable. It is a must for any serious Devo fan. As with all Rhino Handmade releases, this CD is a limited edition (5000 copies) which was sold through the Rhino Handmade website. ","torrent":{"xt":"urn:btih:eb5a0a26b5f26ed7584240edb8ac876586c28ef1","amp;dn":"Devo+-+Recombo+DNA+Disc+2+of+2+Sequence+B+%282000%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb5a0a26b5f26ed7584240edb8ac876586c28ef1","infoHashBuffer":{"type":"Buffer","data":[235,90,10,38,181,242,110,215,88,66,64,237,184,172,135,101,134,194,142,241]},"announce":[],"urlList":[]}}