{"title":"Fireproof Your Life for Teens (2015).epub Gooner","uid":14348269,"size":2837588,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:eb8f4e879499ce64fbad9bb5338d7a8b33a72d98&amp;dn=Fireproof+Your+Life+for+Teens+%282015%29.epub+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1461004916,"description":"Fireproof Your Life for Teens (2015).epub Gooner\r\n\r\nPublisher: B&amp;H Kids (February 1, 2015)\r\nLanguage: English\r\nISBN-10: 143368487X\r\nISBN-13: 978-1433684876\r\n\r\nFireproofing Your Life for Teens is the follow up to the award winning title Courageous Teens f by Michael Catt, senior pastor of Sherwood Baptist Church and executive producer of the hit film Courageous.\r\n\r\nThe popularity of the film Fireproof made one thing certain: we as Christians are continually seeking ways to galvanize our faith against the fires of the world around us. And there is arguably no time in our lives when our faith is more under fire than our teenage years. As young people struggle to learn who they are, they can only forge an indestructible identity by remembering whose they are.\r\n\r\nUsing Bible-based teachings and practical applications, Fireproof Your Life for Teens will walk them through the process of building an invincible, impenetrable faith. And this is not a faith that just shows up on Sunday mornings, but one that reaches deep into their hearts and stretches out to encompass every area of their lives. From decision-making to relationships to money, Michael Catt and Amy Parker will show teens how a fireproof faith and biblical principles play an integral part in every aspect of their day-to-day lives, as well as in shaping their future.\r\n\r\nWe make life so complicated. Trials and temptations will come, but the solution is simple. For every single situation we are going to face, for every decision we are going to make, the answer is there. And it begins and ends with God. Like Shadrach, Meschach, and Abednego in that famous fiery furnace, when we learn to stand with God, we can all be fireproof","torrent":{"xt":"urn:btih:eb8f4e879499ce64fbad9bb5338d7a8b33a72d98","amp;dn":"Fireproof+Your+Life+for+Teens+%282015%29.epub+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb8f4e879499ce64fbad9bb5338d7a8b33a72d98","infoHashBuffer":{"type":"Buffer","data":[235,143,78,135,148,153,206,100,251,173,155,181,51,141,122,139,51,167,45,152]},"announce":[],"urlList":[]}}