{"title":"Constrained Deformation of Materials","uid":6507240,"size":8524540,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ecbeecb8b4239a544385bd4ed246bb5a52d961df&amp;dn=Constrained+Deformation+of+Materials&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"_F1_","files":-1,"time":1309466356,"description":"Y.-L. Shen, &quot;Constrained Deformation of Materials: Devices, Heterogeneous Structures and Thermo-Mechanical Modeling&quot;\nSp ger | 2010 | ISBN: 1441963111 | 282 pages | PDF | 9,5 MB\n\n&quot;Constrained Deformation of Materials: Devices, Heterogeneous Structures and Thermo-Mechanical Modeling&quot; is an in-depth look at the mechanical analyses and modeling of advanced small-scale structures and heterogeneous material systems. Mechanical deformations in thin films and miniaturized materials, commonly found in microelectronic devices and packages, MEMS, nanostructures and composite and multi-phase materials, are heavily influenced by the external or internal physical confinement. A continuum mechanics-based approach is used, together with discussions on micro-mechanisms, to treat the subject in a systematic manner under the unified theme. Readers will find valuable information on the proper application of thermo-mechanics in numerical modeling as well as in the interpretation and prediction of physical material behavior, along with many case studies. Additionally, particular attention is paid to practical engineering relevance. Thus real-life reliability issues are discussed in detail to serve the needs of researchers and engineers alike.","torrent":{"xt":"urn:btih:ecbeecb8b4239a544385bd4ed246bb5a52d961df","amp;dn":"Constrained+Deformation+of+Materials","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ecbeecb8b4239a544385bd4ed246bb5a52d961df","infoHashBuffer":{"type":"Buffer","data":[236,190,236,184,180,35,154,84,67,133,189,78,210,70,187,90,82,217,97,223]},"announce":[],"urlList":[]}}