{"title":"Theme.Hospital-CLASSICS(Murlok)","uid":7802604,"size":167384355,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:eceed8e23ab0dba8d5896b28d2a1007789d19282&amp;dn=Theme.Hospital-CLASSICS%28Murlok%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Murlok","files":-1,"time":1352318668,"description":": R E T R O G A M I N G /: /\n_ |_ ___. is the real._//__ _ | _/\ngaming\n\nCLASSiCS\n\n_presents a fine game_/\n\nTheme Hospital (c) Electronic Arts\n\ndate : 2012-11-07protection : DRM\ngame type : Strategysize : 1 disk\nextras : Manual, Avatars\nrequirements : WinXP/Vista/7 - 1.8Ghz/512MB/DX7 - 2GB\nstore date : 1997-03-31\n\n:G A M EI N F O /: /\n\nIt's a matter of laugh or death in Theme HospitalT, another installment\nof the Theme series. Design, maintain and manage a hi-tech hospital\nfacility, making the most of limited resources and turning cures into\ncash. The Grim Reaper stalks the corridors, the ill have some very\nodd ailments, and the staff want to play doctors and nurses together.\nNo matter how you look at it, you're in control of a very sick hospital.\n\nIf there is one word that describes Theme Hospital then it has to be\n&quot;hilarious.&quot; Almost everything in this game is made with great dose of\nhumour. You might think that someone's illness is not a laughing matter\nbut wait till you see a patient with KingComplex dressed as Elvis or\nserious case of Hairyitis caused from prolonged exposure to the moon.\n\nFinding treatments for such diseases is a part of your job, but there's\nno prescription to cure the insanity that may result from trying to\nfigure out those cures. You start off small with an empty building, a\nfew doctors, a general diagnostic, a pharmacy, a reception desk, and a\nfew other necessities. From there it's up to you to move your way up\nin the health care industry.\n\nA hospital simulator is not something you might consider a good theme\nfor a game but the guys from Bullfrog Productions were famous for\ncreating innovative and fun titles from the craziest idea -- and Theme\nHospital no exception. This game is a piece of art and definitely the\nbest &quot;hospital&quot; simulation so check it out. Our diagnosis: fun!\n\n: I N S T A L L A T I O N /: /\n_ |_ ___.(remember firewall) ._//__ _ | _/\n\n1. Unpack.\n2. Install.\n3. Enjoy this great title.\n\n: W H O A R E W E /: /\n\nSince there sadly are games that are since long lost, and other games\nwhere as only exists archived as rip's - we, gamers that love retro-\ngames - decided to release classics so that you too can enjoy these\nas we do. Don't want it? Then don't keep it.\n\nSave Our Children\n\n\nEnjoy","torrent":{"xt":"urn:btih:eceed8e23ab0dba8d5896b28d2a1007789d19282","amp;dn":"Theme.Hospital-CLASSICS%28Murlok%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eceed8e23ab0dba8d5896b28d2a1007789d19282","infoHashBuffer":{"type":"Buffer","data":[236,238,216,226,58,176,219,168,213,137,107,40,210,161,0,119,137,209,146,130]},"announce":[],"urlList":[]}}