{"title":"Funkadelic - Who's A Funkadelic .flac files","uid":6278126,"size":351431267,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ed634dfdf7ed1981c2a491533b5385f5facfa44a&amp;dn=Funkadelic+-+Who%5C%27s+A+Funkadelic+.flac+files&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ulikes","files":14,"time":1301337731,"description":"Every now and then in the music industry you come across a &quot;what was they thinking? album&quot; This album is one of those. This was the revenge album of Grady Thomas, Fuzzy Haskins, and Calvin Simon. They mostly wrote about how greedy George was, and proceeded to be not very funky themselves. For completists. It was rereleased in 1992 under a different title, possibly to try and cash in on some of the new wave of Parliament popularity. Now there's an original Parliaments reunion album in the works. Grady is actually back singing with the All-Stars, Fuzzy is a preacher who has talked about getting back with George, but no one I've talked to knows what Calvin is up to.\n\nOn the cover of the album, it says, &quot;none of the concepts on this album are related to George Clinton&quot;, and that may be what kills it. Say what you will about Clinton's actual contribution to the music of Funkadelic, but without his concepts and ideas, none of this would have gotten off the ground. The proof is here, when three important Parliaments try and work without him, and the result is mostly mediocre. Not awful, mind you--it's certainly competent enough, and the band they put together is pretty good-- but the vibe that existed on those P.Funk albums just isn't here. They sound like just another funk group; worse, they sound like one that had used up most of their good ideas already. The trio of ex-Parliaments sound very bitter about being used by George, and perhaps they had every right to be, but it didn't make for a great album. \n\nThis was the revenge album of Grady Thomas, Fuzzy Haskins, and Calvin Simon. They mostly wrote about how greedy George was, and proceeded to be not very funky themselves. For completists. It was rereleased in 1992 under a different title, possibly to try and cash in on some of the new wave of Parliament popularity. Now there's an original Parliaments reunion album in the works. Grady is actually back singing with the All-Stars, Fuzzy is a preacher who has talked about getting back with George, but no one I've talked to knows what Calvin is up to.\n\nOn the cover of the album, it says, &quot;none of the concepts on this album are related to George Clinton&quot;, and that may be what kills it. Say what you will about Clinton's actual contribution to the music of Funkadelic, but without his concepts and ideas, none of this would have gotten off the ground. The proof is here, when three important Parliaments try and work without him, and the result is mostly mediocre. Not awful, mind you--it's certainly competent enough, and the band they put together is pretty good-- but the vibe that existed on those P.Funk albums just isn't here. They sound like just another funk group; worse, they sound like one that had used up most of their good ideas already. The trio of ex-Parliaments sound very bitter about being used by George, and perhaps they had every right to be, but it didn't make for a great album. \n\nTrack Listing:\n\nPhunkLords \n\t{Clarence Haskins, Billy Mims, Calvin Simon, Grady Thomas, Ben Powers}  5:32\nYou'll Like It Too\n\t{C Haskins, C Simon, G Thomas, Michael Williams}  4:27\nThe Witch\n\t{C Haskins, Johnson, C Simon, G Thomas, Betty Jo Drake}  9:29\n   Shade I: The Proclafunktion\n   Shade II: The Infunktation\n   Shade III: The Celefunktion\nConnections and Disconnections                                   \n\t{Stanley, Geter, C Haskins, B Mims, C Simon, G Thomas}  5:00\nCome Back\n\t{C Haskins, C Simon, G Thomas, B Mims, B Powers}  4:28\nCall the Doctor\n\t{BJ Drake, C Haskins, B Mims, C Simon, G Thomas}  5:12\nWho's A Funkadelic\n\t{C Haskins, B Mims, C Simon, G Thomas}  5:47\n\nEnjoy and please seed!!!","torrent":{"xt":"urn:btih:ed634dfdf7ed1981c2a491533b5385f5facfa44a","amp;dn":"Funkadelic+-+Who%5C%27s+A+Funkadelic+.flac+files","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ed634dfdf7ed1981c2a491533b5385f5facfa44a","infoHashBuffer":{"type":"Buffer","data":[237,99,77,253,247,237,25,129,194,164,145,83,59,83,133,245,250,207,164,74]},"announce":[],"urlList":[]}}