{"title":"Jerry Garcia Plays Dylan (2 CD) 2005@256","uid":3408110,"size":284539868,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:eee6ffb64e7801522f3774aa6b67fe7611bac548&amp;dn=Jerry+Garcia+Plays+Dylan+%282+CD%29+2005%40256&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"buzzard","files":18,"time":1131739880,"description":"Jerry Garcia - Ladder To The Stars: Garcia Plays Dylan (2 CD)\nLabel: WEA/Rhino Records RHI 73263\nRelease Date: October 11, 2005\nStreet Date: Oct 25, 2005 \n\nsize:           271 mb\nbitrate:      256\n\n\nDouble Disc Collection Of Jerry Garcia's Interpretations of Bob Dylan Classics Featuring Unreleased Live Recordings Available From Rhino October 25\n\n&quot;There's no way to measure his greatness or magnitude as a person or as a player... He really had no equal...&quot; -- Bob Dylan, after Jerry Garcia's death in 1995\n\nSeptember 22 2005\nLOS ANGELES --\n\nFriends, tour mates, and icons of the '60s counterculture, Jerry Garcia and Bob Dylan helped define an era with their music. As the leader of the Grateful Dead and various side-projects, Garcia was one of a handful of artists who could make a Dylan song his own. Rhino Records, in collaboration with J. Garcia Records, pays tribute to Garcia's inspired interpretations with the first-ever compilation of those stunning performances.\n\nJERRY GARCIA PLAYS DYLAN includes 15 recordings and more than two hours of unreleased live performances from the Garcia vaults remastered in HDCD. The double-disc collection features Dylan classics performed by the Grateful Dead, the Jerry Garcia Band, and Legion of Mary as well as Garcia-Saunders' rousing take on &quot;It Takes A Lot To Laugh, It Takes A Train to Cry.&quot;\n\nDrawing heavily from his work-both solo and electric -- with the remarkable Jerry Garcia Band, JERRY GARCIA PLAYS DYLAN spotlights nine dazzling performances of songs that span the Dylan canon, including &quot;Tough Mama,&quot; &quot;Positively 4th Street,&quot; &quot;Knockin' On Heaven's Door,&quot; &quot;Simple Twist Of Fate,&quot; &quot;I Shall Be Released,&quot; &quot;When I Paint My Masterpiece,&quot; &quot;Forever Young,&quot; &quot;Tangled Up In Blue,&quot; and &quot;Senor (Tales of Yankee Power).&quot;\n\nGarcia also leads the Grateful Dead through four soulful jams, including &quot;The Mighty Quinn (Quinn The Eskimo),&quot; a song that first appeared on Dylan's Self Portrait in 1970, &quot;She Belongs To Me&quot; and &quot;It's All Over Now, Baby Blue&quot; from 1965's Bringing It All Back Home, and &quot;Visions Of Johanna&quot; from 1966's Blonde On Blonde. Another highlight of the compilation is an astonishing version of &quot;The Wicked Messenger&quot; by Legion of Mary, a short-lived jazz and funk flavored group featuring Garcia, keyboardist and longtime Garcia collaborator Merl Saunders, saxophonist and flautist Martin Fierro, and drummer Ron Tutt.\n\nJERRY GARCIA PLAYS DYLAN features enlightening liner notes written by Garcia biographer Blair Jackson who tells the stories behind the performances. Dead guitarist and singer Bob Weir also contributes to the liner notes, adding a behind-the-scenes look at the bond shared by Dylan and the Dead.\n\n[IMG]http://img406.imageshack.us/img406/3562/garciaplaysdylan8es.jpg[/IMG]\n\nJERRY GARCIA PLAYS DYLAN\nTrack Listing\n\nDisc 1\n\n   1. &quot;It Takes A Lot To Laugh, It Takes A Train To Cry&quot; -- Garcia-Saunders\n   2. &quot;Tough Mama&quot; -- Jerry Garcia Band\n   3. &quot;Positively 4th Street&quot; -- Jerry Garcia Band\n   4. &quot;The Wicked Messenger&quot; -- Legion of Mary\n   5. &quot;Knockin' On Heaven's Door&quot; -- Jerry Garcia Band\n   6. &quot;Simple Twist Of Fate&quot; -- Jerry Garcia Band\n   7. &quot;I Shall Be Released&quot; -- Jerry Garcia Band \n\nDisc 2\n\n   1. &quot;When I Paint My Masterpiece&quot; -- Jerry Garcia Band\n   2. &quot;She Belongs To Me&quot; -- Grateful Dead\n   3. &quot;Forever Young&quot; -- Jerry Garcia Band\n   4. &quot;Tangled Up In Blue&quot; -- Jerry Garcia Band\n   5. &quot;Senor (Tales Of Yankee Power)&quot; -- Jerry Garcia Band\n   6. &quot;Visions of Johanna&quot; -- Grateful Dead\n   7. &quot;The Mighty Quinn (Quinn The Eskimo)&quot; -- Grateful Dead\n   8. &quot;It's All Over Now, Baby Blue&quot; -- Grateful Dead \n\n[URL=http://imageshack.us][IMG]http://img406.imageshack.us/img406/7494/bobjerry6pf.jpg[/IMG][/URL]\n\n\n\n\n","torrent":{"xt":"urn:btih:eee6ffb64e7801522f3774aa6b67fe7611bac548","amp;dn":"Jerry+Garcia+Plays+Dylan+%282+CD%29+2005%40256","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eee6ffb64e7801522f3774aa6b67fe7611bac548","infoHashBuffer":{"type":"Buffer","data":[238,230,255,182,78,120,1,82,47,55,116,170,107,103,254,118,17,186,197,72]},"announce":[],"urlList":[]}}