{"title":"Peter Garber -- Famous First Bubbles: The Fundamentals of Early","uid":5148141,"size":580924,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:efc290a434de5e1f810234944ae78df125ec933b&amp;dn=Peter+Garber+--+Famous+First+Bubbles%3A+The+Fundamentals+of+Early+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"profdreamer","files":1,"time":1257392073,"description":"Peter Garber -- Famous First Bubbles: The Fundamentals of Early Manias, PDF, 567 KB\n\nThe jargon of economics and finance contains numerous colorful terms for market-asset prices at odds with any reasonable economic explanation. Examples include &quot;bubble,&quot; &quot;tulipmania,&quot; &quot;chain letter,&quot; &quot;Ponzi scheme,&quot; &quot;panic,&quot; &quot;crash,&quot; &quot;herding,&quot; and &quot;irrational exuberance.&quot; Although such a term suggests that an event is inexplicably crowd-driven, what it really means, claims Peter Garber, is that we have grasped a near-empty explanation rather than expend the effort to understand the event. In this book Garber offers market-fundamental explanations for the three most famous bubbles: the Dutch Tulipmania (1634-1637), the Mississippi Bubble (1719-1720), and the closely connected South Sea Bubble (1720). He focuses most closely on the Tulipmania because it is the event that most modern observers view as clearly crazy. Comparing the pattern of price declines for initially rare eighteenth-century bulbs to that of seventeenth-century bulbs, he concludes that the extremely high prices for rare bulbs and their rapid decline reflects normal pricing behavior. In the cases of the Mississippi and South Sea Bubbles, he describes the asset markets and financial manipulations involved in these episodes and casts them as market fundamentals.","torrent":{"xt":"urn:btih:efc290a434de5e1f810234944ae78df125ec933b","amp;dn":"Peter+Garber+--+Famous+First+Bubbles%3A+The+Fundamentals+of+Early+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"efc290a434de5e1f810234944ae78df125ec933b","infoHashBuffer":{"type":"Buffer","data":[239,194,144,164,52,222,94,31,129,2,52,148,74,231,141,241,37,236,147,59]},"announce":[],"urlList":[]}}