{"title":"Rush - Closer To The Heart","uid":4475888,"size":181313540,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:efeec89d57e99136007081eedbfea87108880007&amp;dn=Rush+-+Closer+To+The+Heart&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"2nafish","files":-1,"time":1225337645,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Closer to the Heart&quot; is a single by Rush, released 1977, from the album A Farewell to Kings. It was the first Rush song to have an external co-writer, namely Peter Talbot, a friend of Neil Peart. Issued as a single for Christmas 1977, it was their first hit in the United Kingdom, reaching No.36 in the UK Singles Chart in February 1978, and sparked a dramatic change in the band&amp;#039;s fortunes outside of the United States. The B side is, unusually, larger than the A side, consisting of one track which is shorter than the others but two which exceed the length of &quot;Closer to the Heart&quot; by over a minute.\n\nIt is one of Rush&amp;#039;s most popular recordings, receiving a fair amount of radio airplay during a time when the band was in the middle of its &amp;#039;epic song&amp;#039; days. The song has also been part of the set list on nearly every tour since 1977. The band then dropped &quot;Closer To The Heart&quot; for the bulk of their Vapor Trails Tour and R30: 30th Anniversary Tour because, according to Peart, &quot;we got sick of it.&quot;\n\nOn their live albums A Show of Hands and Different Stages, Rush appended several minutes of jam type playing at the end of the performance of this song.\n\nOn the original track and live performances from October, 1977 to May 1983 and then again from November 1996 to January 2005, Peart played his acoustic drum kit but used a Simmons (then later DDrum) electronic drum kit in live performances of the track from June 1984 to May 1994.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:efeec89d57e99136007081eedbfea87108880007","amp;dn":"Rush+-+Closer+To+The+Heart","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"efeec89d57e99136007081eedbfea87108880007","infoHashBuffer":{"type":"Buffer","data":[239,238,200,157,87,233,145,54,0,112,129,238,219,254,168,113,8,136,0,7]},"announce":[],"urlList":[]}}