{"title":"The Invisible(2007)DVDRip.AC3(ENG)-DROCK","uid":6429932,"size":730972160,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f0b4dbc0c2caa5e48ce38c45c818f2dec9a36952&amp;dn=The+Invisible%282007%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"drock232","files":-1,"time":1306611468,"description":"A severely beaten teenager, trapped in a walking purgatory between life and death, must help authorities to the location of his broken body before it's too late in this remake of the 2002 Swedish thriller Den Osynlige. Graduating senior Nick Powell (Justin Chatwin) has plans to attend a prestigious writing workshop in London, despite the protests of his widowed mother (Marcia Gay Harden). In the days before his departure, he gets into a cafeteria brawl with a delinquent classmate, Annie Newton (Margarita Levieva), while defending his friend from her extortion attempts. Annie and her crew track Nick down on the night he's planning to leave, mistakenly thinking he ratted her out to the police regarding a smash-and-grab burglary committed the night before. When the subsequent beating goes too far, the assailants dump the body in the woods in a panicked attempt to dispose of it. Only, Nick isn't dead -- he's walking invisible among his classmates, friends, and family, desperately trying to alert them that he's still alive. Robbed of the traditional forms of communication, Nick must figure out supernatural methods of manipulating his environment -- and he soon realizes the very girl who attacked him may be the only one who has the power to save him.\n\nRipped with Autogk.\n\nLength: 1 Hour 42 Minutes\n\nFile Type: AVI","torrent":{"xt":"urn:btih:f0b4dbc0c2caa5e48ce38c45c818f2dec9a36952","amp;dn":"The+Invisible%282007%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f0b4dbc0c2caa5e48ce38c45c818f2dec9a36952","infoHashBuffer":{"type":"Buffer","data":[240,180,219,192,194,202,165,228,140,227,140,69,200,24,242,222,201,163,105,82]},"announce":[],"urlList":[]}}