{"title":"Night Nurse","uid":5078247,"size":41338932,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:f1a2430cabcb275328973d462eee0e0babfb0f0f&amp;dn=Night+Nurse&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"brodahisou","files":-1,"time":1252056912,"description":"Night Nurse was a Marvel Comics title that lasted four issues in late 1972 and early 1973. The series, which straddled several different genres, focused on the adventures of three female roommates who worked the night shift at the Metropolitan General Hospital in New York City: Linda Carter, Georgia Jenkins, and Christine Palmer.\n\nNight Nurse was introduced in one of a trio of Marvel Comics aimed at a female audience, alongside The Cat and Shanna the She-Devil. Marvel writer-editor Roy Thomas recalled in 2007 that editor-in-chief Stan Lee &quot;had the idea, and I think the names, for all three. He wanted to do some books that would have special appeal to girls. We were always looking for way to expand our franchise. My idea ... was to try to get women to write them&quot;.\n\nThe series was written by Jean Thomas, then the wife of comics writer and editor Roy Thomas, and drawn by Winslow Mortimer. The stories, unlike most of Marvel's offerings at the time, contain no superheroes or fantastic elements. However, the night nurses do encounter a fair amount of &quot;danger, drama and death&quot;, as the cover tag proclaims, as they work to foil bomb plots, malpracticing surgeons, and mob hitmen. Night Nurse, like the &quot;relevant comics&quot; of the early 1970s, also attempted to address real-world social issues.\n\n\nReleased on http://ComicPirates.info","torrent":{"xt":"urn:btih:f1a2430cabcb275328973d462eee0e0babfb0f0f","amp;dn":"Night+Nurse","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f1a2430cabcb275328973d462eee0e0babfb0f0f","infoHashBuffer":{"type":"Buffer","data":[241,162,67,12,171,203,39,83,40,151,61,70,46,238,14,11,171,251,15,15]},"announce":[],"urlList":[]}}