{"title":"Encyclopedia of Street Crime in America (gnv64)","uid":12826861,"size":32643828,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f364332304b0268db32cd7489ea531203b16039a&amp;dn=Encyclopedia+of+Street+Crime+in+America+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gnv65","files":5,"time":1448355357,"description":"Encyclopedia of Street Crime in America\r\nby Jeffrey Ian Ross\r\nSAGE Publications | March 2013 | ISBN-10: 141299957X | True PDF | 576 pages | 30.3 mb\r\n\r\nAnyone living or working in a city has feared or experienced street crime at one time or another; whether it be a mugging, purse snatching, or a more violent crime. In the U.S., street crime has recently hovered near historic lows; hence, the declaration of certain analysts that street life in America has never been safer. But is it really? Street crime has changed over past decades, especially with the advent of surveillance cameras in public places?the territory of the street criminal?but at the same time, criminals have found ways to adapt. This encyclopedic reference focuses primarily on urban lifestyle and its associated crimes, ranging from burglary to drug peddling to murder to new, more sophisticated forms of street crime and scams. This traditional A-to-Z reference has significant coverage of police and courts and other criminal justice sub-disciplines while also featuring thematic articles on the sociology of street crime.\r\n\r\nFeatures &amp; Benefits:\r\n- 175 signed entries within a single volume in print and electronic formats provide in-depth coverage to the topic of street crime in America.\r\n- Cross-References and Suggestions for Further Readings guide readers to additional resources.\r\n- Entries are supported by vivid photos and illustrations to better bring the material alive.\r\n- A thematic Reader's Guide groups related entries by broad topic areas and, within the electronic version, combines with Cross-References and a detailed Index for convenient search-and-browse capabilities.\r\n- A Chronology provides readers with a historical perspective of street crime in America.\r\n- Appendices provide sources of data and statistics, annotated to highlight their relevance\r\n\r\nAbout the Author\r\nJeffrey Ian Ross, Ph.D. is a Professor in the School of Criminal Justice, College of Public Affairs, and a Research Fellow of the Center for International and Comparative Law, and the Schaefer Center for Public Policy, at the University of Baltimore.\r\nHe has researched, written, and lectured primarily on corrections, policing, political crime, violence, abnormal-extreme criminal behavior, and crime and justice in American Indian communities for over two decades. Ross' work has appeared in many academic journals and books, as well as popular media. He is the author, co-author, editor, or co-editor of several books.\r\nRoss is a respected subject matter expert for local, regional, national and international news media. He has made live appearances on CNN, CNBC, MSNBC, and Fox News Network. Ross has written op-eds for THE (Baltimore) SUN, THE (Maryland) DAILY RECORD, THE GAZETTE (weekly community newspapers serving Maryland's Montgomery, Frederick, Prince Georges and Carroll counties), the BALTIMORE EXAMINER, the TAMPA TRIBUNE, and INSIDE HIGHER ED.\r\nFrom 1995-1998, Ross was a social science analyst with the National Institute of Justice, a division of the U.S. Department of Justice. In 2003, he was awarded the University of Baltimore's Distinguished Chair in Research Award. During the early 1980s Jeff worked almost four years in a correctional institution","torrent":{"xt":"urn:btih:f364332304b0268db32cd7489ea531203b16039a","amp;dn":"Encyclopedia+of+Street+Crime+in+America+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f364332304b0268db32cd7489ea531203b16039a","infoHashBuffer":{"type":"Buffer","data":[243,100,51,35,4,176,38,141,179,44,215,72,158,165,49,32,59,22,3,154]},"announce":[],"urlList":[]}}