{"title":"Web Security Testing Cookbook: Systematic Techniques to Find Pro","uid":4725482,"size":9138956,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f3e5a95e938207cdf796c93635613db85823d665&amp;dn=Web+Security+Testing+Cookbook%3A+Systematic+Techniques+to+Find+Pro&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"VasiaZozulia","files":1,"time":1234725909,"description":"Among the tests you perform on web applications, security testing is perhaps the most important, yet it's often the most neglected. The recipes in the Web Security Testing Cookbook demonstrate how developers and testers can check for the most common web security issues, while conducting unit tests, regression tests, or exploratory tests. Unlike ad hoc security assessments, these recipes are repeatable, concise, and systematic-perfect for integrating into your regular test suite. Recipes cover the basics from observing messages between clients and servers to multi-phase tests that script the login and execution of web application features. By the end of the book, you'll be able to build tests pinpointed at Ajax functions, as well as large multi-step tests for the usual suspects: cross-site scripting and injection attacks. This book helps you: Obtain, install, and configure useful-and free-security testing tools Understand how your application communicates with users, so you can better simulate attacks in your tests Choose from many different methods that simulate common attacks such as SQL injection, cross-site scripting, and manipulating hidden form fields Make your tests repeatable by using the scripts and examples in the recipes as starting points for automated tests\n\nDon't live in dread of the midnight phone call telling you that your site has been hacked. With Web Security Testing Cookbook and the free tools used in the book's examples, you can incorporate security coverage into your test suite, and sleep in peace. ","torrent":{"xt":"urn:btih:f3e5a95e938207cdf796c93635613db85823d665","amp;dn":"Web+Security+Testing+Cookbook%3A+Systematic+Techniques+to+Find+Pro","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f3e5a95e938207cdf796c93635613db85823d665","infoHashBuffer":{"type":"Buffer","data":[243,229,169,94,147,130,7,205,247,150,201,54,53,97,61,184,88,35,214,101]},"announce":[],"urlList":[]}}