{"title":"Rammstein - Feuer Frei (Soundtrack: xXx)  (2nafish)","uid":5427180,"size":131842052,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:f4f66a8073c38b02da34a3be5d4b76a7c14b5326&amp;dn=Rammstein+-+Feuer+Frei+%28Soundtrack%3A+xXx%29++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1268299020,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n\nNote: This video is a &quot;Movies &amp; Music&quot; video so it has 2 logos.\n\n\n\n&quot;Feuer frei!&quot; is a song by German rock band Rammstein. The song is released as the fifth single from their third album Mutter. The title is from the command to start shooting in German military language, can be compared to &quot;fire at will&quot;, or &quot;open fire&quot;.\n\nThe single charted in Germany, peaking at number 33, and in the UK at number 35.\n\nSome fans (especiallyviewers) of this song called it &quot;Bang Bang&quot;.\n\n&quot;Feuer frei!&quot; is one of the band's most known songs, and is credited as their most popular. The song is featured in the film xXx, it is also featured during the CSI episode &quot;Slaves of Las Vegas&quot;. The UK Feuer frei!! single was released in three parts (2 CD's, 1 DVD), in three different colours (Yellow-Green-Orange), each with different tracklistings.\n\nThe video for &quot;Feuer frei!&quot; was released in America on MTV, to promote the film xXx. The music video consisted of the band playing on a fiery stage, with several clips from the film. On xXx, Rammstein is featured playing the song in a club in Prague.\n\n&quot;Feuer Frei!&quot; debuted live in a concert exclusively for members of the fan area in April 2000, when it was called &quot;Punk&quot;. Its next performance wasn't until May 2001 (this version being the album one) and since then, it has been played in almost every Rammstein concert. During live performances of this song, Richard, Paul and Till and sometimes Ollie, wear masks with flamethrowers attached that shoot flames several feet into the air.\n\nMutter (German for &quot;mother&quot;) is the third album by German rock band Rammstein. It was released on 2 April 2001 through Motor Music.\n\nRammstein (German pronunciation: [Ã‹Ë†ÃŠâ‚¬amÃŠÆ’taÃ‰ÂªÃŒÂ¯n]) is a German industrial metal band from Berlin, formed in 1994. The band consists of members Till Lindemann (lead vocals), Richard Z. Kruspe (lead guitar and backing vocals), Paul H. Landers (rhythm guitar, backing vocals), Oliver &quot;Ollie&quot; Riedel (bass guitar), Christoph &quot;Doom&quot; Schneider (drums and electronic percussion) and Christian &quot;Flake&quot; Lorenz (keyboards). They are widely accepted as part of the Neue Deutsche HÃƒÂ¤rte scene, alongside bands such as Oomph!, Eisbrecher, and Die Krupps. Their sound has been dubbed as Tanz-Metal (lit. &quot;dance metal&quot;).\n\nTheir songs are usually in German, but they have also performed songs entirely or partially in other languages such as English, Spanish, French and Russian. As of 2009, they have sold over 15 million records worldwide. Rammstein's entire catalogue is published by Universal Music Group. Since their formation in 1994, Rammstein has had no changes in their band line-up nor have any members left the band.\n\nRammstein takes their name indirectly from the German town of Ramstein-Miesenbach, the site of the flight show disaster on 28 August 1988. The band's signature song, &quot;Rammstein&quot;, is a commemoration of the disaster. In a short period before the band became well known, they performed using the name &quot;Rammstein-Flugschau&quot; (literally meaning &quot;Rammstein-Airshow&quot;).\n\nAlthough the majority of their songs are written in German, Rammstein has had success across the world. It was confirmed in 2007 that the band had re-united from their vacation and had begun working on their sixth studio album, Liebe ist fÃƒÂ¼r alle da, which was released on 16 October 2009 in Europe.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:f4f66a8073c38b02da34a3be5d4b76a7c14b5326","amp;dn":"Rammstein+-+Feuer+Frei+%28Soundtrack%3A+xXx%29++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f4f66a8073c38b02da34a3be5d4b76a7c14b5326","infoHashBuffer":{"type":"Buffer","data":[244,246,106,128,115,195,139,2,218,52,163,190,93,75,118,167,193,75,83,38]},"announce":[],"urlList":[]}}