{"title":"Bang Goes The Theory Series 3 and 4 02of14 Series 3 Part 2 DVDRi","uid":9917159,"size":346396676,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:f58ac5fe4ee85bed2496d274eeee39a8a4f51f26&amp;dn=Bang+Goes+The+Theory+Series+3+and+4+02of14+Series+3+Part+2+DVDRi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MVGroup","files":-1,"time":1396955003,"description":"Bang Goes the Theory: Series 3 and 4\n\nScience Documentary hosted by Liz Bonnin and Dallas Campbell and Jem Stansfield and Yan Wong, published by BBC in 2011 - English narration\n\n\nInformation\n------------------------------\n\nBang Goes the Theory: Series 3 and 4\nPutting Science To The Test. The popular science magazine show Bang Goes the Theory is back, putting more science and technology to the test. Follow the team as they investigate the recent Gulf of Mexico oil disaster, Zoologist Liz Bonnin goes to Louisiana and takes part in the rescue effort to protect the area s wildlife, while Jem Stansfield builds a scale model to explain what happens when an oil well gets out of control and how to bring it back under control. Meanwhile, Dallas Campbell proves Einstein s theory of relativity with the help of a jet plane and a very expensive atomic clock. Series three also see the team investigate whether wave power might be the answer to the energy crisis, trace how our eyes evolved, discover whether probability can be made to work in our favour in Vegas and look at the impact of an oil spill. In the fourth series of Bang Goes the Theory the team cover everything from biology to what s out there in the universe as they uncover why the world around us works as it does. The popular science programme returns for two more series of investigations into the world around us.\n\n\n1)  Series 3 Part 1 \nIn this episode, the team investigate the recent Gulf of Mexico oil disaster. Zoologist Liz Bonnin travels to Louisiana and takes part in the rescue effort to protect the area's wildlife, while Jem Stansfield builds a scale model to explain what happens when an oil well gets out of control, and how to solve the problem. Meanwhile, Dallas Campbell proves Einstein's theory of relativity with the help of a jet plane and a very expensive atomic clock.\n\n2)  Series 3 Part 2 \nLiz Bonnin looks at the science behind sunburn, and discovers how much sun damage she has on her face. Dallas Campbell tries to make museum visitors younger and smarter in a series of psychological experiments. And Jem Stansfield proves that wheels don't have to be round by building a square-wheeled skateboard.\n\n3)  Series 3 Part 3 \nIn the third episode of the series that puts science and technology to the test, the team face more fun experiments and challenges. Liz conducts an experiment into jetlag and how to avoid it, while Dallas demonstrates the size of the solar system with the help of a bicycle and a fruit bowl. And Jem upgrades his square-wheeled skateboard to a motorbike, before trying to jump it into the record books.\n\n4)  Series 3 Part 4 \nThe team puts more science to the test. Dallas looks at the origins of our weather and explains how the emergence of seasons allowed life to form, all with the help of a grenade launcher. Jem travels to Scotland to check out the latest green technology - wave power. And Liz meets Richard Dawkins to prove evolution.\n\n5)  Series 3 Part 5 \nIn the latest episode, Bang goes the Theory puts science to the test. Liz visits the volcano that brought Britain to a standstill, and examines its aftermath and the likelihood of a re-occurrence. Dallas blows the budget in Vegas to explain why people are so bad at predicting probabilities. Jem borrows a solar furnace in France to demonstrate the awesome power of the sun.\n\n6)  Series 3 Part 6 \nJem faces his toughest challenge yet: to build a boat made out of ice, and take it and the rest of the team for a spin in one of the UK's busiest stretches of water. Dallas investigates the world of comets and tries to build his own, while Liz looks at the science behind hypothermia and gets repeatedly dunked into ice-cold water in preparation for the ice boat extravaganza.\n\n7)  Series 4 Part 1 \nIn the first of series 4, Bang Goes the Theory looks at the science behind the recent devastating Japanese earthquake and the tsunami it triggered. The programme explains what happened and examines the technology that attempts to protect us from the shocking power of our planet.\n\n8)  Series 4 Part 2 \nIn the second episode of the series, Liz follows two couples undertaking IVF and looks at the new research that may dramatically increase success rates. Jem attempts to become the first man to go 360 degrees on a playground swing. And Dr Yan confuses shoppers with the help of a very special mirror.\n\n9)  Series 4 Part 3 \nIn the latest episode of the series, the team take on more scientific challenges. Dallas goes supersonic and meets the team behind a 1000mph car. Jem looks at what makes stuff sticky and makes homemade glues to test out on the other presenters and Dr Yan puzzles commuters with an optical illusion.\n\n10)  Series 4 Part 4 \nIn the latest episode of the series that reveals your world with a bang, Jem demonstrates what a calorie is by making the team take part in the Oxford and Cambridge Boat Race. Dr Yan goes to the Houses of Parliament to meet MPs and test their ability to calculate risk. And Liz investigates whether we are running out of antibiotics and what will happen if we do. Bang also launches the Big Risk Test - take part in what aims to be the biggest ever study of the science of risk.\n\n11)  Series 4 Part 5 \nOn the 50th anniversary of the invention of the laser, Jem Stansfield explains how they work and builds himself a homemade one. Dallas Campbell looks at the rise of Citizen Science and takes part in the research projects that need people power. And Dr Yan recreates a demonstration to calculate the speed of light.\n\n12)  Series 4 Part 6 \nIn the latest episode of the science series, Liz looks at the controversial science of genetically modified crops in Hawaii. Dallas tries to remedy Jem's dust allergy by making him eat worms. And Dr Yan tries to shatter a glass by playing the violin.\n\n13)  Series 4 Part 7 \nThis episode of the series that reveals your world with a bang has a royal wedding theme. Jem builds a singing road as a present for the royal couple. Dr Yan explains the science of dad dancing. And Liz uses DNA to track her family tree right back to the earliest humans.\n\n14)  Series 4 Part 8 \nJem visits a mega-plant in Sussex to investigate the future of recycling. Dallas explains how GPS works and how it is changing our world, and Dr Yan uses science to crack the classic magic trick in which a table cloth is whipped from under a dinner service.\n\nScreenshots\n------------------------------ &lt;a href=&quot;\nhttp://img571.imageshack.us/img571/6598/llj9.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img571.imageshack.us/img571/6598/llj9.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img203.imageshack.us/img203/4756/hfse.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img203.imageshack.us/img203/4756/hfse.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img541.imageshack.us/img541/4860/ehya.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img541.imageshack.us/img541/4860/ehya.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img513.imageshack.us/img513/8184/baaf.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img513.imageshack.us/img513/8184/baaf.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img845.imageshack.us/img845/4285/qu4v.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img845.imageshack.us/img845/4285/qu4v.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img203.imageshack.us/img203/9558/36yc.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img203.imageshack.us/img203/9558/36yc.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img822.imageshack.us/img822/6236/whlc.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img822.imageshack.us/img822/6236/whlc.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img822.imageshack.us/img822/270/y54i.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img822.imageshack.us/img822/270/y54i.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img580.imageshack.us/img580/6906/q34i.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img580.imageshack.us/img580/6906/q34i.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img703.imageshack.us/img703/7820/j7ae.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img703.imageshack.us/img703/7820/j7ae.jpg&lt;/a&gt; \n\nTechnical Specs\n------------------------------\n\n\n * Video: Codec: x264 CABAC &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;e5a8848c8ba5a9d6cbd5&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n * Video: Bitrate: 1517 Kbps\n * Video: Aspect Ratio: 1.778 (16:9)\n * Video: Resolution: 832 x 468\n * Audio: Codec: AAC LC\n * Audio: Bitrate: 128 Kbps VBR 48KHz\n * Audio: Channels: stereo (2/0)\n * Audio: English\n * Run-Time: 30mins\n * Framerate: 25fps\n * Number of Parts: 14\n * Part Size: average 324 MB\n * Container: Mp4\n * Source: DVD\n * Encoded by: Harry65\n\nRelease Notes\nMerged Subtitles\n\nLinks\n------------------------------\n\n1)  Further Information &lt;a href=&quot;\nhttp://www.bbc.co.uk/programmes/b00lwxj1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.bbc.co.uk/programmes/b00lwxj1&lt;/a&gt;\n\n2)  Related Documentaries &lt;a href=&quot;\nhttp://docuwiki.net/?title=Bang%20Goes%20the%20Theory%3A%20Series%201&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=Bang%20Goes%20the%20Theory%3A%20Series%201&lt;/a&gt; &lt;a href=&quot;\nhttp://docuwiki.net/?title=Bang%20Goes%20The%20Theory%3A%20Series%202&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=Bang%20Goes%20The%20Theory%3A%20Series%202&lt;/a&gt;\n\n\n","torrent":{"xt":"urn:btih:f58ac5fe4ee85bed2496d274eeee39a8a4f51f26","amp;dn":"Bang+Goes+The+Theory+Series+3+and+4+02of14+Series+3+Part+2+DVDRi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f58ac5fe4ee85bed2496d274eeee39a8a4f51f26","infoHashBuffer":{"type":"Buffer","data":[245,138,197,254,78,232,91,237,36,150,210,116,238,238,57,168,164,245,31,38]},"announce":[],"urlList":[]}}