{"title":"Highway 61 Revisited: The Tangled Roots of American Jazz, Blues,","uid":8309999,"size":2129964,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f5f923f5afe16174c6fa91361b2df6f2a1479b75&amp;dn=Highway+61+Revisited%3A+The+Tangled+Roots+of+American+Jazz%2C+Blues%2C&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"tmPhoneix","files":1,"time":1364458627,"description":"Book Description\nPublication Date: May 20, 2004 | ISBN-10: 0195154819 | ISBN-13: 978-0195154818 | Edition: First Edition\nWhat do Louis Armstrong, Ray Charles, Bob Dylan, Willie Nelson, Tom Waits, Cassandra Wilson, and Ani DiFranco have in common? In Highway 61 Revisited, acclaimed music critic Gene Santoro says the answer is jazz--not just the musical style, but jazz's distinctive ambiance and attitudes. \nAs legendary bebop rebel Charlie Parker once put it, &quot;If you don't live it, it won't come out of your horn.&quot; Unwinding that Zen-like statement, Santoro traces how jazz's existential art has infused outstanding musicians in nearly every wing of American popular music--blues, folk, gospel, psychedelic rock, country, bluegrass, soul, funk, hiphop--with its parallel process of self-discovery and artistic creation through musical improvisation. Taking less-traveled paths through the last century of American pop, Highway 61 Revisited maps unexpected musical and cultural links between such apparently disparate figures as Louis Armstrong, Willie Nelson, Bob Dylan and Herbie Hancock; Miles Davis, Lenny Bruce, The Grateful Dead, Bruce Springsteen, and many others. Focusing on jazz's power to connect, Santoro shows how the jazz milieu created a fertile space &quot;where whites and blacks could meet in America on something like equal grounds,&quot; and indeed where art and entertainment, politics and poetry, mainstream culture and its subversive offshoots were drawn together in a heady mix whose influence has proved both far-reaching and seemingly inexhaustible. \nCombining interviews and original research, and marked throughout by Santoro's wide ranging grasp of cultural history, Highway 61 Revisited offers readers a new look at--and a new way of listening to--the many ways jazz has colored the entire range of American popular music in all its dazzling profusion.","torrent":{"xt":"urn:btih:f5f923f5afe16174c6fa91361b2df6f2a1479b75","amp;dn":"Highway+61+Revisited%3A+The+Tangled+Roots+of+American+Jazz%2C+Blues%2C","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f5f923f5afe16174c6fa91361b2df6f2a1479b75","infoHashBuffer":{"type":"Buffer","data":[245,249,35,245,175,225,97,116,198,250,145,54,27,45,246,242,161,71,155,117]},"announce":[],"urlList":[]}}