{"title":"Theme Park Mysteries by Tina Anne","uid":12741101,"size":496647,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f60a95711b8bf0699c78a5b7818c9b27947456e9&amp;dn=Theme+Park+Mysteries+by+Tina+Anne&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ZamKhan","files":2,"time":1447235788,"description":"Theme Park Mysteries: The Beginning\r\nTheme parks are supposed to be fun. They are not supposed to be a site for murder. \r\n\r\nNewly single Misty Summer has spent most of her adult life caring for her husband Frank and their two children Frank, Jr. and Angela. Now, however the kids are gone and Frank is busy with his job as the small town’s Chief of Police. Misty, however, has no goals no career. With her genius son in tow as self appointed protector and truck driver she decides she is going to do what she has always wanted to do. Move somewhere warm with no particular goal but Orlando, Florida. \r\n\r\nWhen they arrive in Florida they come across a theme park named Adventure Planet. The park is in such desperate need of repair that it’s falling apart. It’s in a town in northern Florida they had never heard of and neither had many other people. Fate has dictated that Misty and Frankie become the new owners of the park. They shut it down for a time so they can renovate it and return it to its former glory. \r\n\r\nThe renovation and revamping of the park brings ex-husband Frank down to assist. Misty has no hard feelings toward him, but is not happy to have his help. In addition, he brought with him his new girlfriend. She and Misty were friends, but could they still be now? \r\n\r\nIn the process of renovating the park, Misty finds the body of the estranged wife of the former owner of the park buried on the grounds. That’s when Misty meets police Chief Marlowe Campion. The man is rude and arrogant. Misty can’t stand him. In addition, one of the first things he does is arrest the man Misty and Frankie want to make the chief engineer for Adventure Planet. Misty is certain that he is innocent and that Marlowe has no clue what he is doing. \r\n\r\nMother and son decide to investigate the murder on their own. They immerse themselves with the locals to learn all they can about the victim and solve her murder before it ruins their park and makes them bankrupt. \r\n\r\nMisty must deal with Frank and the adjustment to their new relationship, renovating Adventure Planet, and a police chief who doesn’t seem to like her. All while trying to solve a murder and save the reputation of her park. Something her son Frankie has complete faith in her to do. Does she have enough faith in herself? How will she bring the killer to justice and ensure her park opens on time? Or will the killer get her first?\r\n\r\nAway in a Murder: A Theme Park Mysteries Book\r\nMisty Summer is very satisfied with her life. The theme park she and her son Frankie bought and renovated has been open for several months now. She has bought and moved in to her new home. The other building is undergoing renovations for its change in to a hotel. Her romance with Chief of Police Marlowe Campion was going slow, just how she wanted it to. And nobody’s been murdered lately. \r\nAs December approaches the park readies for its family friendly Christmas celebration. In addition, there is a reporter coming to interview her for a national news program. This was great. The park was getting to be known in more than just their general area. \r\nThe only problem as she saw it was that she was a bundle of nerves. She has not been in front of a camera for over 20 years. She wasn’t sure how she was going to do. But with her son Frankie by her side, she could do anything. They were a great team. \r\nThe reporter who comes to interview Misty is from a sensational tabloid show. His specialty is reducing people to tears. During the interview the reporter starts to ask Misty some strange questions. He tries to get her to admit to wrong doing. In fact, he even accuses her doing something so disgusting that under different circumstances it would be illegal. Misty cuts off the interview and sends him packing. \r\nWhen the interview airs. Misty is embarrassed and outraged by it. She asks the reporter to come back down so she can talk to him. This time she records the interview as he admits that she never said what she did. \r\nThe next day she is out on her first date with Marlowe. The date is interrupted by the discovery of the reporter’s dead body. Misty and Frankie are both suspects in the killing. They know they didn’t do it. But proving it is a whole other issue. They must investigate and find the real killer before they are arrested for it. Or before one of them becomes the next victim","torrent":{"xt":"urn:btih:f60a95711b8bf0699c78a5b7818c9b27947456e9","amp;dn":"Theme+Park+Mysteries+by+Tina+Anne","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f60a95711b8bf0699c78a5b7818c9b27947456e9","infoHashBuffer":{"type":"Buffer","data":[246,10,149,113,27,139,240,105,156,120,165,183,129,140,155,39,148,116,86,233]},"announce":[],"urlList":[]}}