{"title":"Tiger Force: A True Story of Men and War","uid":9831917,"size":944943,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f705da43b6ae7d42c59454f2c980bfacfc37f064&amp;dn=Tiger+Force%3A+A+True+Story+of+Men+and+War&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"JinRohEX","files":-1,"time":1395854230,"description":"Tiger Force: A True Story of Men and War\nby Michael Sallah, Mitch Weiss\n\nDESCRIPTION:\n\nAt the outset of the Vietnam War, the Army created an experimental fighting unit that became known as &quot;Tiger Force.&quot; The Tigers were to be made up of the cream of the crop-the very best and bravest soldiers the American military could offer. They would be given a long leash, allowed to operate in the field with less supervision. Their mission was to seek out enemy compounds and hiding places so that bombing runs could be accurately targeted. They were to go where no troops had gone, to become one with the jungle, to leave themselves behind and get deep inside the enemy's mind.The experiment went terribly wrong.What happened during the seven months Tiger Force descended into the abyss is the stuff of nightmares. Their crimes were uncountable, their madness beyond imagination-so much so that for almost four decades, the story of Tiger Force was covered up under orders that stretched all the way to the White House. Records were scrubbed, documents were destroyed, men were told to say nothing.But one person didn't follow orders. The product of years of investigative reporting, interviews around the world, and the discovery of an astonishing array of classified information, Tiger Force is a masterpiece of journalism. Winners of the Pulitzer Prize for their Tiger Force reporting, Michael Sallah and Mitch Weiss have uncovered the last great secret of the Vietnam War.","torrent":{"xt":"urn:btih:f705da43b6ae7d42c59454f2c980bfacfc37f064","amp;dn":"Tiger+Force%3A+A+True+Story+of+Men+and+War","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f705da43b6ae7d42c59454f2c980bfacfc37f064","infoHashBuffer":{"type":"Buffer","data":[247,5,218,67,182,174,125,66,197,148,84,242,201,128,191,172,252,55,240,100]},"announce":[],"urlList":[]}}