{"title":"VA - Dubstep EPs Vol. 01 by Geloso (2013)","uid":8382447,"size":1141518674,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f71cefe66227a1b990d673ee57cafc9cfe3c5f31&amp;dn=VA+-+Dubstep+EPs+Vol.+01+by+Geloso+%282013%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"geloso","files":100,"time":1366210844,"description":"Compilation of EPs of 2013 grouped in one torrent, for your enjoyment.\n\nNÂº. Artist -EP Title- Track Title (Genre) Label\n\n01. MineSweepa -No Mans Land EP- No Mans Land (Original Mix) 2012 (Dubstep) Ultragore Recordings(UGR039)\n02. MineSweepa -No Mans Land EP- Gimme Five (Original Mix) 2012 (Dubstep) Ultragore Recordings(UGR039)\n03. Basscatz, d$pot -Glimpse Of The Future- Glimpse of the Future (Deep Dubstep) Platform Music\n04. d$pot -Glimpse Of The Future- The Project (Deep Dubstep) Platform Music\n05. RealTalk -Twerk It- Twerk It (Original Mix) 2012 (Dubstep) Ultragore Recordings\n06. RealTalk -Twerk It- Twerk It (Rekoil Remix) 2012 (Dubstep) Ultragore Recordings\n07. RealTalk -Twerk It- Twerk It (Symbiotic Remix) 2012 (Dubstep) Ultragore Recordings\n08. Beauty Brain feat MC Mood -Generator EP- Generator (Original Mix) (Dubstep) Ultragore Recordings\n09. Beauty Brain -Generator EP- Everyday (Original Mix) (Dubstep) Ultragore Recordings\n10. Beauty Brain feat Greenpiece -Generator EP- Animals War (Original Mix) (Dubstep) Ultragore Recordings\n11. Sketi -A Whole Lot of Bass EP- This is My Theme (Original Mix) (Bass) Ruff N Fresh\n12. Sketi -A Whole Lot of Bass EP- One for Josey (Original Mix) (Bass) Ruff N Fresh\n13. Sketi -A Whole Lot of Bass EP- Let that Beat Drop Now (Original Mix) (Bass) Ruff N Fresh\n14. Sketi -A Whole Lot of Bass EP- Move Your Body (Original Mix) (Bass)  Ruff N Fresh\n15. Sketi -A Whole Lot of Bass EP- Burn Dem Wit Fire (Original Mix) (Bass) Ruff N Fresh\n16. Boot -The Rift EP- The Rift (Deep Dubstep) Requiem Audio\n17. Boot -The Rift EP- Blood Moon (Deep Dubstep) Requiem Audio\n18. Boot -The Rift EP- Beyond the Heliosphere (Deep Dubstep) Requiem Audio\n19. Boot -The Rift EP- Vision Quest (Deep Dubstep) Requiem Audio\n20. Der Xer -Mordsmusik- Bunte Steine Feat. Olli Banjo (Drum &amp; Bass) Naidoo records\n21. Chelydra -Omega!!- Ixion (Original Mix) (Dubstep) Acida Records\n22. Chelydra -Omega!!- Vulpecula (Original Mix) (Dubstep) Acida Records\n23. Current Value -TSM 002- Burn In (Drum &amp; Bass) The Sect Music\n24. The Sect -TSM 002- Glitch (Drum &amp; Bass) The Sect Music\n25. Dean Rodell -TSM 002- Thought Machines (Drum &amp; Bass) The Sect Music\n26. Dean Rodell -TSM 002- Modules (digital exclusive) (Drum &amp; Bass) The Sect Music\n27. Dominik Vogel -Question Authority EP- Question Authority (Dubstep/Grime) Rotraum Bold (BOLD003)\n28. Dominik Vogel -Question Authority EP- No Difference (Dubstep/Grime) Rotraum Bold (BOLD003)\n29. Dominik Vogel -Question Authority EP- Mammut (Dubstep/Grime) Rotraum Bold (BOLD003)\n30. Flosstradamus &amp; DJ Sliink -Nomads- CROWD CTRL (Trap) Fool's Gold Records\n31. Flosstradamus &amp; DJ Sliink -Nomads- Test Me (Trap) Fool's Gold Records\n32. Flosstradamus &amp; DJ Sliink -Nomads- Test Me (UZ Remix) (Trap) Fool's Gold Records\n33. Futurizm -Got To Be / Last Forever- Got To Be Feat. Jake Page (Original Mix) (Dubstep) Heavy Artillery Recordings\n34. Futurizm -Got To Be / Last Forever- Last Forever (Original Mix) (Dubstep) Heavy Artillery Recordings\n35. Hanns -The X- The X (Bass) Southside Dubstar (SDUK004)\n36. Hanns -The X- Eaten Alive (Bass) Southside Dubstar (SDUK004)\n37. Hanns -The X- She Said (Bass) Southside Dubstar (SDUK004)\n38. Harbinger -Cassiopeia- Mantis (Drum &amp; Bass) Rockforce (ROCK 080)\n39. Harbinger -Cassiopeia- The Prophecy (Dubstep) Rockforce (ROCK 080)\n40. Harbinger -Cassiopeia- Tartaros (Dubstep) Rockforce (ROCK 080)\n41. Harbinger -Cassiopeia- Super Hero Riot (Dubstep) Rockforce (ROCK 080)\n42. Au5 &amp; I.Y.F.F.E -Flower Of Life / First Blood- Flower of Life (Original Mix) (Dubstep) Anemnesis\n43. Helicopter Showdown &amp; Au5 &amp; I.Y.F.F.E -Flower Of Life / First Blood- First Blood (Original Mix) (Dubstep) Anemnesis\n44. Killawatt -Press On- Press On (Deep Dubstep) Osiris Music UK\n45. Killawatt -Press On- Tantra (Deep Dubstep) Osiris Music UK\n46. Konvex -Konvex- Orpheus Death (Deep Dubstep) Redshift One\n47. Konvex -Konvex- Yurei (Deep Dubstep) Redshift One\n48. Kryptic Minds -Namaste EP- Nebula (Dubstep) Osiris Music UK\n49. Kryptic Minds -Namaste EP- To Feel (Dubstep) Osiris Music UK\n50. Kryptic Minds -Namaste EP- Badman VIP (Dubstep) Osiris Music UK\n51. Kryptic Minds -Namaste EP- Namaste (Dubstep) Osiris Music UK\n52. Matta -Foundry- Hive (Original Mix) (Dubstep) Chateau Bruyant Records\n53. Matta -Foundry- Foundry (Original Mix) (Dubstep) Chateau Bruyant Records\n54. Melleefresh Vs Deadmau5 -Sex Slave-(PD5137) [DANK (USA) Mix] (Bass)\n55. Submerse -Algorithms &amp; Ghosts- Truth (Deep Dubstep) Project Mooncircle\n56. Submerse -Algorithms &amp; Ghosts- Algorithms And Ghosts (Deep Dubstep) Project Mooncircle\n57. Submerse -Algorithms &amp; Ghosts- This Combo Could End Us (Deep Dubstep) Project Mooncircle\n58. Submerse -Algorithms &amp; Ghosts- Here's Looking At You (Deep Dubstep) Project Mooncircle\n59. Submerse -Algorithms &amp; Ghosts- Dim Lights And Meteorites (feat. Sorrow) (Deep Dubstep) Project Mooncircle\n60. Submerse -Algorithms &amp; Ghosts- Monochrome (Deep Dubstep) Project Mooncircle\n61. Submerse -Algorithms &amp; Ghosts- Blips In December (Deep Dubstep) Project Mooncircle\n62. Slynger -Perdition- Perdition (Original Mix) (Dubstep) Abducted Records\n63. Slynger -Perdition- Exiled (Original Mix) (Dubstep)Abducted Records\n64. Slynger -Perdition- Demonoid (Original Mix) (Dubstep) Abducted Records\n65. Slynger -Perdition- Hollow (Original Mix) (Dubstep) Abducted Records\n66. Mystral -Afterglow- Surface Drop (Dubstep) Merkaba Music\n67. Mystral -Afterglow- Open Source (Dubstep) Merkaba Music\n68. Mystral -Afterglow- Afterglow (Dubstep) Merkaba Music\n69. Mystral -Afterglow- Stardust (Dubstep) Merkaba Music\n70. Mystral -Afterglow- Renegade (Dubstep) Merkaba Music\n71. Kahn -Kahn EP- Prophet (feat Rider Shafique) (Deep Dubstep) Black Box\n72. Kahn -Kahn EP- Badman City (feat Flowdan) (Deep Dubstep) Black Box\n73. Kahn -Kahn EP- Snake Eyes (feat Jabu) (Deep Dubstep) Black Box\n74. Kahn -Kahn EP- Cover Me (Deep Dubstep) Black Box\n75. Kahn -Kahn EP- No More (Deep Dubstep) Black Box\n\nUpload cost much, thank costs nothing.\n","torrent":{"xt":"urn:btih:f71cefe66227a1b990d673ee57cafc9cfe3c5f31","amp;dn":"VA+-+Dubstep+EPs+Vol.+01+by+Geloso+%282013%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f71cefe66227a1b990d673ee57cafc9cfe3c5f31","infoHashBuffer":{"type":"Buffer","data":[247,28,239,230,98,39,161,185,144,214,115,238,87,202,252,156,254,60,95,49]},"announce":[],"urlList":[]}}