{"title":"[PS4]Madden_NFL_25[1911]","uid":8772590,"size":3005927,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:f80f17aad90b0db32f607278d554c018fc001e9d&amp;dn=%5BPS4%5DMadden_NFL_25%5B1911%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dragospetrache","files":3,"time":1375488202,"description":"  Madden NFL 25 is the latest edition of EA's long-running football simulation franchise. The title &quot;Madden NFL 25&quot; is a nod to the twenty-fifth anniversary of the series. Past entries were typically titled with the year of the current season's playoffs and Super Bowl. (i.e., Madden NFL 25 would have otherwise been known as Madden NFL 14.)\n  For the second year in a row, ESPN's show SportsNation teamed up with EA Sports to host a poll in which fans would eventually select the cover athlete from a field of 64. This year, however, one bracket was current players, referred to as &quot;new school,&quot; and one bracket was legends, referred to as &quot;old school.&quot; The winners of each bracket were Adrian Peterson, current running back for the Minnesota Vikings, and Barry Sanders, a Hall of Fame running back formerly of the Detroit Lions. Barry Sanders was announced as the winner, winning 58% of votes.\n  Madden NFL 25 is a promise to gamers who stuck with the series and begged for more gameplay options and features.\n  &quot;There's that wow factor when you pick up the controller,&quot; said Electronic Arts Football General Manager Cam Weber. &quot;It feels amazing.&quot;\n  A celebration of 25 years of the franchise, EA Sports spent significant time developing a next generation football game they felt would change the genre. The IGNITE gameplay engine will have approximately 300 &quot;live&quot; characters on both sidelines, reacting to the action, as well as a crowd that looks more &quot;real&quot; than the cardboard cut-outs and static virtual fans gamers have become accustomed to seeing over the years.\n  The new True Step Locomotion system also promises a better rushing game. Madden 2013 focused heavily on passing and True Step, combined with the enhanced A.I. offensive linemen, as well as defensive players. The end result, Weber says, is a more authentic and instinctual game of football, with authentic route running, more realistic downfield blocking, and better moving player models.","torrent":{"xt":"urn:btih:f80f17aad90b0db32f607278d554c018fc001e9d","amp;dn":"%5BPS4%5DMadden_NFL_25%5B1911%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f80f17aad90b0db32f607278d554c018fc001e9d","infoHashBuffer":{"type":"Buffer","data":[248,15,23,170,217,11,13,179,47,96,114,120,213,84,192,24,252,0,30,157]},"announce":[],"urlList":[]}}