{"title":"Aircraft Carriers of the United States Navy (2015).pdf Gooner","uid":12274667,"size":29780291,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fb526ff6e26674e90e39cd0566412dd6947d75bc&amp;dn=Aircraft+Carriers+of+the+United+States+Navy+%282015%29.pdf+Gooner&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1440337495,"description":"Publisher: Pen and Sword (August 28, 2015)\nLanguage: English\nISBN-10: 1783376104\nISBN-13: 978-1783376100\n\nIn 1922 the US Navy commissioned its first small experimental aircraft carrier. This was followed into service by two much larger and capable carriers in 1927 with five more being built prior to the Japanese attack on Pearl Harbor including three large Yorktown class. To take the offensive against the Japanese Navy, the American Congress funded by far the largest carrier building program in history based on the Essex class, a larger version of the pre-war Yorktown vessels. Of the twenty-six ordered, fourteen were commissioned in time to see Second World War service. These were joined by many smaller classes of carriers, including light carriers and escort carriers. Post-war ever larger and more capable carriers were commissioned. Since 1975, when the first of a fleet of ten nuclear-powered Nimitz class carriers was commissioned, they have epitomized United States superpower status and worldwide power projection. These are due to be replaced in the decades to come with the even more sophisticated nuclear-powered Gerald R. Ford class. Compiled and written by Michael Green, Aircraft Carriers of the United States Navy contains superb images of all the different types of classes of carriers employed by the US Navy since 1922. These and its highly informative text and captions give the reader a broad overview of this fascinating subject","torrent":{"xt":"urn:btih:fb526ff6e26674e90e39cd0566412dd6947d75bc","amp;dn":"Aircraft+Carriers+of+the+United+States+Navy+%282015%29.pdf+Gooner","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb526ff6e26674e90e39cd0566412dd6947d75bc","infoHashBuffer":{"type":"Buffer","data":[251,82,111,246,226,102,116,233,14,57,205,5,102,65,45,214,148,125,117,188]},"announce":[],"urlList":[]}}