{"title":"Afterfall Reconquest EP1 Cracked-3DM Early Access","uid":10627818,"size":867973533,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:fc3f94cb93fd588db98d1a98a37a86f8eec8ee63&amp;dn=Afterfall+Reconquest+EP1+Cracked-3DM+Early+Access&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Nimbleton","files":1,"time":1406258199,"description":"Afterfall Reconquest EP1 Cracked-3DM Early Access\n\nExtract 7zip file &amp; play!\n\n\nAbout the Game\nYou're stepping into a world after the outbreak of war. A war in which nuclear warheads weren't the ultimate means of destruction, rather a stage in a self-made apocalypse. A new weapon was used. Nobody heard about the Entropy charges before the Day Zero and a few remained to tell the story after.\n\nOnly two groups of people managed to survive the apocalyptic conflict. The first consisted of the lucky ones who found shelter in one of the 'sanctuary cities' hidden deep in the mountains. Their luck, however, was the first resource to run out. Soon it became obvious that these havens weren't self-sufficient. After a few years the resources started to deplete and when they finally ran dry, worn out and embittered survivors once again were forced to find a new place to call home.\n\nToday, former inhabitants of the sanctuary cities descended into the valleys in search of fertile soil, clean water and resources to process into fuel and tools. Thus begins the RECONQUEST - slow and ardous process of taking the land back from mutants and wildlife and rebuilding the lost cities and civilization.\n\nAs for the second group... their fate remains a mystery.\n\n\nYOUR MISSION\n\nYou're one of the surviving members of the Corvin family. Your task is to find out what caused the annihilation of your family and execute vengeance upon the guilty.\n\nEvery night you're haunted by nightmares. They're somehow connected to the childhood. The problem is that you're not really sure whether it is your childhood that you're dreaming about. The path you've taken is not an easy one. Along the way you'll come to realize that there are powers at work in this barren world that don't want you to know the truth.\n\nDespite your neutrality, more than once you'll find yourself entangled in intrigues. You will reveal many mysteries of the post-apocalyptic world. Maybe you'll even discover the secrets of mythical 'Pearl of Wastelands', the image of which looms large in everyone's mind.","torrent":{"xt":"urn:btih:fc3f94cb93fd588db98d1a98a37a86f8eec8ee63","amp;dn":"Afterfall+Reconquest+EP1+Cracked-3DM+Early+Access","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fc3f94cb93fd588db98d1a98a37a86f8eec8ee63","infoHashBuffer":{"type":"Buffer","data":[252,63,148,203,147,253,88,141,185,141,26,152,163,122,134,248,238,200,238,99]},"announce":[],"urlList":[]}}