{"title":"Stossel.2014.05.01.[You Cant Say That].Fox Business.CF.avi","uid":10089450,"size":345020946,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:fd569c8c1a10b12bf7485b267f3945fd21feb81c&amp;dn=Stossel.2014.05.01.%5BYou+Cant+Say+That%5D.Fox+Business.CF.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"skJGZV6z","files":-1,"time":1399170181,"description":"----------\n\nSTOSSEL - [You Can't Say That!] - Fox Business Network\n2014, May 01, Thursday\n\nXvid/MP3 AVI - encoded from medium quality ReplayTV stream\n\n----------\n\n[excerpted from John Stossel's blog:]\n\nRACIST SPEECH: Should LA Clippers owner Donald Sterling be fined and banned from the NBA for something he said in private? The Independents co-host Kmele Foster says &quot;outrage is appropriate&quot; but we need perspective.\n\nATTACKS ON GAY MARRIAGE: Former Mozilla CEO Brendan Eich lost his job because he donated money to a campaign that opposed legalizing gay marriage. Is this a good way to punish &quot;bigots?&quot; Austin Petersen of The Libertarian Republic says yes. Fox News contributor Deroy Murdock says no.\n\nPC UNIVERSITY: Students on campus are told, don't use phrases like &quot;that's so gay&quot; or &quot;man up.&quot; This photo campaign is from a Duke University project:\n\nCampus Reform reporter Katherine Timpf discusses.\n\nFEAR OF OFFENDING: Most white people now say &quot;African-American&quot; instead of &quot;black&quot; because they don't want to offend. But Vice Magazine co-founder Gavin McInnes says he likes offending people.\n\nIT'S WORSE IN CANADA: Sun News Network host Ezra Levant explains why limits on free speech are so much worse in other countries.\n\nMY TAKE: &quot;Kindly Inquisitors&quot; by Jonathan Rauch convinced me of the need for more free speech -even hate speech. He says, &quot;America was a society permeated by hate.&quot; This changed because people were allowed to say hateful things. That led others to fight the bigotry. The best way to convince people to become less bigoted is to allow all sides to speak openly. Then the best argument will win.","torrent":{"xt":"urn:btih:fd569c8c1a10b12bf7485b267f3945fd21feb81c","amp;dn":"Stossel.2014.05.01.%5BYou+Cant+Say+That%5D.Fox+Business.CF.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fd569c8c1a10b12bf7485b267f3945fd21feb81c","infoHashBuffer":{"type":"Buffer","data":[253,86,156,140,26,16,177,43,247,72,91,38,127,57,69,253,33,254,184,28]},"announce":[],"urlList":[]}}