{"title":"10 Mindful Minutes: Giving Our Children","uid":7855079,"size":1363148,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fd9a26993326bce5fa83c3a3cf55ca072f755219&amp;dn=10+Mindful+Minutes%3A+Giving+Our+Children&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1353726947,"description":"10 Mindful Minutes: Giving Our Children--and Ourselves--the Social and Emotional Skills to Reduce Stress and Anxiety for Healthier, Happy Lives by Goldie Hawn, Wendy Holden\nPerigee Trade | 2011 | ISBN: 039953606X, 0399537724 | English | 256 pages | PDF | 1.30 MB\n\n&quot;Goldie Hawn embodies delight and joy, and 10 Mindful Minutes radiates these. Her book can help any adult-parent, grandparent, teacher-make double use of their moments with the children they love and have a terrific time while helping shape that child's brain for a lifetime of resilience and happiness.&quot;\n-Daniel Goleman, author of Emotional Intelligence\n\nAcross the country, the revolutionary MindUP program, which was developed under the auspices of the Hawn Foundation, established by Goldie Hawn, is teaching children vital social and emotional skills. By understanding how their brains work, children discover where their emotions come from and become more self-aware. They learn to appreciate the sensory aspects of their lives and to value the positive effects of mindfulness, compassion, and kindness. This, in turn, empowers them to manage and reduce their own stress-and helps them be happy.\n\nThose who have seen the remarkable effects of this program have been eager to learn how to implement it in their own homes and use its practices for themselves, too. Now, for the first time, its secrets are being shared with all parents and children in 10 Mindful Minutes.\n","torrent":{"xt":"urn:btih:fd9a26993326bce5fa83c3a3cf55ca072f755219","amp;dn":"10+Mindful+Minutes%3A+Giving+Our+Children","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fd9a26993326bce5fa83c3a3cf55ca072f755219","infoHashBuffer":{"type":"Buffer","data":[253,154,38,153,51,38,188,229,250,131,195,163,207,85,202,7,47,117,82,25]},"announce":[],"urlList":[]}}