{"title":"Tracey Ullman - They Don't Know","uid":4814062,"size":110436356,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:fdb50f39147a6dafbada764e1985380ad65e85a4&amp;dn=Tracey+Ullman+-+They+Don%5C%27t+Know&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1238483685,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;They Don't Know&quot; is a song written by Kirsty MacColl. MacColl recorded it in 1979. It became popular on radio in the United Kingdom reaching #2 on the Airplay chart; however, complications involving a strike at her distributors prevented the single from being shipped and promoted properly, preventing release of the single. MacColl's version of &quot;They Don't Know&quot; thus failed to appear on the official UK Singles Charts, which are entirely sales-based.\n\nAlthough the song was not taken from an album, it later appeared on MacColl's compilation Galore(amongst others).\n\nIn 1983, Tracey Ullman included a version on her debut album, You Broke My Heart in 17 Places. This song was the album's most successful single, charting in the top ten of various national charts. MacColl performed backing vocals on Ullman's version and keeping her original &quot;bay-ay-be-ee&quot; in the middle of the song, which went to #2 in the U.K., #8 in the U.S., and became the theme song for the final three seasons of Ullman's later television series Tracey Takes On. The song was referenced in a PSA by Ullman and Chris Burke about Down syndrome.\n\nThe video for &quot;They Don't Know&quot; featured a cameo from Paul McCartney; at the time Ullman was filming a minor role in McCartney's film Give My Regards To Broad Street.\n\nIt is sometimes erroneously reported that Ullman's version of &quot;They Don't Know&quot; simply uses the backing track from MacColl's original single. In fact, the two versions are quite audibly different; Ullman's version (produced by Peter Collins) is in a different key (C, as opposed to the original's B), features a very slightly faster tempo, a somewhat different arrangement and a noticably different guitar solo to MacColl's version, which was produced by Liam Sternberg.\n\nThe confusion may stem from the fact that Ullman did use a previously-existing MacColl backing track when recording her own version of MacColl's &quot;Terry&quot; in 1984. (Both versions of &quot;Terry&quot; were co-produced by MacColl.)\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:fdb50f39147a6dafbada764e1985380ad65e85a4","amp;dn":"Tracey+Ullman+-+They+Don%5C%27t+Know","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fdb50f39147a6dafbada764e1985380ad65e85a4","infoHashBuffer":{"type":"Buffer","data":[253,181,15,57,20,122,109,175,186,218,118,78,25,133,56,10,214,94,133,164]},"announce":[],"urlList":[]}}