{"title":"Smokin Armadillos-Im A Cowboy(RP)","uid":11541231,"size":110410481,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:fdca554f93ef526e3067da5e6b07962b696bf038&amp;dn=Smokin+Armadillos-Im+A+Cowboy%28RP%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"RobsPalace","files":18,"time":1416670378,"description":"Robs Palace Presents \n\nName: Smokin' Armadillos - I'm A Cowboy\nReleaser: Kountry Kidd\nTitle: Audio File\nLanguage: English \nFormat: .MP3/Variable\nTotal Audio Files: 16\nTotal Size: 105MB\nBitrate: 256kbps\n\nSong List:\nSmokin' Armadillos - Could I Have Made It Back Then (4:16)\nSmokin' Armadillos - Country Music (3:49)\nSmokin' Armadillos - Dance With A Brand New Partner (3:33)\nSmokin' Armadillos - I'm A Cowboy [Radio Cut] (2:50)\nSmokin' Armadillos - I'm A Cowboy (4:22)\nSmokin' Armadillos - Let Your Heart Lead Your Mind (3:31)\nSmokin' Armadillos - Love Of A Lifetime (3:38)\nSmokin' Armadillos - Miracle Man (4:12)\nSmokin' Armadillos - My Girlfriend Might (2:29)\nSmokin' Armadillos - One More Town (3:26)\nSmokin' Armadillos - Red Rock (4:32)\nSmokin' Armadillos - The Big Bad Beat (Of My Broken Heart) (2:49)\nSmokin' Armadillos - The Legend Of Wooley Swamp (4:24)\nSmokin' Armadillos - Thump Factor (2:45)\nSmokin' Armadillos - Too Hot To Handle (2:56)\nSmokin' Armadillos - When Will I Ever Learn (3:48)\nThanks,\nEnjoy\n\nFAQ:\nWho are we?\nSimple answer...A Release Group but prefer to be considered a team\n\nDo you have a website?\nYes.\n\nWell what is the website address?\nnot sure\n\nAre you looking for releasers?\nYes, we could use some help with audio files, videos software...ect\n\nHow do I join the group?\nGreat question. your answer depends on you and your content you are posting...you will send a message to us and a couple of your OWN releases..not someone elses who got it from that guy next door who gave you when he got it from his pet turtle... it has to be fairly new content and more important the content HAS to be clean. After testing the content you have sent we will look it over for quality and viruses and send you a message if we think you will be a good part of the team we will add you.\nNOTE: We will NOT release anything that has any viruses or even false  warnings. To ensure this we will not release any .rar or other compression type methods other than .iso (movie/dvds)files. If you are accepted into the team it is your part to keep the files clean. If we recieve reports of Trojan horse or any type of viruses on any virus scan weather it be false positive or not you will be removed pending investigation. We look out for the users and want to have quality releases, with worry free downloads. \nRobs Palace in no way supports or promotes distribution of copyrighted content, we release the files as a &quot;try before you buy basis&quot; if you like the content we distribute then purchase the content like we did :)We are also not responsable if some of our releasers post copyright content.\n\nNone of theese files are not posted website or servers,that may or may not exist. nor do we host a torrent tracker, We also do not spread our torrents we have releaser who Spread our releases, Our releasers will only seed the torrent until its gets up to 2-3 seeds after that the releaser can remove the torrent from his/her harddrive and it cannot be re seeded from the releaser. Thank you","torrent":{"xt":"urn:btih:fdca554f93ef526e3067da5e6b07962b696bf038","amp;dn":"Smokin+Armadillos-Im+A+Cowboy%28RP%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fdca554f93ef526e3067da5e6b07962b696bf038","infoHashBuffer":{"type":"Buffer","data":[253,202,85,79,147,239,82,110,48,103,218,94,107,7,150,43,105,107,240,56]},"announce":[],"urlList":[]}}