{"title":"Coast to Coast AM December 28 2012","uid":7969259,"size":56686336,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:fdcb6b9e883cb8aecc4338e1104c2490abf386b3&amp;dn=Coast+to+Coast+AM+December+28+2012&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"runcdfirst","files":5,"time":1356788126,"description":"#we.are.some.of.the.leaders.on.the.motherpla.net\n\nDate: \t12-28-12\nHost: \tRob Simone\nGuests: \tOpen Lines, Christopher Michael Langan\n\nFilling in for George, Rob Simone (email) welcomed researcher and autodidact Christopher Michael Langan, in the first 90 minutes, for a discussion on his theory of the relationship between mind and reality which he calls the &quot;Cognitive-Theoretic Model of the Universe (CTMU).&quot; In detailing his background, Langan recalled how he'd scored very well in tests for high IQ organizations, like MENSA, which garnered the attention of the TV show 20/20. The program tested him and found that his intelligence actually exceeded the ceiling of standardized IQ tests. &quot;Then they can't measure your IQ, you're said to be 'off the charts,'&quot; he explained, &quot;at that point, all they can do is extrapolate.&quot; According to these estimates, Langan's IQ is believed to be somewhere between an astounding 190 and 210.\n\nOver the course of his appearance, Langan shared his theories on the nature of reality and how it corresponds with the mind. He noted that relativity suggests that anything observed outside of the body has already taken place in the past. As such, he put forward the concept that there are two reality systems at work, one within the mind and one operating externally in the physical world. &quot;In my world view,&quot; Langan extrapolated, &quot;everything begins in the form of something mental as a kind of internal reality and then is externalized through perception.&quot; As such, he opined that the material universe is merely the &quot;output stage&quot; and that the &quot;real guts of reality&quot; are in the present and future via the mind.\n\n------------------------------------\n\nDuring Open Lines, the subject of Sanskrit became a recurring topic amongst the callers, beginning with John in Oklahoma, who called it a &quot;perfect language&quot; because it is completely phonetic and contains characters for every sound that the human voice can make. Jeff in Alaska marveled that Sanskrit is the &quot;esoteric, magical, mystical, mathematical language of the Eastern world&quot; and suggested that it acts an ancient companion to Hebrew. Additionally, he theorized that Sanskrit and Hebrew were once part of a whole &quot;master language.&quot; Finally, Craig in San Jose contended that, based on his research, Sanskrit was not a spoken language but a code used by ancient priests to keep knowledge hidden from the masses.\n\nOther callers during the evening included Rob, who warned that gun control in America would ultimately result in the country being absorbed by a one world government. He lamented that, should this happen, the United States' legacy will be reduced to just &quot;a couple of pages in a world government history book.&quot; Later in the program, Alan in Springfield, Missouri called to raise awareness that the government had begun to install cameras &quot;everywhere around here&quot; and theorized that it is in preparation for a martial law scenario. Lucy in Texas recounted her premonition which foretold 9/11 and she revealed that a second vision, from 2003, conveyed a UN invasion of the United States.\nWebsite(s):\n\n    ctmu.org\n\n","torrent":{"xt":"urn:btih:fdcb6b9e883cb8aecc4338e1104c2490abf386b3","amp;dn":"Coast+to+Coast+AM+December+28+2012","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fdcb6b9e883cb8aecc4338e1104c2490abf386b3","infoHashBuffer":{"type":"Buffer","data":[253,203,107,158,136,60,184,174,204,67,56,225,16,76,36,144,171,243,134,179]},"announce":[],"urlList":[]}}