{"title":"Sly &amp; the Family Stone - Discography 1967-1974 [FLAC]","uid":8332778,"size":2734068354,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:fe1cf629744658d16c7a99dbd59d77c064115728&amp;dn=Sly+%26amp%3B+the+Family+Stone+-+Discography+1967-1974+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"rudown78","files":225,"time":1364919527,"description":"Sly &amp; the Family Stone - Discography 1967-1974\n\n\nSly &amp; the Family Stone harnessed all of the disparate musical and social trends of the late '60s, creating a wild, brilliant fusion of soul, rock, R&amp;B, psychedelia, and funk that broke boundaries down without a second thought. Led by Sly Stone, the Family Stone was comprised of men and women, and blacks and whites, making the band the first fully integrated group in rock's history. That integration shone through the music, as well as the group's message. Before Stone, very few soul and R&amp;B groups delved into political and social commentary; after him, it became a tradition in soul, funk, and hip-hop. And, along with James Brown, Stone brought hard funk into the mainstream. the Family Stone's arrangements were ingenious, filled with unexpected group vocals, syncopated rhythms, punchy horns, and pop melodies. Their music was joyous, but as the '60s ended, so did the good times. Stone became disillusioned with the ideals he had been preaching in his music, becoming addicted to a variety of drugs in the process. His music gradually grew slower and darker, culminating in 1971's There's a Riot Going On, which set the pace for '70s funk with its elastic bass, slurred vocals, and militant Black Power stance. Stone was able to turn out one more modern funk classic, 1973's Fresh, before slowly succumbing to his addictions, which gradually sapped him of his once prodigious talents. Nevertheless, his music continued to provide the basic template for urban soul, funk, and even hip-hop well into the '90s. \n\n\n1. A Whole New Thing (1967)\n2. Dance to the Music (1968)\n3. Life (1968)\n4. Stand! (1969)\n5. Greatest Hits (1970)\n6. There's a Riot Goin' On (1971)\n7. Fresh (1973)\n8. Small Talk (1974)\n\n\nEach album is the 2007 remastered version except for 'Greastest Hits'. Each album contains full artwork and audiochecker logs. Enjoy!!!!!","torrent":{"xt":"urn:btih:fe1cf629744658d16c7a99dbd59d77c064115728","amp;dn":"Sly+%26amp%3B+the+Family+Stone+-+Discography+1967-1974+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe1cf629744658d16c7a99dbd59d77c064115728","infoHashBuffer":{"type":"Buffer","data":[254,28,246,41,116,70,88,209,108,122,153,219,213,157,119,192,100,17,87,40]},"announce":[],"urlList":[]}}