{"title":"Stratego Multiplayer Premium v1.9.12 apk","uid":12889063,"size":36969029,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:fe37db421d84f7bfe22673eef2ef13e14b999ae4&amp;dn=Stratego+Multiplayer+Premium+v1.9.12+apk&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"tiropitaki","files":1,"time":1449087256,"description":"Stratego® Multiplayer Premium v1.9.12\r\n\r\nPlay the best Strategy game ever! The classic board game of battlefield strategy, now available on Android! \r\n\r\nDo you have what it takes to achieve victory against players all over the world on the battlefield? Defeat your opponents in the official Stratego ® Multiplayer battles!\r\n\r\nStratego is all about tactics, strategy and cold hard bluff, a combination of chess and poker. Millions of copies of this classic board game have been sold worldwide.\r\n\r\nProtect your flag against your enemies, and make sure to capture your opponent’s flag first! See you on the battlefield general.\r\n\r\nAre you a strategic player? You’ll love Stratego! Don’t hesitate any longer. Install NOW and prove your strategic skills with Stratego® Multiplayer!\r\n\r\nThe new version of Stratego appeals to a much broader audience. From kids to adults, beginners and hardcore Stratego© players, both male and female.\r\nGet ready for the ultimate strategy game and join the rapidly expanding group of Stratego fans!\r\n\r\n• Challenge your friends\r\nKeep your friends close, but your enemies closer: the Stratego friends list makes it easy to challenge your friends, and you can also add players you recently met in battle to your friends list.\r\n\r\n• Ranked Matches\r\nDo you have what it takes to become the best Stratego player in the world?\r\nFight against Generals and Marshalls! You will play against people of your own level and rise on the leaderboard to challenge the world champions of Stratego!\r\n\r\n• Unlimited Stratego battles\r\nPlay as many battles as you like!\r\n\r\n• Classic, and Quick battles\r\nPlay Stratego in the classic 40 vs 40 setup or choose a Quick battle and prove your strategic skills with an army of only 16 units.\r\n\r\n• New unit rank design\r\nThe look of the units has been completely re-styled for a better recognition of the ranks. You can still switch to ‘classic’ style if you like. And we will add more styles in the future.\r\n\r\n• Customizable setups\r\nCustomize your setups and save them for future battles.\r\n\r\nReviews:\r\n- &quot;I had completely forgotten how much fun the classic strategy board game Stratego was!&quot; - Kotaku\r\n- &quot;We’ve had a chance to play it, and fans of the board game version have plenty to be excited about!&quot; - Gamezebo\r\n- &quot; Stratego® Multiplayer is by far the best digital version of the old board game classic I’ve ever played!&quot; - Gamezone\r\n\r\nRequirements: Android 2.3 +","torrent":{"xt":"urn:btih:fe37db421d84f7bfe22673eef2ef13e14b999ae4","amp;dn":"Stratego+Multiplayer+Premium+v1.9.12+apk","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe37db421d84f7bfe22673eef2ef13e14b999ae4","infoHashBuffer":{"type":"Buffer","data":[254,55,219,66,29,132,247,191,226,38,115,238,242,239,19,225,75,153,154,228]},"announce":[],"urlList":[]}}