{"title":"Magellan Roadmate Maestro 2008-09 MAP UPDATES 31+POI US CANADA 2","uid":5081576,"size":1359996727,"categoryP":"applications","categoryS":"other_os","magnet":"?xt=urn:btih:fe79bd7df2fb6cc4c92500bf787c007ec0db9628&amp;dn=Magellan+Roadmate+Maestro+2008-09+MAP+UPDATES+31%2BPOI+US+CANADA+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"webmarek","files":6,"time":1252349688,"description":"UPDATE 9/07/09 5:20PM: TORRENT IS DOING EXCELLENT. THANKS TO ALL THE PEOPLE HELPING SEED!\n\n\n\nPREVIOUS UPDATE:\n\n********SEEEED!******** ;)\n\nGUYS, I LOVE TO SHARE GOOD STUFF, BUT IF YOU PEOPLE ALSO DON'T SEED THIS, I MAY CUT IT. I AM CAPABLE OF SEEDING AT A COMBINED RATE OF 600-800 KB/s FROM 2 LOCATIONS AT ONE TIME, THAT MEANS 2 STARTING SEEDS ON 2 SEPERATE BROADBAND CONNECTIONS. THERE ARE PEOPLE THAT DOWNLOAD HARD TO FIND STUFF AND THEN IMMEDIATELY DISCONNECT! I DID NOT UPLOAD THIS FOR THOSE PEOPLE, YOU SHOULD AT LEAST LEAVE IT GOING FOR A 1:1 RATIO OR MORE IF YOU ARE HAPPY WITH IT! WHY SHOULD I RUN TWO BROADBAND COMPUTERS IN TWO LOCATIONS AND WASTE ELECTRICITY ON THOSE GREEDY ASSHOLES THAT WILL NOT SHARE ANYTHING WHEN THEY ARE DONE?\n\n\n*THIS IS THE SECOND SEEDING ATTEMPT OF THIS TORRENT. THE FIRST HAD STRANGE PROBLEMS WHERE I COULD NOT SEED ANYMORE TO ANY OF THE PEERS AFTER A POWER OUTTAGE OCCURED IN MY AREA. THIS TIME I'M TRYING THIS ON TWO SERVERS THAT ARE IN DIFFERENT LOCATIONS.\n\n***PLEASE REMEMBER TO SEED AS MUCH AS YOU CAN SO THAT IT'S FAIR FOR EVERYONE AND THAT EVERYONE CAN BENEFIT FROM THIS TORRENT!\n\n\nAPPERANTLY THE PIRATE BAY HAS PROBLEMS TODAY AND COMMENTS CAN'T BE POSTED. YOU CAN EMAIL ME @ &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;74233136393526313f342d353c3b3b5a373b39&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt; IF YOU HAVE ANY QUESTIONS, I MAY BE ABLE TO HELP YOU.\n\n\ni28 DOT tinypic DOT com DASH 15dkn6t.jpg\n\ni27 DOT tinypic DOT com DASH 28077kk.jpg\n\n-Images from maestro 3225 (write the above with no spaces, replace dot and dash with . &amp; / characters)\n\n\n\nThese files will update both the USA and Canada maps to revision 31 that were realesed in 2008. Includes the latest 6 million POI for the USA and the latest POI for Canada. THIS UPDATES BOTH, THE BASEMAPS AND DETAILED MAPS to revision 31, unlike the last torrent uploaded by someone else here that only updates the detailed map data to 31. This torrent is complete in that it updates both the basemaps and detailed maps as well as POI for the 48 USA states and Canada. I have only tested these on the maestro 3225 and it works excellent. It will work on many others, you should test it and see, there is no danger as you can back up your old files first. Before updating, you should at least update to the latest firmware provided for your model for FREE from magellangps.com. Firmware contains fixes to the interface, functionality, performace and other misc problems that your GPS may have.\n\nYou don't need to install any special software to update the files, if you are using xp/vista or windows 7, your computer should see the GPS as a removable drive (TFAT partition), then just back up your old MAP folder somewhere to your PC then overwrite those specific files with the new ones.\n\nThis torrent was made after seeing the lack of people sharing and lack of a single complete map update for the maestro series of gps's other then having to pay too much for them to Magellan. Everyone knows that Magellan is still selling gps's in stores with old 2005-2006 map data on them and then they want to charge you $80 to update maps on a gps that you just purchased new. There's a whole bunch of confused people looking and asking for them, but all these updates were downloaded from different places in ONE DAY that I just googled for FREE and compiled in this torrent in only one afternoon. This might work on the ROADMATE series as well, as others have reported by the last 2008 torrent that someone uploaded that only updated the 48USA detailed maps to rev.31 and the 6 million POI, but nothing else.\n\nSafe &amp; happy driving.\n\n\n\nMisc Magellan MAP details:\n\nBasemaps vs. Detailed Maps: \n\nThe unit switches automatically to a detailed map when a detailed map cover the majority of the displayed area, and the zoom scale is 0.40 (700 meters) miles or closer.  The detail map can be set to start appearing at higher or lower zoom levels on the unit by pressing the Menu key, choosing Map Setup, and choosing a different Detail setting.\n\n\n","torrent":{"xt":"urn:btih:fe79bd7df2fb6cc4c92500bf787c007ec0db9628","amp;dn":"Magellan+Roadmate+Maestro+2008-09+MAP+UPDATES+31%2BPOI+US+CANADA+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe79bd7df2fb6cc4c92500bf787c007ec0db9628","infoHashBuffer":{"type":"Buffer","data":[254,121,189,125,242,251,108,196,201,37,0,191,120,124,0,126,192,219,150,40]},"announce":[],"urlList":[]}}