{"title":"Encyclopedia of Stem Cell Research (Vols 1 and 2){BBS}","uid":6630381,"size":16314777,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fea03acd9ffbf676d90fcd3da864a828b4f8c473&amp;dn=Encyclopedia+of+Stem+Cell+Research+%28Vols+1+and+2%29%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"bigbluesea","files":-1,"time":1314311236,"description":"What is a stem cell? We have a basic working definition, but the way we observe a stem cell function in a dish may not represent how it functions in a living organism. Only this is clear: Stem cells are the engine room of multicelluar organisms-both plants and animals. However, controversies, breakthroughs, and frustration continue to swirl in eternal storms through this rapidly moving area of research. But what does the average person make of all this, and how can an interested scholar probe this vast sea of information?\n\nThe Encyclopedia of Stem Cell Research provides a clear understanding of the basic concepts in stem cell biology and addresses the politics, ethics, and challenges currently facing the field. While stem cells are exciting alone, they are also clearly fueling the traditional areas of developmental biology and the field of regenerative medicine. These two volumes present more than 320 articles that explore major topics related to the emerging science of stem cell research and therapy.\n\nKey Features\n\nÃ‚Â· Describes the different types of stem cells that have been reported so far and, where possible, tries to explain for each age, tissue, and species what is known about the biology of the cells and their history\n\nÃ‚Â· Captures a strong sense of stem cell biology as it stands today and provides the reader with a reference manual to probe the mysteries of the field\n\nÃ‚Â· Considers various religious, legal, and political perspectives\n\nÃ‚Â· Includes selected reprints of major journal articles that pertain to the milestones achieved in stem cell research\n\nÃ‚Â· Elucidates stem cell terminology for the nonscientist.\n\nKey Themes\n\nÃ‚Â· Biology\nÃ‚Â· Clinical Trials\nÃ‚Â· Countries\nÃ‚Â· Diseases\nÃ‚Â· Ethics\nÃ‚Â· History and Technology\nÃ‚Â· Industry\nÃ‚Â· Institutions\nÃ‚Â· Legal\nÃ‚Â· Organizations\nÃ‚Â· People\nÃ‚Â· Politics\nÃ‚Â· Religion\nÃ‚Â· States\n\nWith contributions from scholars and institutional experts in the stem cell and social sciences, this Encyclopedia provides a primarily nonscientific resource to understanding the complexities of stem cell research for academic and public libraries.\n\n\n    * Hardcover: 952 pages\n    * Publisher: Sage Publications, Inc; 1 Reprint edition (August 15, 2008)\n    * Language: English\n    * ISBN-10: 141295908X\n    * ISBN-13: 978-1412959087","torrent":{"xt":"urn:btih:fea03acd9ffbf676d90fcd3da864a828b4f8c473","amp;dn":"Encyclopedia+of+Stem+Cell+Research+%28Vols+1+and+2%29%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fea03acd9ffbf676d90fcd3da864a828b4f8c473","infoHashBuffer":{"type":"Buffer","data":[254,160,58,205,159,251,246,118,217,15,205,61,168,100,168,40,180,248,196,115]},"announce":[],"urlList":[]}}