{"title":"Jardins au desert, Evolution des pratiques et savoirs oasiens...","uid":4403947,"size":11521109,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fec023d1e1316f3895eae724e2145d1d11c65958&amp;dn=Jardins+au+desert%2C+Evolution+des+pratiques+et+savoirs+oasiens...&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"EskimOasis","files":-1,"time":1221848489,"description":"Ouvrage de Vincent Battesti, publie en 2005 dans la collection A travers champs des editions IRD (42 euros version papier).\n\nCe livre est depuis peu en archives ouvertes, c'est-a-dire disponible a tous au complet et gratuitement.\nVous le retrouverez ici egalement: http://halshs.archives-ouvertes.fr/halshs-00004609\nSite web de l'auteur: http://vbat.org\n\nVincent BATTESTI - Jardins au desert, evolution des pratiques et savoirs oasiens, Jerid tunisien, Paris, editions IRD, coll. A travers champs, 2005, 440 p.\nISBN 2-7099-1564-2\nISBN-13 9782709915649\n(Format : 17 x 24 cm, 60 photog., 45 fig., 15 tab., 42 euros) \n\n\n*************\n\nLa quatrieme de couverture presente ainsi l'ouvrage :\n\nLa presence d'oasis dans le Sahara peut sembler une aberration ecologique. Les palmeraies et les jardins qu'elles abritent sont en fait le fruit d'une conquete millenaire qui se poursuit encore aujourd'hui. Ces paysages artificiels, terroirs soigneusement faconnes et entretenus, sont l'archetype des systemes naturels anthropises.\n\nCet ouvrage a ete realise a partir d'enquetes de terrain menees dans le Jerid tunisien, mais aussi dans le Tassili n'Ajjer (Djanet, Algerie) et l'oued Draa (Zagora, Maroc). Si cette perspective comparative revele la diversite des pratiques et savoirs oasiens et des relations a l'environnement, elle met aussi en valeur les dynamiques locales qui se deploient au-dela de l'habituel dualisme entre tradition et modernite. Par ailleurs, plusieurs echelles d'etude, de la planche de culture au jardin et du parcellaire a la palmeraie, permettent de souligner la variete des articulations entre facteurs ecologiques, economiques et sociaux.\n\nLe Sahara cultive n'offre pas une mais des natures oasiennes en constante evolution, construites a partir de cette richesse anthropologique.\n\n***** Les commentaires sur l'ouvrage sont bienvenus !\n","torrent":{"xt":"urn:btih:fec023d1e1316f3895eae724e2145d1d11c65958","amp;dn":"Jardins+au+desert%2C+Evolution+des+pratiques+et+savoirs+oasiens...","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fec023d1e1316f3895eae724e2145d1d11c65958","infoHashBuffer":{"type":"Buffer","data":[254,192,35,209,225,49,111,56,149,234,231,36,226,20,93,29,17,198,89,88]},"announce":[],"urlList":[]}}