{"title":"An Architecture of the Ozarks - The Works of Marlon Blackwell (A","uid":9450728,"size":19011941,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ffa106f438ae0202704fb5ffbd0336013d70d783&amp;dn=An+Architecture+of+the+Ozarks+-+The+Works+of+Marlon+Blackwell+%28A&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"STBGD","files":-1,"time":1389180594,"description":"Marlon Blackwell, &quot;An Architecture of the Ozarks: The Works of Marlon Blackwell&quot;\nEnglish | 2005-03-01 | ISBN: 156898488X | 195 pages | PDF | 18.1 mb\n\n&quot;I live, practice, teach, and build in northwest Arkansas, in the foothills of the Ozark Mountains. It's a place considered to be in the middle of nowhere, yet ironically close to everywhere. It is an environment of real natural beauty and, simultaneously, one of real constructed ugliness. Abandonment, exploitation, erasure and nostalgia are all aspects of this place and are conditions as authentic as its natural beauty and local form. This land of disparate conditions in not just a setting for my work it is part of the work. By choosing to live and work here to call it home I've been able to get beyond the surface of things, to turn over the rock and discover the complex and rich underbelly of my place its visceral presences and expressive character that so informs and sustains my efforts. I am working from the conviction that architecture is larger than the subject of architecture.&quot; Marlon Blackwell\n\nMarlon Blackwell is a passionate polemicist. He's also a very gifted architect. The projects in this first monograph on the &quot;radical ruralist,&quot; as touted by the Royal Institute of British Architects, offer a new architectural language that at once celebrate the vernacular and transgress the boundaries of the conventional. The results are we can't help it, there's no better word beautiful.\n\nIncisive essays by David Buege, Dan Hoffman, and Juhani Pallasmaa and lush photography by Tim Hursley, Richard Johnson, and Kevin Latady explore Blackwell's projects, including his widely acclaimed Keenan TowerHouse, the award-winning Moore HoneyHouse, 2Square House, and Flynn-Schmitt BarnHouse, studios, and institutional buildings.","torrent":{"xt":"urn:btih:ffa106f438ae0202704fb5ffbd0336013d70d783","amp;dn":"An+Architecture+of+the+Ozarks+-+The+Works+of+Marlon+Blackwell+%28A","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ffa106f438ae0202704fb5ffbd0336013d70d783","infoHashBuffer":{"type":"Buffer","data":[255,161,6,244,56,174,2,2,112,79,181,255,189,3,54,1,61,112,215,131]},"announce":[],"urlList":[]}}